{"meta":{"title":"Kevin's World","subtitle":"Analysis is beautiful!","description":"","author":"NJU-Kevin","url":"https://nju-kevin.github.io","root":"/"},"pages":[],"posts":[{"title":"life-119","slug":"life-119","date":"2023-09-25T13:58:51.000Z","updated":"2023-09-25T13:58:52.041Z","comments":true,"path":"2023/09/25/life-119/","link":"","permalink":"https://nju-kevin.github.io/2023/09/25/life-119/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"周末学习小结","slug":"life-118","date":"2023-09-24T14:13:21.000Z","updated":"2023-09-24T14:24:39.431Z","comments":true,"path":"2023/09/24/life-118/","link":"","permalink":"https://nju-kevin.github.io/2023/09/24/life-118/","excerpt":"","text":"这周末两天在图书馆做了不少事情。周六主要做课内的习题，把拓扑、偏微分方程、数理统计的课后老师没有布置的习题研究了一下。或许没有太多时间去另外刷一本书（类似谢惠民那种），但是我坚信如果课后习题能每道都认真完成，不管是否布置作业，都去思考思考，长期以往确实是很有裨益的。而且我思考了之后才发现，课后题中价值真不少，做题的过程中能发现我看书学习正文部分时理解得不到位的情况，从而加深对于课本前面定理的理解，尤其是拓扑，这是一门逻辑极为严谨的学科，证明的推导过程中不能出现模棱两可，似是而非的地方，最理想的情况当然是平时就每一个地方都弄弄透，哪些是定义，哪些的结论，哪些是错误的刻板印象，在每周的学习中就要有意识地去积累。因此通过这周的安排，我认为今后都很有必要每周末留出一天的时间用于做书本的课后习题，这对于书本内容的理解以及解题方法的掌握都是有极大帮助的。 周日继续在图书馆看$Conway$的泛函分析，最近把这本书通读了一遍，补充了一些$Salamon$中没有讲到了一些弱拓扑、线性算子理论内容，大部分的内容都还是够的。另外还花时间复习了一下之前学过的$Gelfand$变换，$C^*$代数的表示，正规元的泛函积分以及正规元的谱测度等内容。后来还有时间就继续往下学了点$Hilbert$空间的正规算子理论，终极版的泛函积分就是可分$Hilbert$空间中的正规算子关于本性有界函数在正规算子生成的$von \\space Neumann$代数上的积分，这部分我暂时只是泛泛地看了看，还需要今后反复回看，到这部分的内容都是一环扣一环的，并且有很多很美妙的结论，可能这些就是泛函的部分精华所在吧。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"开卷有益，闭卷有味","slug":"life-117","date":"2023-09-22T13:46:20.000Z","updated":"2023-09-22T14:22:22.249Z","comments":true,"path":"2023/09/22/life-117/","link":"","permalink":"https://nju-kevin.github.io/2023/09/22/life-117/","excerpt":"","text":"今天中午参加了国家奖学金答辩，一开始说实话还有些紧张，后来发现其实都是自己想多了，平时还是要对自己自信一点，虽然说在匡院大家的方向都不同，各个学科也没有什么可比性，但是至少在数学方向，我认为我已经能够做到名列前茅了，因此理应对自己自信。另外就是在整理PPT的时候其实也发现自己在过去的一年里，确实有不少经历，也获得了不少成果，可谓是收获满满，因此我觉得其实每天一步一个脚印，每天坚持往前近一点，一年过后会发现，已经比去年的自己优秀很多了，我认为这就是成长，这就是进步。 这个周末打算这样安排，首先花一天的时间把课内的课后题刷一刷，要做到能很熟练地运用各种技巧，只有功夫花在平时，到考试的时候才不会手忙脚乱，复习的时候也能更加从容；另一天准备进行深度学习，最近在看$Conway$的泛函分析，对于$Salamon$的教材也是一个内容的补充，二者都有优点也有缺点，因此参照着看能够比较不同书定义的方式以及不同性质的等价关系，我认为是十分有益的，正如秦理真所说，学习本就是循环往复，螺旋上升。开卷有益，闭卷有味，如是而已。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"课内亦别有洞天","slug":"life-116","date":"2023-09-21T12:59:20.000Z","updated":"2023-09-21T13:20:43.867Z","comments":true,"path":"2023/09/21/life-116/","link":"","permalink":"https://nju-kevin.github.io/2023/09/21/life-116/","excerpt":"","text":"最近几天利用空余时间写了写作业，发现目前学校的作业中还是能找到很多有价值，有意思的题目的。昨天实变函数作业有一道题想了一个下午没想出来，网上一开始也没搜到，但是后来仔细一想这种题目应该比较经典，于是用电脑又重新在数学解题论坛上搜了搜，发现搜到了，有一位外国友人在八年前就问过这个问题了，再一看解答，发现思路和我想的不一样，我当时就完全没有朝着“正确”的地方去想。再一看解答，发现的确，如果能朝着“正确”的思路去想，其实题目本身并不难，然而很多时候就是这样的一种思路很重要，如果有了“正确”的思路，很多题目并没有想象中的难，不过找到适用于这道题的思路就显得很有含金量，因为并不是什么时候我们都能够很快抓到适用于该题的方法和思路的。 前几天和秦理真老师发邮件交流了一下关于泛函的想法，秦老师回我的邮件我认为写得很好，贴在此处留作今后时常阅读： 我未读过 Salamon 的书，也不知此人是谁。 我觉得王声望的书就很好，选材恰当，浅显易懂。而且王书的习题较难，能得到很好的训练。比王声望的书更简单的，有华东师大的书，写得非常好。 若你想读比此二书更深的书，可读 Conway 的 A course in functional analysis。此书是泛函的标准研究生教材，作者是泛函专家。（你说我是泛函专家，不谦虚地讲，我真不是。）窃以为，Conway 的书虽远非尽善尽美，但我也难找比之好的泛函入门的书。恕我孤陋寡闻。 我读过的最好的泛函分析的书当属 Grothendieck 著 Topological vector spaces。但该书难度大，不适合初学者。你能读懂，则最好不过。 若你现在学得不清楚，也是正常的。总之开卷有益，闭卷有味。学习本该循环往复，螺旋上升。待下学期开泛函课，你再学一遍，定会大有所进。 秦理真","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"行稳致远，静待花开","slug":"life-115","date":"2023-09-19T10:37:02.000Z","updated":"2023-09-19T10:56:07.085Z","comments":true,"path":"2023/09/19/life-115/","link":"","permalink":"https://nju-kevin.github.io/2023/09/19/life-115/","excerpt":"","text":"昨天线上观摩了数学系的高额奖学金的学生答辩，感觉学长们都还是很厉害的，尤其是大四的几位学长，可以说是各方面都有许多突出的亮点，课内功课分数都考得很高，课外钻研的也很多，各类数学竞赛中也都取得了不错的成绩，我十分钦佩，也以他们为榜样。结束之后和张学长又聊了聊，其实他所传达的就是还是要多看看书，多看书提升视野，开拓眼界，提高认知的水平和学习的深度，这样也能对于课内学习起到一个相辅相成的作用。其次，他也表示要相信自己，先相信自己，然后到了大三更要坚持下去，不要躺平。虽然很多人说还有一学期的时间改变不了什么了，但是他说其实能改变很多东西，他之前学分绩在数学系的排名没有那么顶尖，但经过老师的鼓励，他还是申请了北大，最终靠平时的积累被数院预录取。其实从他的身上我能学到不少。自从上学期孙永忠的课上认识他后，我也发现了不少他身上的可贵的品质，例如数学学习的钻研精神（基本上每天去图书馆都能遇到他），与同学保持交流，并且他周围的同学也都是数学系的精英，同时他也经常与老师交流，之前上石亚龙老师的流形与几何课，看到每次下课后他都会到教室去找石老师问问题。这些都是值得我学习的，我也在努力去朝着这个方向去做，这就是榜样的力量。 我也问了问关于焦虑的问题，他其实也在给我加油打气，他觉得如果身边的人总是在焦虑，那就不要和他们玩，最后一个学期也很关键，一定要坚持下去好好看书，多学点东西多积累一些。这么想想其实时间也很紧迫了，最早的一批冬令营在本学期结束，而本学期已经快$\\frac{1}{4}$过去了，平时的作业量也上来了，本周刚过两天已经布置了四十几道作业题。不过现在我的心态倒是好了很多，作业认真做，这也是对于课堂的反馈，而不是非要做多少多少课外题。学长也表示，大三的课程老师出题的风格都比较友好，基本上都是和作业相仿的难度，因此我应该把平时的作业认真弄清楚，有余力了再去看看相应的参考书；如果每门课程的参考书看完还有余力，那么可以看看自己感兴趣的泛函分析之类的，我觉得是完全不冲突的。数学就是重在积累，此之所谓行稳致远，静待花开。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"谱测度、$C^*$代数表示与$GNS$构造","slug":"life-114","date":"2023-09-18T05:03:26.000Z","updated":"2023-09-19T11:17:34.807Z","comments":true,"path":"2023/09/18/life-114/","link":"","permalink":"https://nju-kevin.github.io/2023/09/18/life-114/","excerpt":"","text":"今天早上实变函数上课前到图书馆继续看昨天看的$Conway$，在引入$Gelfand$变换之后，我们可以得到$C^*$代数中正规元的泛函积分，即 f(a)=\\rho(f)其中$f\\in C(\\sigma(a))$，$\\rho$是使得$Gelfand$映射和$\\tau:C(\\sigma(a))\\to C(\\Sigma)$构成交换图的映射，实际上就是二者的复合。$f(a)$就是$\\rho(f)$的恒等算子。 对于每个$C^*$代数$\\mathcal{A}$，都可以找到一个代数同构$\\pi$以及一个$Hilbert$空间$\\mathcal{H}$满足 \\pi:\\mathcal{A}\\to \\mathcal{B}(\\mathcal{H})此即$C^* $代数表示。从而$GNS$构造则说明了任何一个$C^*$代数，$\\phi$为其上的一个正线性泛函，则存在一个循环表示 \\phi(a)=\\langle e,\\pi(a)e \\rangle当$C^ $代数取成是$C(K)$时，其上的$C^$表示$\\rho$，若满足$\\rho(1)=1$,$||\\rho||=1$，那么该表示是一个正线性泛函，利用$Riesz$表示则得到一个正则的$Borel$测度，此即为谱测度。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"$Conway$泛函初探","slug":"life-113","date":"2023-09-17T14:05:19.000Z","updated":"2023-09-17T14:28:56.824Z","comments":true,"path":"2023/09/17/life-113/","link":"","permalink":"https://nju-kevin.github.io/2023/09/17/life-113/","excerpt":"","text":"今天接着昨天的泛函继续往下看，从前文我们已经知道，对于复$Banach$空间上的复有界线性算子，我们可以定义关于全纯函数的泛函积分；而如果想要定义连续函数的泛函积分，那么只在一般的$Banach$空间上则无法做到了，此时我们可以在复$Hilbert$空间上对于自伴算子定义在算子谱上关于连续函数的泛函积分。后面引入$Gelfand$变换之后我们会发现这里的自伴算子可以拓宽为正规算子关于谱上连续函数的泛函积分。不过$Salamon$在引入$Gelfand$变换的时候我觉得写的有些迷糊，有点乱，一开始抓不住要点。因此我就到书架上翻翻有没有其他介绍相关理论的书。 一开始看到了算子理论和$C^$代数的$AMS$系列丛书，但是后来觉得内容过于专业，于是拿出了经典的$Conway$的泛函分析。翻到相应部分之后发现$Conway$写的这部分很清晰。他直接介绍一般的交换$Banach$代数上以及$C^-$代数上的结论，包括介绍了$Banach$代数的极大理想其实就是上面同态的核，这个刻画我认为对于$Gelfand$变换的建立很有帮助，得到这个之后就能得到所谓的极大理想空间，上面的同态作用在某个元素$a$上得到的就是这个元素的谱。 看到八点多我意犹未尽，但是由于时间原因，我记下了比较重要的内容，回去继续消化。的确，$Salamon$写的更为具体，写了$Hilbert$空间上的泛函积分理论，事实上这些都其实是$C^*$代数上的结论，从这个角度来看，$Conway$由于讲的是一般的理论，因此更加简洁明了；而如果要看具体的例子，那么可以看$Salamon$上的具体应用。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"全纯泛函积分与谱理论初探","slug":"life-112","date":"2023-09-16T11:58:31.000Z","updated":"2023-09-16T12:39:37.531Z","comments":true,"path":"2023/09/16/life-112/","link":"","permalink":"https://nju-kevin.github.io/2023/09/16/life-112/","excerpt":"","text":"今天上午琢磨了一下奖学金的表格和PPT，弄好了之后看了点泛函，首先把从昨天中午开始没太搞明白的全纯泛函积分(Holomorphic Functional Calculus)里的一些证明步骤搞懂了，理解之后才知道我之前是因为没有完全理解它的定义。由于是全纯函数作用在一个有界复算子上得到另一个复线性算子，因此复分析里的$Cauchy$积分公式、求导公式都能继续应用。在这里记录一下我遇到的问题：$\\lambda \\in \\sigma(A)$，由 f(z)-f(\\lambda)=(z-\\lambda)g(z)可以得到 f(\\lambda)\\mathbb{1}-f(A)=(\\lambda \\mathbb{1}-A)g(A)如今看来其实是一个很简单的问题，我们可以从下面推上面，用定义即可。后来便看了看复$Hilbert$ 空间以及其中的正规算子、酉算子、自伴算子，以及各自的谱的特征。其中我发现了很多与高等代数相关的内容，比如紧算子的谱分解定理，其实就是高等代数中的空间第一分解定理，只不过泛函分析研究的是无穷维空间上的紧算子，而矩阵可以视作线性变换，为有限维空间上的有限秩算子，当然是紧算子。所以$Jordan$标准形那块理论的背景其实是紧算子的谱分解。又例如后面讲到了复$Hilbert$空间上有界线性算子的奇异值，为 \\lambda^2 \\in \\sigma(A^*A)中的元素，那么其实这与矩阵的奇异值也是相同的，因为矩阵的特征值就是算子谱中的元素。所以，难怪说泛函分析是用数学分析研究高等代数，如今一想的确如此，只不过高等代数中讲的都是有限维空间，而泛函分析则关注更一般的理论，有限维无限维一同研究，其妙无穷。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"算子值函数","slug":"life-111","date":"2023-09-14T13:17:09.000Z","updated":"2023-09-14T13:35:39.748Z","comments":true,"path":"2023/09/14/life-111/","link":"","permalink":"https://nju-kevin.github.io/2023/09/14/life-111/","excerpt":"","text":"今天上午上了应用随机过程和偏微分方程两门课，应用随机过程介绍了$Markov$链及其性质，有一个很有意思的应用：如果兔子的运动满足$Markov$性质，那么守株待兔其实是合理的，因为$Markov$过程具有常反性，在经过一定的时间后返回原点的概率为1，也就是一定会回来，只不过这个时间我们或许等不起。当然这只是一个笑话，实际问题不可能真如上述所言，但是也能看出随机过程其实是与生活中的随机现象密切相关的，而当我们研究比较一般化的随机过程的时候，其理论则会显得很是抽象，因为要具有一定的普适性。现在越来越感觉随机过程十分有趣，可惜我对它的了解还不算很多，掌握得更不能说有多好，还需要平时再多花点时间看看上课讲义和$Durret$。 $PDE$暂时而言物理意味还很强，不过如果认真去理解，反复去复盘，还是能够理解其内涵的，这种引入很多同学觉得没有必要，毕竟这是一门数学课，没必要讲这么多$motivation$，不过我觉得这其实是一种暗示，暗示偏微分方程其实都是有具体的物理背景和实际意义的，如果一个方程毫无实际意义，则也没什么研究的必要，毕竟目前人们对于偏微分方程理论还知之甚少，不如先研究研究有实际意义的方程。 傍晚做完作业后终于有时间看点$Salamon$泛函第五章的内容，也就是谱论。前面是一些谱理论的预备知识，也就是引进所谓的复$Banach$空间，以及如何对紧区间到$Banach$空间的函数做积分。一般而言函数的取值都是实数或者复数，总之都是取在数域上的，然而这时函数的取值是在$Banach$空间$X$上的，此时的积分则用到对偶空间。也就是当$X$里的元素没办法弄出实数，那就用对偶空间的元素和$X$中元素配对，这样就得到了实数。更一般地，书中还对全纯函数进行了推广，尤其是定义了算子值全纯函数，也就是函数的像是一个算子，算子又能作用在一个空间上映成另一个空间，有点像是全微分，全微分把某一点映成这点的微分，而这点的微分又是一个线性映射。从这里也能看出，越到后面，学的东西越是宽泛，很多东西也开始不断推广，推广并不是为了看上去复杂，而是后面的理论的的确确需要用到，将数学分析和高等代数相结合的泛函分析，的确是一门有趣的学科。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"和吕勇老师的交流","slug":"life-110","date":"2023-09-13T13:59:30.000Z","updated":"2023-09-13T14:26:50.275Z","comments":true,"path":"2023/09/13/life-110/","link":"","permalink":"https://nju-kevin.github.io/2023/09/13/life-110/","excerpt":"","text":"今天中午下课后约了实变函数老师吕勇到教工一食堂（也就是上次和图书馆馆长吃饭的食堂）共进午餐，顺便交流一些心得体会。我是周一晚上发的邮件，吕老师也很热心，直接提出可以周三下课后一起吃个饭，顺便交流一下。其实也没什么问题想要问，主要是数学漫谈，从实变函数到泛函分析到偏微分方程到概率统计、代数几何等等。当然，吕老师是实变函数的授课老师，我主要和他谈了谈关于$Rudin$和$Folland$等实分析名著里不同概念的引进，他也问了问我的学习进度，我也简单介绍了一下我的个人情况。实变函数里测度的引入，尤其是$Lebesgue$测度的引入是有很多不同的方式的，每本书上写的思路都不一定一样，但最后得到的$Lebesgue$测度都是一样的。这其实就启示我们，学习的时候要多多参考，博采众长，或许能在别的书里发现不一样的东西。 我还问了问关于忘的事情，事实上这个事情我问过苗栋、孙永忠等许多数学系老师，我只是好奇每个老师的想法是怎么样的，吕老师也表示，忘是很正常的事情，比如他很久不用复分析的东西，那么复分析的内容就会淡忘。但如果忘了就重新去看，不断加强记忆，或者关联着去记，如是而已。 关于分析学的未来发展，和未来规划，吕老师表示纯分析的科研内容已经很狭窄了，各部分工作其实都做的比较完善了，因此建议我可以去研究一些分析的应用方向，例如偏微分方程、概率等等。统计其实不算很纯数学，但是和分析还是有关联的，而且这些专业的学生也可以进入业界，在公司里实现自己的人生价值，也不失为一种选择。所以其实路子还是有很多的，关键看自己的能耐了。落到实处，就是认真过好每一天。 下午到晚上一直在做作业，有一道实变作业做了估计有一个小时还是没推出来，最后搜了搜发现思路不一样，换个思路只要几行的事情，这种解题技巧就是我需要学习的。虽然那种类型的题目用我一开始的硬方法理论上能解决，但是确实比较繁琐，而且还不一定能证明出来。所以说确实还有很多东西要学啊！学无止境。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论道","slug":"life-109","date":"2023-09-12T11:10:01.000Z","updated":"2023-09-16T12:07:05.962Z","comments":true,"path":"2023/09/12/life-109/","link":"","permalink":"https://nju-kevin.github.io/2023/09/12/life-109/","excerpt":"","text":"今天来谈一谈我的价值观中所谓的“道”。实际上，每个人心中的“道”都不一样，“道”既可以是指学术上的理论，亦可以指心中的价值观和理念，等等。往小了说，“道”反应一个人内心的追求和看待问题的方式；往大了说，“道”能够在一定程度上影响人的境界，进而影响一个人所能达到的高度。 我内心的“道”是在实际生活中遇到各种问题后，在解决问题的途中所阐发出的思考与感悟，其中所结合的观点和思想来源于佛教禅宗、道教、儒教等等，当然，对我影响最大的是禅宗，可以说，其中的很多的思想，都是人生过程中不可多得的财富。 我认为，一个人来到这个世界上，看待世界万物的观点和角度能够决定这个人的境界高度。在我的“道”中，如果想要一言以蔽之，那就是“世间本无黑白”。我认为，一个人所经历的三个阶段可以划分为：一：认为世间只有黑白；二:认为世间不止黑白；三：认为世间本无黑白。处在第一个阶段的时候，看事情过于地片面化，并且认为这个世界是一个双极的世界，也就是事情不是好就是坏，世界上只有好人和坏人，等等。处于这个阶段，人们还没有意识到世界的多元性。当达到第二个阶段时，对于世界已经有了比较多的了解，很多时候会发现除了黑白以外还有别的颜色，好人有的时候也是坏人，坏人有的时候也是好人，因此不能过于绝对地去评价、看待事物。因此，人们看待这个世界开始变得更加客观，往往会考虑到事情的多面性。不过，当一个人经历了很多事情之后，最终会发现，世间本无黑白，所谓黑与白都是人为去约定、定义的。如果能看到这一点，那么人生其实就能看得很通透了。为什么这么说呢？世间本无黑白，许多自己经历的所谓挫折也好，苦难也好，其实也是自己这么认为的。苏东坡能将逆境看成顺境，实际上就说明了他已经看到了人生的真谛。我们每一个人所经历的事情，对自己有利也好，对自己不利也好，都是我们自己的评估，如果想要改变这种认知，其实也十分简单，我们只需要转换我们的思想就好。很多时候生活中遇到的事情会影响我们的心态，其实这说白了就是自己没能真正做到“世间本无黑白”，还是陷入了惯常的认知评估中。因此，如果想要从世间得到解脱，倒真不必去世外寻觅，既不需要到深山老林里去修行，也不需要找一个世外桃源与世隔绝。入世就是出世，如果我们能够把自己的内心想明白，让我们的思想不被世间的通俗价值体系所绑架、束缚，那其实就真正得到了解脱。真正的解脱是内心的解脱，而想要解脱内心，则只能靠自己。通过平日里的崇德修身，不断体察自性，在不断经历世间的种种考验后，让自己的内心运用自如。 自性若悟，众生是佛；自性若迷，佛是众生。 正如南宗所言，佛也好、菩提也好，本来无一物，因此我们不必向外追寻，而应向内自省。修炼自性是禅宗的终极话题，人生亦是如此。我们每个人经历这么多的事，到头来其实还是磨练的内心。而如果要得悟，也不是说非要经历多少的磨难和挫折。每个人的佛性都是一样的：“人有南北，佛性本无南北”，关键看每个人的悟性，有的人悟性高，即使没有经历什么事情，也能看到人生的本质；有的人只追求表面功夫，内心不去思考，即使天天静坐，即便历经世间苦难，或许仍不能悟。 焦虑之时，有几句话能够很好地解决焦虑，共勉： 车到山前必有路，船到桥头自然直； 该是你的，都是你的； 一切看缘，努力做好自己的事情，把自己能够决定的尽最大努力去做，剩下的交给缘分； 如果注定会到某个地方，兜兜转转最后都会到达，因此不必过于在意自己的轨迹，随遇而安。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"数学建模国赛回顾","slug":"life-108","date":"2023-09-10T08:59:31.000Z","updated":"2023-09-10T13:22:02.782Z","comments":true,"path":"2023/09/10/life-108/","link":"","permalink":"https://nju-kevin.github.io/2023/09/10/life-108/","excerpt":"","text":"从9.7晚上六点至9.10晚上八点是数学建模国赛的比赛时间，这三天每个小队合力完成一篇针对赛题的论文撰写，可以说任务量还是蛮大的。我们队做的是C题，因为A、B题物理背景过于强，建模难度较高，而C题则是预测、评价、策略类问题，相对而言建模难度没有那么高，但难点在于需要考虑的东西非常多，数据量非常庞大，数据处理和数据分析部分十分繁琐。C题说的大概是超市里卖蔬菜往往都有时效性，很多蔬菜容易损坏变质，因此每次进货进哪些货，进多少货，成了很重要的问题。然后需要我们对于给出的数据进行分析，分析销量和售价的关系，并给出一些条件帮助超市进行模拟定价使得超市的收益最大化。 拿到题目后我们第一晚对于题目进行了分析，理解了一下题目意思，并且大致对于每一道题目有了建模的方法和计算公式，但由于数据没有处理，很多时候信息隐藏在数据里，因此也只能大致地分析一下。但审题确实是很重要的一环，如果题目要求都没有理解清楚，那么后面做的都只是无用功。第二天我们开始对数据进行处理，一共有四张表，其中有一张表格是某超市从2020.7.1到2023.6.30的所有销售记录，一共有八十七万多条数据。此时，Excel表格的弊端就显现出来了，那就是如果要对多张表格进行“连接”，对比，筛选处理会很麻烦。比如我们需要的数据分布在两张表上，而为了移动到一张表格上，我们不仅仅是复制黏贴，最重要的是数据必须和名称对应，例如青菜的售价应该和青菜对应，而Excel表格只能按原始顺序进行复制黏贴，这就给整合数据带来了很多麻烦。其次，Excel表格的分组筛选能力、合并筛选能力也较为薄弱，或者说要实现这样的操作需要很繁琐的过程。此时就体现了数据库的优点了。如果使用数据库SQL server，只要我们把Excel表格中的数据导入数据库，那么可以用数据库中的select等命令完成各项我们所需要的操作，尤其是数据量极为庞大的时候。 我们在7.8日全天都在处理数据，尤其是表格导入SQL就需要二十分钟左右的时间。现在回想，我觉得我们数据预处理的效率太低。很多数据没有沟通好，导致整理好了之后才知道不需要这个，需要另一个。当然一方面是需要数据的同学也不知道需要什么样的数据。在7.8晚上更是发现有一张表最开始的数据连接就出了问题，导致后面根据这张基准表算的数据有几列是错误的，这也耗费了不少时间。另外，很多数据的计算公式也不相同，这也为后面建模的混乱埋下了伏笔。 7.9日我把建模需要的算法打成LaTeX公式，然后却不知道要干什么了，我本以为另外两个同学在算，但事实上她们或许是感觉尚且来得及，所以实际上她们并没有做什么事情，这直到7.9日晚上发现来不及了，当时我们只做了第一问，相当于是一共三天的时间，我们用了前两天只做了第一问，而题目一共有四问。第四问是文字叙述题，尚且不算难，但第二、第三问所需要的工作量无疑是巨大的。首先她们用时间序列预测得到数据就需要一段时间，然后我还需要根据她们预测出的数据、以及表格中筛选出的数据，代入MATLAB进行规划运算，而MATLAB进行规划运算虽然有设定好的函数，但是需要将数据以相应的格式输入。第二问的目标函数就很繁琐，我还需要将六个变量化成矩阵形式输入到MATLAB的程序框里，这只是某一天的数据，我要预测七天的数据，而且约束条件还是和前一天预测得到的数据相关的，也就是需要迭代。每做一天的数据就需要12次运算，而一共需要7天的预测数据，繁杂程度可想而知。而且由于她们拟合得到的函数不精确，随后得到的利润最大值却是负的，也就是超市还会亏三千多块钱，这很显然是不合理的，然而由于她们之前拟合数据就拟合了好几天，而且她们也不知道应该怎么拟合，只能拟合成线性的，从而效果极为不好，这些从我代入MATLAB计算的结果也能看出。说实话我预想到这个计算量后，在7.9晚上确实有些难绷，甚至想要放弃，但不仅是我，还有我的朋友、家人都告诉我要坚持下去，因此我晚上回宿舍好好休整了下，顺便也要等她们预测出的数据。而她们则通宵拟合数据，一宿没睡，也挺不容易的。 7.10早上我拿到她们的数据后在图书馆认认真真把数据输入MATLAB中，两三个小时后总算是把第二问的数据算出来了，至于负数的利润，我们不打算写在论文中。后来下午她们还需要我计算第三问，而第三问虽然只要预测一天的，但是预测的矩阵是33$\\times$33阶的，而且当我预测完得到结果后却得知，她们给我的数据表没有更新，应该用更新后的，但是她们却在我算出来后才更新好，也就是说之前做的又是无用功。我内心也深以为队友之间的沟通真的很必要。当时以及下午三点，为了得到最新的数据，我也只能硬着头皮重新手打1089个数据，打到最后眼都花了。不过不管怎么说，最后还是做出来数据了。 六点我和另一位同学修改论文，还发现论文中不少笔误，修改了一下摘要和排版，我还对每个问题画了流程图，对每个建模算法也配了一张流程图。七点多论文生成编码上传后，我长舒了一口气。我此时坐在图书馆中，脑中一片空白。这几天的确很累，但我也认为我收获了很多。首先我没有选择熬夜，这不代表我态度不端正，而是我知道我熬夜的效率不会高，而且我在7.9日晚上也干不了什么，因为数据还没预测完。因此我在保重健康的条件下尽力完成了此次比赛任务。其次技能方面，我又重拾起了大二上学期学习过的数据库，实战中发现如果没有数据库，数据处理要难上不止一个量级，可谓是功臣了。另外我对Excel表格的使用又有了新的了解，很多之前不太知道的功能现在也会用了。同时，我还学习画了流程图，也能画出比较美观、清晰的效果，比如https://www.processon.com/diagraming/64fbeabeb97c585a85fa1d44 https://www.processon.com/diagraming/64fd350e9aaeb84b4b3f51b4 https://www.processon.com/diagraming/64fbe3f127860e0a919850d3 https://www.processon.com/diagraming/64fd371cfdcfcd4c818d18b6 https://www.processon.com/diagraming/64fd38d02c1a257ae99761e8 我觉得这次建模比赛也算是让我体验一下当数据分析师是什么样的感受吧，这些东西没有什么理论难度，完全是熟练度的问题，多练练自然就会熟练了。而比赛由于只有三天的时间，而且最后做出来的结果很大程度上也和队友有关系，因此不能完全反应将来应用数学的工作风格。对于未来的发展，我也难免会有迷茫和焦虑，但好在这些都只是及其偶尔地出现一次，这得益于我的良好心态。我现在早已不会和大一大二时候一样还在关心所谓的“分数”“给分”云云，或许是变自信了吧，但我深知这坚定的自信的根本来源还是我平日里对自己的高要求和坚持不懈的努力。我每天也会进行放松，并且也有多种方式，但我能很自信地说出，我每天钻研在学习上的时间是足够长，也足够有效率的。当然，学无止境，我还需要把效率提的更高一些，对自己的要求更严格一些，学习方法更科学一些，心态看法更通透一些。如果问我每天在想些什么，那么除了数学题，剩余的大部分就是如何能够提升自己了。变得更好，是我永恒的追求。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"漫谈","slug":"life-107","date":"2023-09-06T13:11:51.000Z","updated":"2023-09-06T13:48:22.065Z","comments":true,"path":"2023/09/06/life-107/","link":"","permalink":"https://nju-kevin.github.io/2023/09/06/life-107/","excerpt":"","text":"今天白天在图书馆复习$RCA$第三章以及$Salamon$关于紧算子的部分内容，闲暇之余复习了下$PTE$第一章，另外在实变函数课间还看了$Folland$第八章的$Radon$测度，才发现所谓$Radon$测度其实就是$Riesz$表示出的那种测度，所以其实并没有什么高深的说法。事情往往就是这样，了解了自然不觉得多么高深，不了解那万事万物都很高深难懂了。 晚上运动的时候和同学聊了聊保研的事情，才知道五学期的学分绩是用来夏令营推免，而六学期的学分绩是学院用来排哪些人可以保研的，只有六学期的学分绩可以有竞赛加分等等，五学期的学分绩就是硬碰硬的课程分数。这么一想其实也挺合理，毕竟大部分人在夏令营成功以后大多都可以顺利获得推免，于是关键则在于夏令营能否通过，从这个角度思考，五学期的学分绩看上去更“重要”一些。有利害关系的是保研边缘的人，因为他们完全有可能在第六学期被原本不能保研的同学通过竞赛等加分超越，进而自身失去保研资格。 因此，这一学期的学分绩至关重要，在很大程度上决定了我未来的去向，因此各门计入保研学分绩的课程都不容小觑，应该踏踏实实，一丝不苟地完成，切忌浮躁和急功近利。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"本学期课程概述","slug":"life-106","date":"2023-09-05T12:46:10.000Z","updated":"2023-09-05T13:03:02.320Z","comments":true,"path":"2023/09/05/life-106/","link":"","permalink":"https://nju-kevin.github.io/2023/09/05/life-106/","excerpt":"","text":"今天上午在图书馆复习了$RCA$第二章，以及推演了$Salamon$第四章的部分定理，再次让我深刻地感受到定理真正自己推演一遍的功用，只看一遍是完全不能够体会到其妙处的，内心也不由地生发出赞叹。下午听了统计课以及偏微分方程，至此，本学期的所有课程都已经听了第一节课，也算是大概有个了解。 首先实变函数老师吕勇感觉人不错，而且也欢迎我们和他联系去问他问题等等，因此我打算建模结束之后去和他讨论讨论$Rudin$。课程的难度应该也不算大，但对我来说尽量把每次布置的作业习题超额完成，多去做点题目打磨自己对于实分析的思考，我认为是很必要的。而且我现在对于实分析的框架已经搭的很牢固了，但是还是需要细节的填补。拓扑学难度也不大，大部分内容我都早已运用自如，我认为只要认真做作业，尽可能超额完成点任务就行了，老师人感觉也还行。应用随机过程是一门纯需要靠自学的课程，听学长说考试需要背老师的上课讲义。目前讲义已经拿到，写的深度还是有的，因此我课后需要多花点时间看看$PTE$等内容，这我认为很重要。统计这门课的“事情”有点多，不仅需要概率论的理论知识（理论难度未知，但一定不会小），还需要学期末完成一份数据分析报告，感觉内容挺应用的，从这个角度思考，我认为也是对自己的一种考验，提前适应一下今后步入工作岗位要干的事情，个人感觉和数学建模很相似。偏微分方程的授课老师杨孝平网上搜搜好像还很厉害，上课讲的还行，就是说话让人听上去很累，年龄也不小了，看上去像是老一辈的搞数学研究的人。这门课的深度并不深，深度远不及$Evans$，更加偏物理、偏应用一点，就和上学期的概率论一样，讲的内容有浅有深，但深的地方远远没有高等概率论深，偏微分方程这门课就是给我这种感觉，后面应该也会讲一些深层次的东西，但和真正这块内容的深度还不能及。 上述几门数学课，加上毛概思政课（要写篇小论文或者进行课堂展示），这么一看这学期的任务还是很重的，需要干的事情也有很多，不过这就要求我把空余时间也利用好，如果能抓紧时间，可以说不仅课内的绰绰有余，还能有余力学学泛函之类的课外知识，并复习之前学的内容。如果能完成得好，这学期的收获无疑是巨量的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"青蛙与飞鸟","slug":"life-105","date":"2023-09-04T05:01:45.000Z","updated":"2023-09-04T05:20:55.110Z","comments":true,"path":"2023/09/04/life-105/","link":"","permalink":"https://nju-kevin.github.io/2023/09/04/life-105/","excerpt":"","text":"上午实变函数课程上吕勇老师简单介绍了下大学分析方面的课程关系，从数学分析到实变函数到泛函分析（另一条路从实变函数到调和分析），看到这个导图不禁思考自己的学习情况。虽说这几门课我都有所涉猎，但后面几门所包含的内容实在是过于广博，我目前也暂时还不算是学到了多少深刻的东西。课上所提到的《青蛙与飞鸟》，我认为打了一个很贴切的比方：数学家分两类，一类像是飞鸟，飞在高空俯瞰大地，他们做的都是统一的框架，都是很抽象的东西；另一类像是青蛙在地上，他们虽然视野没有那么广，但却能够细致入微，他们做一些很精细的东西，例如不等式放缩寻求最佳系数，将条件微调证明定理等。从这个例子其实就能反应实变函数之后的两条路：泛函分析和调和分析的风格区别。泛函分析更加抽象，更加广泛，像是飞鸟；而调和分析研究的很具体，都是关于$Fourier$敛散性的精细估计，像是青蛙。事实上，分析方向的前沿研究领域都是和这些课程密切相关的，要么就做的更精细，要么就完善“虚无缥缈”的框架。 听课过程中，即使是目前讲的很基础的部分，也都能让我产生很多联想，有许多是$Rudin$上的，也有$Salamon$泛函书上所涉及到的例子等等，这些思考在某种意义上却能够串联在一起，让我又有别的体会，新的思考。这也再次佐证了我的观点：上课认真听讲，不管自己是否提前学过，都能获益匪浅。而且事实往往是，学的越多，能联想到的就越多，所寻求到的联系也就越多，收获的乐趣也就越多。因此，可以这么说，上课听讲的下限是课堂内容，而上限则取决于每个人储备的知识以及联系思维能力，从这一角度思考，课堂也不失为一次检验自己所学的机会。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"2023暑期总结","slug":"life-104","date":"2023-09-02T13:52:15.000Z","updated":"2023-09-02T14:54:14.354Z","comments":true,"path":"2023/09/02/life-104/","link":"","permalink":"https://nju-kevin.github.io/2023/09/02/life-104/","excerpt":"","text":"这个暑期过得很快，在家的时间大概一个多月，明天就去学校了，也是时候好好回顾一下了。 七月份的上旬我参加了数学系的暑期学校，主要听了听基本的二阶椭圆PDE以及一些$Schauder$估计，这部分还挺绕的，目测感觉比$Sobolev$空间里的光滑函数的逼近要复杂的多，主要还是范数比较复杂。这部分或许只能等以后有时间再去看了。不过也是利用这段时间把$Evans$的PDE第二章（尤其是调和函数部分）好好学了学，其实第二章最重要的就是$Green$分部积分公式，自己推推还是很考验数学分析基本功的。值得注意的是$Evans$的书在介绍一些定义或者新的定理的时候都先介绍了motivation，也就是“动机”，我觉得这是很重要的一点，能够更好地帮助我们去理解这些方法和手段。 回来后在家学了八天就去南京社会实践了，这八天我继续看了第二章的内容以及$Salamon$泛函分析的第二章内容以及习题。对于泛函的思考详见这篇文章，这里就不多赘述了。月底到家之后准备了一下数学建模校内选拔赛，经此一役我算是弄明白了数学建模的过程，也看到了它“没那么有含金量”的一面，但不得不说，我认为数学建模或许更重要的是分析问题的能力。毕竟现在算法库和编程模板大家都有，不一样的是拿到同一个问题分析问题，进而选用模型去解决的过程。我认为无脑套模板和堆算法是不合理的，也不是竞赛考察的重点。最初我并没有注意到这一点，但后来在学习的过程中，我渐渐发现数学建模从某种意义上更接近做应用数学的人以后工作中干的事情，无非就是用数学去解决实际的问题，这过程中必然也是要熟练使用计算机的，并且很多时候也需要文字产出。因此，从这个角度来说，数学建模考察的形式还是合理的，只是说如果要强求它对于理论深度的考察，那确实无法做到，这也不是它的目的。 八月份主要看的还是PDE和泛函。PDE后面学了点$Sobolev$空间，也算是把上学期没认真学的东西补了补；泛函主要学了点弱拓扑和算子理论。只能说这一个月的学习属实是让我大开眼界，不过，还远远不够。 首先说说暑期“欠的债”：PDE部分$Sobolev$空间还没学完，学的部分的证明还没自行推导，第二章课后题还没做；泛函部分第三章、第四章的定理推导+课后习题；$PTE$还没往后看。这些是假期前原本打算做的事情，只是没有想到确实没时间看概率方面的东西，加上下学期的分析课还比较硬核，因此假期里还是以分析为主。 下学期的任务，无疑是艰巨的，但我认为可以有条不紊地做做好。首先是竞赛方面，数模在国赛结束后就不碰了，国赛那几天认真写写；CMC今年在双十一那天进行初赛，因此平时数分高代解几可以当做课外书看看，还是得保持知识体系结构，考前再适量地做做题目。学业方面有五门数学课程，其中实变函数+PDE+拓扑学是最重要的三门，课堂上认真记笔记，课后认真做题目，实变再参考一下$Folland$，如有需要再找找题目做做，如果教材上的题目质量和数量都说的过去，那就直接用教材。应用随机过程只需要记笔记即可，数理统计还是需要认真学学的，可以参考茆诗松的那本书。深度学习方面有这么几样事情：1.复习$RCA$，这本书的价值不需要我多说，常看常新；2.$Salamon$泛函，基础的泛函还是要能够通晓的，这对PDE的深入铺路；3.$Folland$实分析，这本书我不打算精读，而是当作补足$RCA$的一些细节，以及一些未涉及到的地方；4.$PTE$后半部分，这部分介绍了随机过程论，算是学习这方面必备的东西；5.$Evans$PDE，很显然这本书一时半会看不完，所以打算结合学校讲授内容以及自己感兴趣的部分跳着看。因此，下学期的深度学习简单来说就是这么几件事情：精读$Salamon$，$Evans$（部分章节），$PTE$，略读$Folland$，复习$Rudin$。 和上学期一样，深度学习与平常学业紧密联系，不是割裂开的，精读$Salamon$可以视作完全是我个人的兴趣（当然早足以“应付”大三下的泛函授课内容），$Evans$可与PDE课程结合，$PTE$可与应用随机过程结合（深度是远远高于课内的），而复习$Rudin$以及略读$Folland$则成为实变函数课程的“营养补充”。下学期的深度学习的进度如何现在无法预知，但同步加深应是最基本的要求，我也相信，如果能把基本要求不折不扣地完成，已是很了不起的事情了。至于深度学习的重要性，当然是以与课内相关的为主，与课内暂时不太相关的为辅，因此泛函暂时不赶进度，先把暑期“欠的债”有空补补，其余的与课内进度结合超前或同步加深。 在上述学习过程之余，我认为应该将复习数分高代解几养成一种习惯，也就是每天都去看看，不要求花多少时间，但至少保持手感，把淡忘的知识点重新拾起来，我认为这是很重要的事情，不应有所懈怠。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Notes of Functional Analysis","slug":"math-7","date":"2023-08-29T05:13:31.000Z","updated":"2023-08-29T05:28:26.702Z","comments":true,"path":"2023/08/29/math-7/","link":"","permalink":"https://nju-kevin.github.io/2023/08/29/math-7/","excerpt":"","text":"This article is intended to give a detailed picture of contents in Salamon’s Functional Analysis. I’ll focus on the connections of definitions and theorems, with some of my thoughts.","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"暑期社会实践 Day 1","slug":"life-103","date":"2023-07-21T10:10:58.000Z","updated":"2023-07-21T10:55:25.590Z","comments":true,"path":"2023/07/21/life-103/","link":"","permalink":"https://nju-kevin.github.io/2023/07/21/life-103/","excerpt":"","text":"第一天社会实践地点是溧水区朱家边村，起了一个大早赶地铁，坐到南京南站后到客运站坐大巴车到溧水客运站，然后坐公交G2线到朱家边村。地理位置还是很偏的，路上三个多小时，不得不说还是很累的。G2公交车很有特色，看上去像是旅游专列，还有一些纪念品展览。到了村子上之后感觉路上人不多，我们直接去党群服务中心，然后根据负责人说书屋就在服务中心里面，空间不大，大概有几排书，其中有许多政治书作为排面，后面大概是一些杂书，我看到的有儿童心理学云云。负责书屋的管理员还是很热情的，也很配合同学们做调研。我和几位同学则到村子里走访村民，询问他们知不知道村子里的书屋，借以调查书屋在村子里的普及度。不过不知由于什么原因，路上没有什么村民，难得遇到一位，对书屋的事情也不太清楚，只知道有个“大队部”，也就是党群服务中心。经过一轮走访，我们并没有收获什么有用的信息，主要还得靠访谈的同学了。 下午我们兵分两路，三位女生去溧水荷花社区的书屋，那里是五星级书屋，据说比朱家边弄得更好；而我们三位男生乘高铁返回南京，到栖霞区图书馆调研。不过当我们到尧化门地铁站准备和图书馆联系的时候，才得知图书馆并不欢迎我们，拒绝了我们的调查请求。虽然之前有联系过，但那里给出的回复是等他们的回复，后来他们一直都没有回复，或许也是不愿意我们去调查。从而我们三人打车回学校，到宿舍已是三点多，又饿又困，点了份麦当劳才稍微好过来一点。到宿舍后休整了一下，晚上准备进行复盘。 今天我们把各种交通方式尝试了个遍，公交、地铁、高铁、大巴车、出租车，一番周转下来也是精疲力尽，所幸没有背相机，否则要累坏了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑假学习系列（七）","slug":"life-102","date":"2023-07-10T13:38:49.000Z","updated":"2023-07-10T10:28:28.775Z","comments":true,"path":"2023/07/10/life-102/","link":"","permalink":"https://nju-kevin.github.io/2023/07/10/life-102/","excerpt":"","text":"这几天发邮件咨询了瑞士苏黎世理工大学的数学系教授Salamon Dietmar A.关于他的泛函分析书上的练习题。按照提示其实这道题是不难做出来的，但是我好奇的一点是里面的有一个条件，也就是$Y$的可分性是不是必需的，因为在证明过程中并没有用到$Y$的可分性，网站上的外国友人也这么认为，于是我便向书的作者确认一下。第一次给国外的教授发邮件，格式还是在网上搜的，包括一些用语等，不过好在$Salamon$教授并不像有些国内教授一样高高在上，面对我的提问，他还是很和蔼的，第一封邮件他貌似并没有明白我的意思，可能以为我是在问他这道题目怎么做，后来我继续回复他问可分性条件是不是并不需要，他认为我是对的，也就是说这里的可分性并不是必要的，毕竟整道题目的证明过程也没有涉及到这一点。 目前我已在网站上回复之前帮助我的外国友人，感谢他们帮助我真正搞明白了这个问题，或许在接下来的几年内我都不会忘了这个题目了。虽说题目比较小，但这个题目如果没有前两问的铺垫，难度还是在的，需要用到第一纲集的性质以及$Pettis$引理，单纯是这两个引理的证明也不容易。这次倒是让我真正体会到了学习过程中多与他人交流的魅力。如果一直都只是我埋头苦学，说不定一直都心里没底，弄不明白，更何况数学书大部分都没有习题答案，也不能靠解答来参考。这样的学习方式我认为反而比书后附上答案的方式好，因为自己独立思考的过程是提高水平的唯一途径，如果这个方面打折扣，那除了重来一遍没有别的捷径可以走，遇到不太清楚的多与别人交流，交流的过程中自己也在加深印象，一举两得。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑期学习系列（六）","slug":"life-101","date":"2023-07-08T12:56:02.000Z","updated":"2023-07-08T13:13:44.742Z","comments":true,"path":"2023/07/08/life-101/","link":"","permalink":"https://nju-kevin.github.io/2023/07/08/life-101/","excerpt":"","text":"上次的那道泛函分析题还有后续。我在网站上问外国友人之后，发现这道题的证明按照书上给的提示做的话，貌似并不需要用到题目中给的$Y$的可分性，也就是说我不知道这个可分性条件用在哪里，这令我十分疑惑。本着刨根问到底，问问题不丢人的原则，我继续问那个回答我问题的人，如果用这个提示怎么做那道题。令我欣慰的是，那位外国友人很认真地回答了我的问题，他不仅真的去找了那本书的对应的那道题，还根据作者的提示猜测了作者的做法，当然他的做法并不需要用到可分性，也就是说作者当时可能是想要用另一种方法证明，而那个方法需要用到可分性，从而在题干中把可分性加了进去，但或许这个条件并不是必要的。那位外国友人提示我可以发邮件问问作者，我认为是个好主意，等有空我咨询一下本书作者$Salamon$看看这道题的可分性条件是不是必要的。 其实很多时候想想，题目想不出来的确很难受，但能有许多朋友，许多同行，甚至是素不相识的人，在我需要的时候帮助我，我的内心感到很感动。大家都在数学这条路上走，很多时候倒并不是攻克多么伟大的猜想才能获得成就感和快乐，仅仅是想到世界上这么多的数学同行们与我携手同行，这本身就是很幸福、很快乐的事情，我想这恐怕是更朴素的想法，但能够在这俗世中找到一条朴素、单纯的路，又是多少世人可遇而不可求的事情呢？","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑期学习系列（五）","slug":"life-100","date":"2023-07-06T13:26:44.000Z","updated":"2023-07-06T13:53:36.554Z","comments":true,"path":"2023/07/06/life-100/","link":"","permalink":"https://nju-kevin.github.io/2023/07/06/life-100/","excerpt":"","text":"今天把泛函分析第一章的练习题做完了，这几天每天做个一两道题目，每道题都有点难度，但都不至于什么都写不出来，很多难题给了提示，按照步骤来一步步证，不过其实题目本身作为结论也是很有用的，比如$Baire$纲定理和$DC$公理可以互推，以及最后一道关于$Borel$可测的线性算子，三个小问都很有用，由前两小问关于具有$Baire$性质的集合的介绍以及$nonmeagre$的$Borel$集的性质研究，最后可以用于证明从$Banach$空间到一个可分的赋范向量空间的$Borel$可测线性算子一定是连续的。这个第三小问使用的证明方法是考虑集合 B=\\{x\\in X:\\|f(x)\\|_Y","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑期学习系列（四）","slug":"life-99","date":"2023-07-05T13:18:08.000Z","updated":"2023-07-05T13:49:15.779Z","comments":true,"path":"2023/07/05/life-99/","link":"","permalink":"https://nju-kevin.github.io/2023/07/05/life-99/","excerpt":"","text":"今天主要学习了偏微分方程的热方程的部分内容，热方程的基本解、非齐次方程的解，看书后面的内容好像热方程的解也有类似调和函数的性质，其实到这里为止解一些比较好解的$PDE$的思路已经有了，也就是首先找基本解，基本解往往是我们给解加条件，例如让解是径向对称的，从而转化为常微分方程。有了基本解之后得到非齐次方程的解主要就是靠卷积，只不过非齐次热方程的解需要进行两次积分，推导不难，只需要进行分部积分就行了，如果之前$Laplace$方程基本功学的扎实的话是没有问题的。不过热方程的解与$Laplace$方程的解形式上的区别也很好理解，因为热方程的解多了一个关于时间的变量，方程中也多了一个关于时间的偏导数，又由于解不是调和的，因此不能像$Laplace$方程那样能够利用平均值原理得到一个解的表示进而引入$Green$函数。但好处是非齐次热方程的解不需要那么麻烦，直接积两次分就行了。 后来继续做了点泛函分析题目，$Salamon$的课后习题还是很有意思的，并且部分题目给的$Hint$一开始还不知道什么意思，思考一会之后便能明白为什么要这么去想，并且题目都和前面正文部分相关，有一道$Banach$代数的题目让我想起了高等代数里学过的$Jacobson$引理，那里是矩阵形式，这里是$Banach$代数里的形式，本质上是一模一样的。还有一道举例度量空间中一列嵌套且直径趋于零的紧集的交集可能是空集，这在欧式空间中是不成立的，因为有闭区间套定理，但到度量空间中就不成立了，原因其实就在于无限维$Banach$空间中有界闭集不一定紧了！因此我们如果在无限维$Hilbert$空间的单位球面上找一列数列，是有可能不收敛的，从而根据这个数列找出的闭集套的交集就会是空集。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑期学习系列（三）","slug":"life-98","date":"2023-07-04T12:21:14.000Z","updated":"2023-07-04T12:44:38.606Z","comments":true,"path":"2023/07/04/life-98/","link":"","permalink":"https://nju-kevin.github.io/2023/07/04/life-98/","excerpt":"","text":"今天上午主要做了点题目， 做了一节$Munkres$的拓扑学课后习题，主要是拓扑基的一些性质以及拓扑的精细比较，点集拓扑的风格就是这样，往往题目读上去很能懂是什么意思，并且也不少直观性，但语言叙述起来则是实打实的定义、逻辑，来不得半点马虎。做拓扑题的方法其实也比较固定，也就是利用定义和一些重要的性质和定理，定义我认为还是最关键的，毕竟所谓的性质和定理也都是由定义推导出来的，在拓扑的证明题里，定义则更加重要，对定义理解的好坏直接影响到能不能做出来题目。另外比较重要的便是基础的集合论。集合论这种东西没有捷径可走，最主要的还是得多练，不过经常用用便能很习惯了，这在实变函数最开始的地方也有许多集中的体现。 吃午饭前做了几道泛函分析题目，其中证明算子的像有紧致的闭包这一点我卡了很久，主要是证明紧致的问题。函数空间的紧致，我一开始只想到了函数空间作为赋泛空间还是度量空间，度量空间中列紧与紧等价，从而证明列紧；但即使是反证法也很难推矛盾。后来我才想起来可以用$Arzela-Ascoli$定理，只要证明一致有界和等度连续就可以了，并且针对的就是一般的函数空间，从而问题变得好证了许多。 下午继续听偏微分方程，昨天学习的$Evans$基本上涵盖了今天上课所讲的内容，涉及到基本解，格林函数，最主要的还是上半欧式空间和单位球上的格林函数，毕竟这两类区域的拓扑性质很好，从而我们能够把格林函数算出来。晚上我继续把$Evans$上讲$Laplace$方程的部分看完，感觉$Evans$上讲的更细，且很多定理的证明都更清晰有条理。其实这部分的内容颠来复去就那么些内容，把分部积分公式，格林恒等式，调和函数，基本解，格林函数的性质弄明白了就很简单了。值得一提的是在书上讲$Laplace$方程的最后，提到了一个势能方面的看法，也就是如果我们定义一个关于方程解的势能算子，那么边值问题的解就是使得势能达到最小的函数，使用的方法也很奇妙，后来一想其实就是苗栋在证重积分变量代换公式的时候所使用的变分原理，也就是乘上一个紧支集的光滑函数算积分，如今在$PDE$中重逢的确十分亲切。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑期学习系列（二）","slug":"life-97","date":"2023-07-03T13:09:34.000Z","updated":"2023-07-03T13:42:17.383Z","comments":true,"path":"2023/07/03/life-97/","link":"","permalink":"https://nju-kevin.github.io/2023/07/03/life-97/","excerpt":"","text":"今天开始上数学系的暑期学校，授课老师是北京大学的周斌教授，讲二阶椭圆偏微分方程。今天第一节课讲的比较基础，基本上就是$Evans$上的内容，主要介绍了$Laplace$方程以及调和函数的部分性质。下午在图书馆自主学习的时候，我继续看$Evans$第二章$Laplace$方程的内容，主要介绍了调和函数以及基本解、$Green$函数的性质，比较令人欣赏的是这本书把基本解、$Green$函数的来由也讲了出来，也就是$Derivation$，然后再接上定理、性质，一切都一目了然，也很清楚明了。目前我看到的部分都还是$general$的$Green$函数，但$Green$函数一般很难显示写出来，除非所在的区域的拓扑性质很好，也正由于此才有了所谓的上半平面或者单位球上的$Green$函数。到现在为止$Evans$主要讲了调和函数的最大值原理、光滑性、平均值原理、内部导数的估计、解析性质、$Poisson$方程解的表示等，核心方法其实没有什么，就是$Green$恒等式、分部积分的公式，以及标准磨光子的应用，对这几个公式要很灵活地使用。 后来继续做了几道泛函分析的第一章练习题，感觉$Salamon$的课后习题还是很有趣的，并且讲的思路和条理我比较喜欢，第一章为泛函分析的基础知识，虽然很杂但不乱，每个部分还都能讲到许多挺有用的定理和结论，并且如果细细读一读它的证明其实能够学到很多，尤其是书中对$DC$公理和$CC$公理的强调，让我意识到很多时候一些很显然觉得不用说就可以过去的地方原来是用的公理，而不是默认或者显然就过去的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑假学习阶段（一）总结","slug":"life-96","date":"2023-07-01T12:54:57.000Z","updated":"2023-07-01T13:10:33.740Z","comments":true,"path":"2023/07/01/life-96/","link":"","permalink":"https://nju-kevin.github.io/2023/07/01/life-96/","excerpt":"","text":"这篇文章将对暑期学习阶段一进行总结，这一阶段参加了匡院的暑期学校，我将对本阶段进行评价，并进行下阶段的展望。 本次暑期学校我选择了微积分和线性代数，我的打算是利用这个机会复习一下数学分析和高等代数这两门课，也算是为$CMC$做准备。不过在我去听了一节课之后发现微积分、线性代数和数分高代还是有很大区别的，前者注重计算，后者注重理论本质和证明。我认为二者的关系应该是计算需要知道，但不能仅仅知道怎么算，更要知道理论本质。不过现在倒是有很多同学擅长本末倒置，即算都还算不清楚的时候开始追求理论深度，这无异于不懂实变就在追求$RCA$等的教材，没有底子，何谈深度？不过话说回来，这次暑期课程讲的内容实在是过于基础，虽然说五天时间加上有一天考试，实际上只有四天的讲授时间，确实没办法面面俱到，但线性代数竟然连$Jordan$标准形都没有涉及，这部分可是线性代数最精华最美的部分啊！我认为有时间去讲矩阵的计算、或者是向量的计算、变换，还不如多讲一些标准形理论，这或许更能够讲出一些东西。 接下来将会有十天左右参加数学系的暑期学校，我报名的是关于二阶椭圆偏微分方程的内容，由于下学期$PDE$也会涉及，因此便报名听一下。加上这个暑假还在准备数学建模比赛，只能说尽力就好，毕竟我还需要花时间学更有意义的内容。目前的打算是每天实变刷题刷周民强习题2-3道，$Salamon$泛函分析与$Evans$偏微分方程每天坚持往前学一点即可，剩余时间看看$RCA$以及学一学数理统计，数学建模等。数学建模我打算利用课上内容认真听听，由于有一个暑假的时间，我认为关键不在于每天学了多少，而是能不能每天坚持往前学。正如实变习题一共144道，每天做两三道便能在一个暑假做完，因此坚持是假期最重要的品质，而不是每天的量，更何况很多时候每天的安排计划也不同，也需要进行灵活调整。目前我不管是学习新知识还是复习，都坚持有一遍独立思考的过程，或者是独立推导的过程，以避免学完一遍全部忘光的无用功，毕竟时间是有限的，让我们看看这个暑假都能学到些什么。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"暑假学习系列（一）","slug":"life-95","date":"2023-06-27T13:16:38.000Z","updated":"2023-06-27T13:55:45.503Z","comments":true,"path":"2023/06/27/life-95/","link":"","permalink":"https://nju-kevin.github.io/2023/06/27/life-95/","excerpt":"","text":"今天主要利用空余时间复习了泛函分析$Salamon$第一章的部分内容，包括度量空间中紧集的刻画、赋范向量空间中的$Arzela-Ascoli$定理，有限维赋泛线性空间的性质以及商空间。其中度量空间中紧集的刻画比较带有点集拓扑的风味，主要就是列紧、紧、准紧、全有界的刻画，当然这里的刻画都是用空间中的点列进行刻画的，据秦理真所说，在一般的拓扑向量空间中，没有点列，那么用的就是网的概念，这是今后学完$Salamon$干的事情了（参考$Grothendieck$的拓扑向量空间一书）。而赋范向量空间中的$Arzela-Ascoli$定理其实就是函数集的准紧和点态准紧、等度连续的关系，用的方法便是$3\\epsilon$方法以及对角线方法（需要用到$DC$公理）。 有限维赋泛线性空间在赋泛线性空间中有着比较重要的地位，虽然研究有限维的“没前途”，因为大部分空间都是无穷维的。但有限维中紧集等价于有界闭集，这在无穷维线性空间中不成立。同时，单位球面、单位闭球的紧性能够判断该赋泛线性空间是有限维的还是无穷维的，这是一个等价条件（用$Riesz$引理证明）。商空间中的范数的定义其实就很有趣，由定义也能得到商空间中的$Cauchy$列的性质，同时有了商空间则自然诱导一个商投射，从而商空间为$Banach$空间当且仅当原来的大空间是$Banach$空间。 目前复习的内容都还是泛函分析的基础内容，这几天加上还在上课，于是每天看不了多少内容，但学习数学从来不是看速度的，关键看真正搞懂了没有，这才是我关心的问题。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"华为南研参观","slug":"life-94","date":"2023-06-26T14:12:44.000Z","updated":"2023-06-27T01:26:35.894Z","comments":true,"path":"2023/06/26/life-94/","link":"","permalink":"https://nju-kevin.github.io/2023/06/26/life-94/","excerpt":"","text":"今天上午我随南京大学卓越人才培育计划的部分学生赴华为南京研究所参观，我认为主要有两方面值得一说。首先是南研的园区环境，绿化做的很好，里面有一片湖，还有两三只黑天鹅，有种公园的氛围。另外，园区的道路都是由科学家姓名进行命名的，例如牛顿路，香农路，高斯路，路牌下还会配上员工对这个名字的阐释或者理解，其中我印象较深的便是高斯路下的“二分之一个证明等于零”，我看到这个解释的时候，想到的便是在数学中，如果一个证明没有完整证出来，即使证出了“一半”，也相当于什么都没证出。我认为产业园区的路牌标语其实就反应了华为企业的特色，不管是道路名还是贴在路灯杆两侧的标语，读来都能让人充满克服重重困难的自信和决心。 到了会议室里，华为海思项目工程部的两位南大校友向我们介绍了一些端侧AI的内容，我不太听得懂，不过倒是在介绍结束之后问了一个问题，那就是数学在这些很偏计算机应用的项目中能够如何发挥作用，学长说，对于低层的算法逻辑，是需要数学背景的人员的，因此华为招基础学科、尤其是数学方向的人才，可能主要目的就是在于算法部分，算法高明了，整个效率才会提高，虽然整个的效率绝不仅仅是依赖算法这么简单。 这次交流算是让我见识了一下华为南研的产业园区，也让我对一些项目所做的事情有了一定了了解，日后或许也可以通过天才少年计划加盟华为体验一下研发工作，至少在参观者的视角，在园区工作应该还是很舒适的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"大二下期末周总结及下阶段规划","slug":"life-93","date":"2023-06-17T14:16:39.000Z","updated":"2023-06-27T00:43:29.098Z","comments":true,"path":"2023/06/17/life-93/","link":"","permalink":"https://nju-kevin.github.io/2023/06/17/life-93/","excerpt":"","text":"分数一览： 从微积分到上同调 85 分析学专题选讲 93 复变函数 98 离散数学 83 概率论基础 99 本学期期末周顺利结束，几门课考得都还算不错，至少自己尽力了，也就没有遗憾了。接下来任务还是很重的，尤其是大三上学期的课程压力还是很重的，因此宜在暑期早做准备。下面将对暑期的任务进行详细的安排。在规划之前，各门学科的重要程度是要分清楚的： 课程重点：实变函数，偏微分方程，拓扑 认真学但不算绩点：随机过程，数理统计 深度拓展：泛函分析 时间规划如下： 六月末至七月初：实变函数刷题+收尾$RCA$+学习$Salamon$，$Evans$ 七月：学习数学建模+做$Munkres$拓扑题+学习$PTE$+学习$Salamon$，$Evans$ 八月：学习$Evans$，$Salamon$+学习$PTE$+做$Munkres$拓扑题 其中顺序在前的有更高的优先级，且做题的任务如果没有做完可以继续顺延，一开始学习的时候还是需要慢慢磨的，因此不着急做题的速度，力求每道题做题的质量能够得到提升，以后遇到类似的题目能够熟悉做题的方法。另外，由于泛函分析是$PDE$的重要工具，因此在学$PDE$的同时也得打牢泛函分析的基础，虽然我在大二下学了一些泛函分析，但由于做题不多，因此没有能够熟练的掌握和运用，仅仅停留在知道理论，这是远远不够的，从而对于泛函的深度学习将会一直贯彻下去，并且这些理论的学习方法将使用最新的学习方法，期末考试的检验证明，目前的学习方法还是很科学，很高效的，因此要继续坚持下去，行动起来！","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Final Test of Complex Analysis","slug":"lesson-6","date":"2023-06-16T14:15:47.000Z","updated":"2023-06-18T09:39:53.583Z","comments":true,"path":"2023/06/16/lesson-6/","link":"","permalink":"https://nju-kevin.github.io/2023/06/16/lesson-6/","excerpt":"","text":"今天下午进行了复变函数的期末考试，考前也是做了不少准备工作，包括做廖良文的课本章末习题等，也遇上了不少不太会做的题目，在尝试弄懂后，我也都独立自行推演，或者是讲给同学听，把许多方法的内在原因和内在逻辑搞明白了。同时，为了准备此次期末考试，我在图书馆借了1997年的钟玉泉教授编写的《复变函数解题指导》一书，虽然书本很破旧，书页也泛黄了，但是里面的内容仍然十分吸引人，每一模块都很系统地介绍了相应的解题方法和思路，同时书中更配备了大量的例题和习题以供读者融会贯通。事实证明，功夫并没有白花，这本书选择的也十分好，考试中考到了至少两道可以用钟玉泉书中结论进行证明的题目，并且都是教材课后题所没有涉及到的。 总体而言试卷比概率论的期末试卷难一些，但客观来说考的内容还是很浅显的，本学期的复变函数考题并没有涉及到复分析的本质，更不要说精髓了。张高飞的课堂内容倒是讲到了不少比较深刻，很有意思的内容，但考试不考察，由于是廖良文出卷，他也按照他自己的教材内容出题，可以说更注重一些技巧，但论深度，确实没有多深，然而这些解题技巧又却是不得不掌握的，这就是我之前提到过的一对矛盾。不过题多做总是无害的，更何况不能指望所有考试都能考到比较深刻的地方，这也是我对习题来者不拒的原因。 本学期的复分析我主要参考的$Stein$和$RCA$的复分析部分，可以说包含了非常多的内容和知识，这些内容不仅提高了我对复分析的掌握程度，更加深了我对许多事情的理解。例如之前对于复平面$\\mathbb{C}$和$\\mathbb{R}^2$的异同便做过很多思考，因此不论是课堂所学，还是课外所学，复分析方面我都可以算是收获满满，最后的成绩也对得起自己一学期的努力付出。虽然课程结束了，但我对复分析的学习远远没有结束，或许在以后的某一天的午后，我还会把这一本本名著翻开，琢磨上面的定理，体会数学的美，没有压力地畅学数学，或许才是最为幸福的事情。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"离散期末考试","slug":"life-92","date":"2023-06-14T14:13:58.000Z","updated":"2023-06-18T09:03:01.955Z","comments":true,"path":"2023/06/14/life-92/","link":"","permalink":"https://nju-kevin.github.io/2023/06/14/life-92/","excerpt":"","text":"今天早八离散期末考试，考察内容为ZFC公理集合论、格与布尔代数。这两部分的内容是在考试周前一周学习的，考试之前的复习阶段便是看往年试题以及背点命题，基本上把往年的题目都能搞明白，对于这门课的考试来说就足够了。好在我在第一遍学的时候，也就是考试周前一周的时候，学的就比较明白，基本上第一遍学的时候就把很多题目给做了，证明也自己进行推导了，因此考试的时候题目都会做，毕竟都见过类似的题，思路和方法也都知道，因此完成得很轻松。 值得一说的是最后一道大题，考的是$Hurtington$公理的证明，一共分四步，每一步的证明虽然不复杂，但比较绕，毕竟是格的运算，如果不小心利用错了条件那么就会使得整个证明出问题。这道题是讲义上的定理，当时我独立推的时候不太能推得出来，看了答案后才知道推证的方法。考试现场推也推了好久，不过最后全部推出来了。最后的期末卷面分我预估在90到100之间，如果有差错那一定是助教改卷的错误。这门课的助教一言难尽，改卷水平有待提高，作业批改也不认真，还要扣平时分，所幸这门课没有任何重要性，并且以后再也不会上同一个老师的课程了，因此总算是翻过了这一座山了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Final Test of Probability","slug":"lesson-5","date":"2023-06-13T13:29:43.000Z","updated":"2023-06-16T13:51:13.875Z","comments":true,"path":"2023/06/13/lesson-5/","link":"","permalink":"https://nju-kevin.github.io/2023/06/13/lesson-5/","excerpt":"","text":"今天早八考概率论，之前复习的时候我也算是把能找到的资料都看了一遍，能复习的知识点也都过了一遍，并且都训练自己独立进行推导，不管是基础知识点还是进阶一些的证明题，亦或是$Durret$上稍具思考性的题目，从计算到证明，可以算是复习得很全面了。考题也十分简单，倒是卡在了一道计算期望的题目上，后来我果断先跳过，然后在计算后面一道题目的时候给了我思路，从而顺利拿下。证明题都是课上讲过的题目，没有任何难度，利用定义，以及强大数定律的一些常用结论，积分换序等技巧即可轻松证明。 总之，本学期概率论课程算是结束了，总结一下感觉还是学到不少东西，宋老师也讲得很好，在课间的交流中也让我学到了很多东西。虽然考试很简单，但我心里很清楚，需要提升的地方还是很多的，这个暑假准备尽量多看一些$Durret$，把高等概率论和随机过程论进行一个初步的掌握。初等概率论的内容比较基础，从另一个方面来说也比较无聊，我不应该满足于此，尤其是以后有志于从事统计或金融方向的话，对概率论和随机过程的要求很高，因此应该多学一些更本质，更深层次，也更有趣的内容，提高在概率方向的能力和水平。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"大二下考试周系列四","slug":"life-91","date":"2023-06-11T13:51:40.000Z","updated":"2023-06-11T14:18:58.461Z","comments":true,"path":"2023/06/11/life-91/","link":"","permalink":"https://nju-kevin.github.io/2023/06/11/life-91/","excerpt":"","text":"今天主要任务是复习概率论和离散，概率论主要复习第五章的内容，我把所有的定理都自己独立推导了一遍，大概也明白了一般来说遇到这些问题应该从什么角度入手，从什么思路作答，同时又回顾了一遍$Durret$，对许多地方的理解更加通透了。 昨天晚上也有个同学问我关于自主拓展的问题，感觉同学们在深度拓展方面分很多个档次。最不济的便是连课内都不花时间，更不要说拓展了；好一点的只满足于课内的，不往前看自己感兴趣的；再好一点的想要看别的，但不知道对什么感兴趣，也不知道应该看什么；如果知道自己感兴趣的东西并且也自己想要去看了，那可以算是入门了，而入门的又分好几个档次，最次的是看书不进脑，看过就忘；稍好一点的抄书，但效果仍不明显；再好一点的记笔记的同时自己再推导，让知识进脑子。不过不管怎么样，都需要不断地重复，最后才能达到一定的理解程度。上述的情况，只要入了门那就可以通过重复最后达到相同的水平，只不过越后面的需要重复的次数越少，毕竟是提高了单次的效率。回顾我，我一开始也是纯抄书，抄完后记得多少真不好说。目前我的方法是抄书的同时自己合上书再推一遍，作业题不到最后坚决不看答案，力求做出来，半个小时以上搞不出来再想办法找答案或者问别人。昨天那个同学表示不知道应该看什么，到大二下才接触拓扑，这显然是还没有入门。而那位同学在系里面算是拔尖计划的优秀学生之一了，虽然不一定具有代表性，但也能反映出，大部分同学都没有入门。而丘赛拿奖的最基本条件是某一个方向的各个内容都要入门，因此常年丘赛不出成绩也是正常合理的了。 我认为目前的深度学习方法是有史以来对我而言最优的方法，不注重速度，既然是深度学习，并不是考试，那么就有时间慢慢磨，解题能力都是磨出来的，而不是看答案看出来的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"大二下考试周系列三","slug":"life-90","date":"2023-06-10T13:22:31.000Z","updated":"2023-06-10T13:44:43.196Z","comments":true,"path":"2023/06/10/life-90/","link":"","permalink":"https://nju-kevin.github.io/2023/06/10/life-90/","excerpt":"","text":"今天一天的主要任务是复习概率论。白天把第三章第四章PPT上的内容自己推了一遍，主要把一些计算的方法，以及各种分布的分布、密度函数、期望、方差、特征函数等等记一下，这些内容纯靠记，也没什么技术含量，但没记住的话考场上遇到了吃亏，所以也只能记一下了。另外还有一些求变换的密度函数等等的运算方法和技巧，和数学分析里重积分变量代换公式差不多，甚至还是简易版本，此时复习的时候也是体会到了之前范学长说过的“本科概率论都很无聊，就是算算”，事实也的确如此。 晚上复习第五章的内容，第五章算是初等概率论中最有趣的部分了，不管是研究收敛性也好，还是大数定律的各种版本，亦或是中心极限定理的各种条件，其证明都是很经典的分析方法，这部分晚上过了一遍经典的结论，看了一遍证明方法，明天在$Durret$上进行进一步强化，顺便记一些其他的定理、结论，考场上遇到类似的题目即使不能套用现成的结论，思路其实是和定理的证明类似的，因此在考前做好充分的准备，考场上兵来将挡，水来土掩，不在话下。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"大二下考试周系列二","slug":"life-89","date":"2023-06-07T13:45:19.000Z","updated":"2023-06-07T14:02:57.123Z","comments":true,"path":"2023/06/07/life-89/","link":"","permalink":"https://nju-kevin.github.io/2023/06/07/life-89/","excerpt":"","text":"今天一天虽然没课，但也安排的满满当当，主要就是学习离散数学期中考试以后的部分。由于期中以后忙于准备竞赛，因此离散数学的进度一直处于停滞的状态。下周三就要考试了，因此时间还是很紧迫的，今天利用空余的时间补了大概一半的内容，为了提高效率避免重复性的工作，在学习的同时我边练习着独立推导一些定理、命题，独立完成讲义上的课后习题，以加深印象和解题能力，而避免单纯的抄写讲义，这样过后还得继续看一遍理解，反而是耽误了时间。 离散这门课不算作保研学分绩，期中考试成绩也很平常，由于平时并没有花时间和精力去学，因此我能够做的就是考试前认真复习，认真做题，尽力考出一个对于我自己而言最高的水平。而概率论和复变函数则显得很重要，好在出题人没有变，风格与往年类似，我相信经过细致的复习，期末考试是能够拿下的。接下来的时间安排上，我打算周末之前学完离散，从而减轻另外两门的复习压力，然后周末加上下周一优先复习概率论，复习完了继续复习复变函数，只要把接下来的时间利用好，那么考试时便能不急不忙，泰然自若。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"大二下考试周系列一","slug":"life-88","date":"2023-06-05T09:05:54.000Z","updated":"2023-06-05T09:24:59.801Z","comments":true,"path":"2023/06/05/life-88/","link":"","permalink":"https://nju-kevin.github.io/2023/06/05/life-88/","excerpt":"","text":"今天白天的时间准备晚上的选修课《从微积分到上同调》考试。考试是半开卷形式，可以带两张A4纸，因此在整理复习笔记的同时也在记录A4纸上的内容，写了满满当当四面，基本上记录了这门课程的主要知识点以及比较重要的结论。学期末翻翻这门课程的笔记本，六七十页纸，发现真的学了不少东西，即使这些东西都还只是微分流形的皮毛，但如果好好回顾一下的话，这短短六七十页纸包含了大量有用的方法、经典的定理以及美妙的结论，以后或许我对这部分的内容还会淡忘，但我相信通过不断的温习，我都能够对其有更加深入的理解和体会。纵然许多题目还确实不会做，我也不打算未来做几何与拓扑方向，但不失为闲暇之余的阅读材料。 严格意义上来说，从今天开始，对我而言，本学期的考试周正式开始。接下来的时间很紧，而我心里也清楚还有许多复习工作没有进行。概率论我打算复习这样几个方面：教材内容、习题；PPT；$Durret$例题；做往年卷。复变函数：钟玉泉解题指导，廖良文课后题，$Rudin$，往年卷。离散数学：课堂笔记讲义。今天晚上考完后我打算优先复习概率论和离散数学，因为这两门在最开始考，同时这周看完钟玉泉和廖良文的课后题，下周考前也只有一天的时间，因此大部分工作都应该这周做完。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"香港见闻（五）","slug":"life-87","date":"2023-06-04T12:47:26.000Z","updated":"2023-06-04T13:54:11.144Z","comments":true,"path":"2023/06/04/life-87/","link":"","permalink":"https://nju-kevin.github.io/2023/06/04/life-87/","excerpt":"","text":"今天启程返回南京。在机场转悠的时候，我在想我这次交流收获到了什么。香港作为一个城市自然是很现代化的，虽然或许与内地的一线大城市还有差距，并且支付宝微信只在一些正规的大店里能用，大部分地方都是用巴拿通刷卡消费，这其实没有内地方便，包括打车、外卖，系统都发展的不成熟，还不能在网上下单、订单，也导致内地的游客会感到不习惯。在学校外观上面，由于香港的地形，使得学校很多都是建在山上，而学校内没有哈喽单车，因此校内通勤、校外通勤都不很方便。香港的学校并没有明显的大门，也没有围墙，这一点应该是和国外类似的，因此学生更加自由，包括学校的办学理念，很多都是以学生为中心而布置的，可以说更加接近欧美的办学理念和风格，而且注重学生的全面发展，而不是只看文化课成绩。同时，学校的管理模式都是书院化的，书院管理学生的生活，而学习则由各个学科学院负责，这样也使得同学们不仅能够接触到自己系的同学，还能与不同专业的同学一起生活，也能够拓宽学生的视野。学生的课外活动也很丰富，也可以自己组织活动，这使得同学们有足够强的组织能力与策划能力。这些固然是和香港的考核与评定相关的，内地的一整个考核评定系统都是以成绩为重，学生们看重成绩、没有什么课外活动也是正常现象。 学校的实验室也很多，都是一个个课题组，每一个系的教授人数不多，但都是小而精的类型，通过参观，我也收获了很多物理、化学、生物方面的知识，以及大家做科研的思路与心态。同时，这段时间也算是一个调整与过渡，以一个全新的姿态迎接即将到来的期末周。经过这次游学，我也坚定了我的学习方法与观念，继续坚持下去，相信会有令人满意的结果。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"香港见闻（四）","slug":"life-86","date":"2023-06-03T12:47:22.000Z","updated":"2023-06-04T13:54:11.141Z","comments":true,"path":"2023/06/03/life-86/","link":"","permalink":"https://nju-kevin.github.io/2023/06/03/life-86/","excerpt":"","text":"今天访问香港科技大学。香港科技大学的位置有些偏远，需要坐车上山，不过相比于之前的两所大学，港科大校园也不算小，而且里面的设施都比较新，有设计感，更有传统意义上大学的感觉。同时，校园风光秀丽，不仅能在山上看到香港高处的景色，还能下到海平面近距离观海。上午在报告厅听了港科大数学系、化学系、物理系、海洋科学系等的介绍与宣传，中午有各个方向的老师与相应方向的同学们共进午餐，聊一聊学术、生活与理想。我跟随的是物理系的老师，其实大家都一样，做科研很辛苦，但平时也要学会放松；学习过程中的困难与阻力无处不在，但也要学会不断攻克难题，找到方法与思路。 下午参观了几个实验室，我这次参观的生化方向的，看了几个冷冻显微镜，仪器都很庞大复杂，别说用这些仪器做科研了，即使是正确地使用这些仪器我都觉得是有一定困难的。听了该实验室工作人员的介绍后，我对原理以及使用的方法也有了进一步的了解，其实很多实验、科研的方向和思路都是类似的，大家都是由简入繁，通过不同角度切入，往往总有一个是能够走通的。后来去生物实验室，感觉里面的设计还是值得学习学习的，那就是不同的组用不同的一条实验台，每条实验台末尾还有单独的讨论室，以供学生进行学术研讨、办公等活动，我认为这个设计还是很合理的，而不像很多实验室里面各种东西都有，很杂乱。这个生物实验室是我这次参观以来最干净，有条理，整齐的实验室，因此确实是值得学习的。相对而言化学实验室则比较“脏乱差”，空气里还有一股酸酸的味道，可能也是年代比较久远了。傍晚的时候去港科大的海边看海，看着一浪一浪的海浪，我和几个同学也和王院长聊了聊学习与科研，也再一次验证了我的学习与提升的观念是科学合理的，说白了就是如何将所学知识内化为自己的认识的过程，这过程中很明显是需要多进行独立验算、自己的思考、总结的，只看不写，只写不记，只记不思，都是不够的，只有每一环节都做做好，自己多独立推演推演，时间长了才能是自己的，也就是多重复，多加深印象，如是而已。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"香港见闻（三）","slug":"life-85","date":"2023-06-02T09:15:45.000Z","updated":"2023-06-02T13:26:07.588Z","comments":true,"path":"2023/06/02/life-85/","link":"","permalink":"https://nju-kevin.github.io/2023/06/02/life-85/","excerpt":"","text":"按计划，今天访问香港浸会大学。相比于港中大，浸会大学校园比较小，因为在市中心。上午也是有老师介绍了一下物理方面的几个课题组，主要是凝聚态、复杂系统、超材料、相分离、中医与机器学习等方向的。中午则是有研究生带着我们去吃饭。其中有两个学数学的研究生，一个是在做神经网络和动力系统，一个是做量化的学长，在美国读的金融相关专业。因此正好在午饭的时候我们进行了友好的交流，并且也表达了我想以后走应用数学，例如统计、金融等方向的意愿。学长说学金融对计算机编程要求还是蛮高的，也给我推荐了学金融必读的两本书，应该是数学金融相关读物，我记得图书馆好像是有的；另外做金融方向可能还需要实习，或者有类似的经历。并且学长说可以提前了解一些金融方面的基础知识，有了比较好的数学基础，学金融不是一件难事。后来我还和另一位学长聊了聊关于实动力系统和复动力系统的内容，也算是稍微拓宽一下眼界吧，毕竟论纯学术，学长的话也只能参考参考，但对于金融方向的内容，由于我不太了解，因此只要有机会，我就会去问问看看。 下午仍是照例参观实验室，但明显感到这些课题组研究的东西没有什么使用价值，或者说得现实一点，都是为了发文章而弄的，从而显得比较外强中干。后来结束了之后回到酒店和我们学校数学系的一个学长聊了不少，他是他们这一届唯一一个保研北大基础数学分析方向的同学，正好有他的微信，之前上分析讨论班的时候也交流过，因此也问了问保研北大的事情。其实说白了还是绩点要尽可能高（但是不完全按照绩点，例如上一届数学绩点排名第一的同学也没能够进北大，那位学长排名第五反而被录取了），其次就是校方组织的考试成绩要好，这个基本上和水平是直接挂钩的。而我目前需要做的，一个是多去了解了解统计、金融方向，另一个就是好好提升自己的水平，提高自己的解题能力、学习能力，力争有一个更好看的简历（也就是竞赛方面），最后能够去哪里读研或者读博一是要尽力看自己造化，也要看缘分。目前来说，做好我的本职工作即可。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"香港见闻（二）","slug":"life-84","date":"2023-06-01T09:15:42.000Z","updated":"2023-06-02T13:26:07.587Z","comments":true,"path":"2023/06/01/life-84/","link":"","permalink":"https://nju-kevin.github.io/2023/06/01/life-84/","excerpt":"","text":"今天团队一行访问香港中文大学。香港中文大学是建在一整座山上的，因此也是香港面积最大的大学。我发现香港的大学和内地的大学不太一样，内地的大学至少外围看上去都很明显，有围栏，房屋大致都是一个风格的，并且比较集中化，模块化，区域化，例如宿舍全部建在一起，教学楼等也建在一起。刚来到港中大的时候，我甚至没有认出来这已经是大学里面了，知道我坐车做到一半的时候才发现大学生都是通过校园巴士进行同行。由于建在山上，楼与楼之间高度差异大，距离也很远，而香港又偏偏没有共享单车，导致通勤变得十分不方便，这也是我认为的一个缺点。 上午主要是听了一下化学系的介绍，以及伍宜孙书院的参观。伍宜孙书院在港中大应该是和匡院差不多的类型，里面有各个方向不同的学生，但我认为他们书院做的更好，尤其是学生的生活方面。不仅有学院自己的集体宿舍（二人间），还有书院食堂，书院休息室、棋牌室、自习室，书院健身房，书院创意实验室等，学生有想法和创意、想要组织活动，那么只要提供一个可行的方案，书院就会批准并提供资金，相当于是追求学生的全面发展，这一点上与国际是接轨的；而我们院的同学在生活上很少有交集，这固然是与内地大学的机制有关系的。看着伍宜孙书院的设施，我也暗自想到，以后也要好好努力打拼，争取能够有金钱实力提高生活标准和生活水平。 下午我们参观了几个实验组的实验室，分别是关于菌群运动、金刚石与量子传感、有机太阳能电池、纳米颗粒、玻色爱因斯坦凝聚的实验。虽然我不完全听得懂，但我也进行了充分思考，而不是仅仅一晃而过。这其中与数学稍微相关一点的应该是菌群实验，大概是研究菌群的运动，由于许多因素是具有随机性的，从而让我想到了概率论和随机过程在这些学科之中的应用。这次在参观的过程中，我有一个想法，那就是如何快速地了解这个实验组在做什么，以及如何批判性地看这个实验组做的事情，当然不是挑刺，而是想要锻炼抓住重点，抓住要害的能力，从而能够提出一些问题，提出一些有价值的问题。例如参观金刚石与量子传感实验室的时候，我就询问工作人员：为什么是金刚石？是因为它的部分特性，还是它的内部结构，还是什么其他原因。虽然对于过于专业的内容我很难做到深入理解，但我认为我有必要培养审视、理解一个课题组的重点的能力，明天还要继续参观，我希望我能够做的更好。 晚上到尖沙咀看看有没有药买。一开始我们到了沙田，发现药店关门了，询问了当地居民，居民们也很热情，虽然满口的粤语不太听得懂，但仍然为我们提供指引。后来到尖沙咀的江边逛了逛，发现市中心其实并没有很热闹，而且很多店在七八点的时候就关门了，江景倒是还不错，不过和内地的大城市也差不多。在市中心总有一种不安全的感觉，也有可能是市中心并不是很亮，灯光效果做的不是很好，而且香港或许还存在着不少灰色地带，因此也不敢过多涉足。倒是在市中心的日韩代购店找到了要买的药，但是一盒168港币属实是贵了，从而作罢。 相比于之前去的广州，感觉香港虽然繁华，但却没有那么地繁荣，境外还是和内地很不一样的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"香港见闻（一）","slug":"life-83","date":"2023-05-31T09:15:39.000Z","updated":"2023-06-02T13:26:07.588Z","comments":true,"path":"2023/05/31/life-83/","link":"","permalink":"https://nju-kevin.github.io/2023/05/31/life-83/","excerpt":"","text":"今天下午，一行人从匡院出发前往香港。本次交流主要是访问三所大学：香港中文大学，香港浸会大学，香港科技大学。到香港后，发现这里有许多特点，一是全是繁体字和粤语，普通话甚至是第三语言；二是这里的楼房很密集，由于香港还有很多山，为了最大化利用土地，许多房屋建在的山上；三是这里的车都是靠左行驶，行人过马路很不方便，道路的设计和便利程度方面没有大陆的好；四是天气非常之热，室内空调很足，可谓是冰火两重天。 从机场出来就走了很长时间，加上等车子，坐车子，到酒店登记，一套流程结束以后已经很迟了。我的包里这次常放一本复变函数学习指导书，是钟玉泉老师编写的，我认为这本学习辅导书编写的很好，把解题的常用技巧和常用手段都整理得很到位，同时利用例题也能够让我认识到这些知识点怎么用。更重要的是，这本小册子并不重，适合随身携带，不像国外的基本名著，既是名著，也是砖头，不方便携带，希望能够通过这几天的翻阅加深复变的解题能力。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"旅途间隙的休整","slug":"life-82","date":"2023-05-30T13:30:41.000Z","updated":"2023-05-30T13:43:35.916Z","comments":true,"path":"2023/05/30/life-82/","link":"","permalink":"https://nju-kevin.github.io/2023/05/30/life-82/","excerpt":"","text":"今天白天上一天课，明天又要出发去香港了。按照计划，今天晚上完成了英语通识课的所有作业，明天走之前做一下概率论作业，然后在香港四五天按原计划复习微分流形和离散数学。由于离期末周很近，现在每一分每一秒都要抓紧，并且要合理规划复习的时间安排。到了香港看看有没有适合自习的地方，我知道我要做什么，如果没有那就在房间里将就一下，因为时间真的很紧迫。 这几天还是挺困的，尤其是中午午睡的时候，应该还是前几天欠了点觉，从另一方面也反映出我的确不太适合熬夜。接下来去香港应该也会很累，不过除了学习的时间如果没事情干就睡睡觉，总比浪费在电子产品上强，现在愈发觉得睡觉、吃饭、学习、运动才是人生最有价值、最有成效的事情，其他的事情或许由于某些客观原因必须得做，但都不是最有用的事情，这四件事情才是最纯粹、最健康的事，至于刷手机看视频之流，除了消遣、分散注意力以外，并没有任何实质性的作用，反观老一辈数学家们没有电子产品的干扰，一心做自己有兴趣的事情，当时可能是由于条件艰苦，如今再看来反倒成了可望而不可及的境遇，实是令人感慨。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"竞赛期总结以及下阶段规划","slug":"contest-20","date":"2023-05-29T07:20:21.000Z","updated":"2023-05-29T12:50:39.842Z","comments":true,"path":"2023/05/29/contest-20/","link":"","permalink":"https://nju-kevin.github.io/2023/05/29/contest-20/","excerpt":"","text":"本学期竞赛期正式结束。纵然结果没有过于理想，但我认为我的表现值得肯定。首先是四月十五日的阿赛，见识了一下预赛的风格以及难度，为此我也在考前复习了数分高代；其次是五月六日的丘赛，虽然没有混到奖，但为此我也认真准备了$RCA$的内容，加深了对实分析和复分析的理解；最后是五月二十七日的$CMC$决赛，以全国33名的成绩混了个国一，也算是有些考运吧，准备这次考试的时候算是把高等代数之前没学明白的地方真正学明白了，遇到许多标准形问题至少不会再含糊不清了，这是我明显感受到的变化。总之，为了竞赛期的比赛，我不仅强化了数分高代解几常微分的内容，也巩固了实分析、复分析等深入的分析知识。 接下来的任务也很重，时间也很紧，因此虽然之前对于接下来的规划也略有提及，但不够具体，因此下面将对规划进行细化。需要完成的任务有：微分流形课程复习，英语通识课期末作业，复变廖良文课后习题，概率论复习，离散数学学习+做题，学术与科研能力培养课程成果汇报，英语六级复习与准备。这些任务是现阶段最紧迫的，因此全部为优先级最高的任务，至于深度学习，可以在期末考试结束之后进行。 目前的时间规划为：在5.31日出发前往香港之前，完成英语通识课的期末作业。香港行程路途中，听英语六级听力，并利用闲暇时间在手机上背单词。复习任务：微分流形课程笔记本以及开卷参考资料整理，离散数学内容学习与笔记。如果两项任务完成了，剩余时间用于思考廖良文课后习题。香港回来之后全力复习复变函数和概率论，认真准备期末考试。 期末考试结束后，全力准备英语六级；英语六级结束后重启深度学习内容，七月前主要内容为实变函数，$RCA$复分析剩余部分和秦理真泛函分析讲义。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$决赛纪实三：颁奖","slug":"contest-19","date":"2023-05-28T07:18:31.000Z","updated":"2023-05-30T13:34:16.718Z","comments":true,"path":"2023/05/28/contest-19/","link":"","permalink":"https://nju-kevin.github.io/2023/05/28/contest-19/","excerpt":"","text":"昨天玩得挺累的，本以为能睡个懒觉，没想到由于要参加颁奖典礼，七点五十五在大厅集合，七点也得起了。起来的时候还是很困，毕竟晚上没睡几个小时。吃早饭的时候遇到tch同学，他小声和我说我要上去领奖，说实话还是在我意料之外的。因为早上看到群里说48分能国一，38.5是国二，因此国一分数线便在这之间了，而我的分数则比较尴尬，也不知道能不能进入国一线。后来据小道消息，国一线为44分，我正好压线一分，也可谓是运气拉满了。 领完奖之后参赛队员一起拍了一张大合照，然后江苏赛区、数学系也拍了合照，以作为留念。中午退完房后一行人到体育西路的禄运茶居吃广州早茶。排了一个多小时的队，终于在下午两点吃上了。我发现广州当地的美食都很精致，不管是肠粉、虾仁包，还是芋头排骨，叉烧包等，味道都很不错。吃完早茶后便径直前往机场等候，在机场买了点当地特产。由于飞机晚点，八点半才从白云机场起飞，到禄口已经晚上十点二十，到家已经十二点。至此，广州行程圆满结束，虽然很累，但也很有收获，不仅是收获了一张奖状，更是收获了一次经历，以及一次对于竞赛阶段的思考与感悟。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$决赛纪实二：竞赛","slug":"contest-18","date":"2023-05-27T03:53:07.000Z","updated":"2023-05-30T13:34:16.717Z","comments":true,"path":"2023/05/27/contest-18/","link":"","permalink":"https://nju-kevin.github.io/2023/05/27/contest-18/","excerpt":"","text":"今天上午由于要考试，因此也是起得比较早，感觉昨天赶路的疲惫有所缓解，但仍是有些昏昏沉沉的。早上在酒店吃了早饭之后就随着一行人到考场考试了，广州工业大学的教室还是挺宽敞凉快的，桌椅都是木头的，不过教学楼显得有些老旧，看上去没有什么现代感，一些基本设施环境也很一般。 九点开考，十二点结束，考试的题目是数分高代解几和常微分。填空题比较简单，但是第二题算一个曲线积分算了半个小时没算出来，于是直接放弃。大题第一题二次曲线的二次型矩阵表示，以及对称矩阵的正交相似对角化，一开始没想到用矩阵的方法，想要硬算展开，后来发现计算量过于巨大之后想到可以用分块矩阵的方法简化，然后化为对称矩阵的正交相似对角化。第二道大题和第四道大题是高等代数，都是考的是矩阵的相似，奈何幂等矩阵和循环矩阵的性质不够熟悉，所以即使写了一些也没有得到多少分。第三道大题倒有点分析的味道，考的是由级数定义的函数 g(x)=\\sum_{n=1}^{\\infty}r^n(x-q_n)^{\\frac{1}{3}}的性质，前几问稍微想想还是能做的。第五道分析题求证的是一个积分极限存在的等价条件，由于和答案做的明显不同，因此一分没拿，但我觉得我做的也没问题。最小丑的是第六道大题常微分方程，求出解只有1分，剩下9分都是验证没有别的解，我认为这不是正常人能够想出的答案，不多评价了。 广工大的食堂还是不错的，食堂的奶茶店也很火爆，尝了尝味道发现确实不错。下午由于太热于是没有出去看看，在酒店吹吹空调，顺便等成绩。虽说成绩理应下午五点出，但一直等到五点四十都没有任何消息，于是我们直接坐地铁到天河区吃大鸽饭。店里环境很好，店面很大，菜都是与鸽子相关的，味道很好，菜品精致。吃饭的时候成绩出来的，一行人都考了三四十分，然后按惯例进行申诉，只能说批的比较严，并且确实会存在一些错误，但申诉最终有没有用也不得而知了，毕竟人数过多，很难做到没有疏漏。 吃完饭打车去珠江边看夜景，对岸是天河区的高楼林立，南岸是广州地标式建筑广州塔，风光秀丽，人也很多，场面很热闹，有外滩的风味。晚上回来的时候地铁也十分拥挤，回到酒店业已十一点多，一天的旅途自然是累的，因此便尽快洗洗睡了。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$决赛纪实一：报道","slug":"contest-17","date":"2023-05-26T11:21:41.000Z","updated":"2023-05-26T12:35:34.446Z","comments":true,"path":"2023/05/26/contest-17/","link":"","permalink":"https://nju-kevin.github.io/2023/05/26/contest-17/","excerpt":"","text":"今天是决赛第一天，白天大部分时间都花在了赶路上，一天下来也比较疲惫，晚上稍微再看会书，最后梳理一遍内容，就好好休息一下睡觉了，也没啥好准备的，功夫在平时。 说一说今天的过程吧。或许是我很久没有坐飞机的原因，今天坐飞机感觉还是挺好的。九点多打了车去机场，还得走高速，因为是早高峰，车上同学也和司机做了点交谈，司机推荐我们去吃广州早茶，估计是特产，而且还是广州的特产，别的地方或许吃不到这个味道。坐车走高速还是很快的，一个小时不到就到了，然后便是打票，行李托运，过安检，然后等待登机。等的时间比较长，也比较无聊，便和同学们聊了聊，互相认识了一下。这次坐的航班是深圳航空，或许是因为飞机是小飞机，感觉座位挺挤的，和我印象里飞机座椅的宽度不太符合，三个人并排的座位连个放手的地方都没有，吃东西的时候尤其是这样。航空餐还算不错，至少对于我这样要求不太高的人来说，虽然没有素菜，但作为简餐，可以算得上“丰盛”了。不过也有我不咋坐飞机的缘故，据我旁边经常坐飞机的同学说，每次餐点都是一模一样的，吃得太多次了就不觉得好吃了。 飞机上两个小时还是挺快的，下了飞机后乘坐机场大巴出站，然后再打车到酒店，路上走高速又是将近两个小时的时间，虽然路上说说话也不觉得无聊，但是到了酒店的时候，不由得觉得屁股疼和腿酸。路上的司机也很热情，和我们聊了很多东西，得知我们是数学系的之后，也问了我们很多数学相关的问题，也给我们推荐了不少广州的特色和旅游景点。和同学们的交流也很有趣，既有老师的轶事，也有一些对于一些老问题的不同的看法，包括以后的打算、就业等等。自认为在与同学们的交流中，能够收获不少学习之外的事情，很多时候自己了解的部分不一定是全貌，可见博采众长的重要性。 到了酒店以后领资料，准考证，办理入住手续之后，回房间简单看了下，窗户外能够看到珠江，景色还是不错的，晚上在酒店一楼吃的自助餐，虽然种类不算多，但对于已经饥肠辘辘的我来说，自然是够了，不知道酒店里的算不算粤菜，吃上去感觉和江南的菜差不多。本以为到了广州会被粤语包围，暂时倒还没什么感觉，可能是周围的人大多说普通话，如果在城区的话可能会有很多说粤语的罢。 第一次以竞赛为任务出差“旅游”，还是有些小激动，至于明天上午的考试，尽力就行，没什么大不了。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$准备系列（六）","slug":"contest-16","date":"2023-05-25T13:14:15.000Z","updated":"2023-05-25T13:29:17.962Z","comments":true,"path":"2023/05/25/contest-16/","link":"","permalink":"https://nju-kevin.github.io/2023/05/25/contest-16/","excerpt":"","text":"今天除了上课、理东西以外，晚上对还没来得及复习的部分再看了一遍，强化了一下一些知识点的记忆，明天早上出发前翻翻梅加强的数分书，然后考前看一下笔记和辅导书上的例题就可以了。现在心态总算是调整好了，也不抱有对于结果的期望，我认为我能去参加决赛就是对我水平和能力的肯定了。 这段时间让我想起来之前孙永忠说过的话，很多时候我们就喜欢那种空对空的理论框架，例如$RCA$就算一种，后来想起来那些基本的东西还是需要回过头来补的，等把具体的内容搞明白其实就够了。我目前来说也算是进入一个从空对空的理论返回去再补充一些例子的过程。$RCA$让我明白了实分析中最基本定理、内容的宏伟框架和整体思路，但作为学生，具体的例子，比如定理的应用，应试题目的解题技巧，现在成为了我返回去再走一遍的内容。丘赛其实也告诉了我往往不会考很空的框架性的内容，如今思考一下今年的题目其实都是很初等的内容，或者说很具体的内容，我便是吃亏在只知道大框架而没有对解题技巧做研究。 这么想来今年丘赛失利也是一件好事。做数学光有观点，光有格局可不行，这就类似于扫天下和扫屋子的道理，一屋不扫何以扫天下，往往我们所不齿的“解题技巧”，纵然对于数学的观念，理解的深度的提高没有什么好处，但都是需要一步步走过来的过程，会解题才能有后面的更深入的理解，毕竟人都是得通过具体的例子来加深理解的。因此，接下来我将理论与解题并重，在学习深入理论，提高观点的同时，也注重解题方面，这也是这几天复习$CMC$所得的感触。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"学会与自己妥协","slug":"life-81","date":"2023-05-22T13:36:41.000Z","updated":"2023-05-22T13:59:21.798Z","comments":true,"path":"2023/05/22/life-81/","link":"","permalink":"https://nju-kevin.github.io/2023/05/22/life-81/","excerpt":"","text":"今天晚上上微分流形课，讲了稍微深入一丢丢的微分流形（这门课本身就是基础课，学的更是整个几何理论的皮毛），我便发现确实跟不上节奏，也不太明白讲的是什么内容了。加上丘赛也没有什么名堂，让我不禁思考一个问题，并进一步引发了我对一串问题的思考：我所笃定的数学科研方向，真的适合我吗？ 这几天，或者说这段时间，我都有着某种无形的压力，即使我也会通过各种方式去调整，但我一直都把这学期的竞赛看得尤为地重要，并且也在时不时地思考今后的去向，尤其是到底能不能去top2读研。但当我一直以来对自己的规划出现动摇的时候，我第一次有这样的思考，如果连最基本的微分流形入门都显得如此吃力，我是否适合今后做基础数学研究？虽然我不打算走几何方向，但分析方向等的科研显然对于数学来说不如代数几何等来的吃香，很有可能最后也是想系里的许多老师一样，做做微分方程，动力系统，数学物理等。我不是说这样不好，但不符合我对我自己的定位。如此看来，或许应用数学更适合我。而我又不太擅长计算机，因此与数学相关的也就概率统计，或者是金融方向了。 进而我又在想，我之前是不是过于执着于竞赛获奖，进入清华北大读书呢？这不是想要放弃争取，我只是觉得当一个人的目标过于强烈，但又暂时难以触碰的时候，很多时候容易陷入自己的漩涡里，反而忽略了本该被重视的事情。例如我准备竞赛的时候，数学的美、数学的兴趣却没有往日那么浓厚地展现了，我往往过于在意比赛、竞赛、考试，在这个过程中我往日所钟爱的数学的魅力却消失了。 而当我想清楚这个问题之后，整个人都释怀了，为什么要给自己这么大的压力，非要去拿令自己满意的奖，非要去自己所执着的学校读书呢？人算不如天算，谋事在人，成事在天，我能做的只是奋力去争取，尽我的力量去好好学习，好好准备，至于最后有没有成功，往往真的不是我能决定的了。能去北京自然是最好，如果不行就去上海，按我目前的发展，应该是没有压力的。因此我打算从现在开始，与自己妥协，与自己和解，不要给自己这种压力，仍要一如既往地努力，最后的结果，我也不再过于执着了，一切自有定数。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"$CMC$准备系列（五）","slug":"contest-15","date":"2023-05-21T11:44:44.000Z","updated":"2023-05-21T12:52:19.524Z","comments":true,"path":"2023/05/21/contest-15/","link":"","permalink":"https://nju-kevin.github.io/2023/05/21/contest-15/","excerpt":"","text":"今天白天主要复习数学分析和解析几何，并利用空余时间做了点通识课英语作业。接下来还要进行的复习任务大概就是复习往年填空题解析以及看《大学生数学竞赛指导全书》，基础知识内容还要时常温习，然后就是调整好心态认真考试。 另外，下周也是时候开始复习期末考试了，目前对我来说需要进行的是看廖良文的书本内容以及习题，由于$RCA$已经学习过一遍，因此书本内容大体难度不大，但有可能会有一些细节部分，以及复变期末考试所钟爱的一些无聊的计算，计算方法和一些基础的证明还是要多看看，多掌握的，毕竟这涉及应试。目前打算利用下一周以及下下周除去复习$CMC$和做通识课作业的时间对复变、上同调、离散数学进行复习，以期在六月之前复习完内容与大体的习题。期末考试其实也没几天了，尤其是考虑到本次期末考试在六月中旬的前半部分，因此考试周基本上没有时间复习，从而应该从长计议，早做准备。深度学习计划作为调节，可以在各种复习、作业、练习的间隙完成。这一阶段的深度学习不要求、也不规定学习新知识的量，侧重于复习已学知识，毕竟这学期也算是学了不少内容的，也需要不少时间进行消化。接下来这段时间有更重要的事情要做，不过虽然事情多且杂，我相信经过我的合理安排，都能做到有条不紊，收获满意的结果，不留遗憾。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$准备系列（四）","slug":"contest-14","date":"2023-05-20T13:23:20.000Z","updated":"2023-05-20T13:44:52.236Z","comments":true,"path":"2023/05/20/contest-14/","link":"","permalink":"https://nju-kevin.github.io/2023/05/20/contest-14/","excerpt":"","text":"今天一天在图书馆认真把高等代数完整复习了一遍，对于矩阵的秩，线性变换的核，像，全空间的不变子空间分解，矩阵可对角化条件，空间第一、第二分解定理，最小多项式，特征子空间，行列式因子，不变因子，初等因子，矩阵的有理标准形，$Jordan$标准形，矩阵的相似，合同，正交相似，矩阵在正交变换下的标准形（对正规方阵都有相应的标准形），二次型理论，双线性函数，$Euclid$空间等内容进行重新的梳理，并思考各个部分之间的联系，学会求标准形的方法（这往往是考试的重点），之前不太明白的地方现在看来并没有那么难了，可能也有我自己水平提高的原因。看高等代数的时候总能看到泛函分析的影子，虽然二者研究的内容大部分都是不同的，但是不得不说，学了泛函分析之后，对于线性空间的理解又加深了，此之所谓通过更深入理论和知识的学习也能反过来加深之前学过知识的理解和认识，我认为这是极好的。 如今，很多别的事情都不太在意，而只在意与自己相关的，学习也好，生活也好，关键是自己过得开心，自己能够获得提升，我认为这就够了，至于别的事情，往往没有确定的说法，看到就当看到，听到就当听到，也没必要过多深究，不仅探索不出个结果来，反而白白浪费了自己的时间。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$准备系列（三）","slug":"contest-13","date":"2023-05-19T12:47:18.000Z","updated":"2023-05-19T13:01:04.108Z","comments":true,"path":"2023/05/19/contest-13/","link":"","permalink":"https://nju-kevin.github.io/2023/05/19/contest-13/","excerpt":"","text":"今天上午做概率论作业，发现学过一遍$PTE$相应部分之后，降维打击还是挺明显的，但即使是做一些比较简单的题目，在做题的过程中却也能够得到许多新的认识，这个过程其实和学习实分析的过程大同小异：虽然我已经看了$RCA$，但需要注意的是学校的实分析课还是得一丝不苟地认真听，因为$RCA$相当于给了一个异常强大的工具，建立了许多抽象的框架，而这中间的具体的过程和细节，也是需要通过对所谓的“简单”部分的练习得到加深和强化的。 之后的空余时间则在翻看高等代数书本，这一次看南大的高等代数教材，我突然觉得写的很好。第一遍学的时候只在意做难题，反而对基本的概念不加以重视，导致第一遍学的时候就没学懂。当时连概念都不清晰的时候就在追求做李炯生上的难题，如今看来是可笑的。不过这曾经走过的弯路，也是对我学习过程的一种反应，往往我们都会追求高大上和实用性，希望能在最短的时间内会做很多题目，而且最好是很多难题目，这样凸显着自己水平很高。可任何事物的发展规律都不是如此，尤其对于数学学习来说，基础概念的理解显得尤为重要。因此这一遍看南大的高代教材的时候，觉得莫名亲切，一方面是之前学过，这本书也翻了不少遍，只是可能没学到内涵和本质；另一方面觉得这些看似基础而浅显的概念背后却有着不浅显的联系。这次复习我也不敢说能够学到高等代数的本质，因为这次只是以做题为导向的，但希望以后经过不断的翻看，我能够渐渐领略到书本背后的事情，有更深入的体会。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"$CMC$准备系列（二）","slug":"contest-12","date":"2023-05-18T13:34:17.000Z","updated":"2023-05-18T13:57:23.655Z","comments":true,"path":"2023/05/18/contest-12/","link":"","permalink":"https://nju-kevin.github.io/2023/05/18/contest-12/","excerpt":"","text":"今天白天一直在上课，上午看了看新买的泛函分析书，感觉讲的挺系统的，把上面的习题认真做做应该会有不小的收获，但即使是做题可能也得留到暑假了，毕竟目前进入了繁忙的期末周，还有不少东西需要复习准备。下午补英语通识课作业，突然感觉那个通识课还不错，每次作业都是读一篇国外期刊上的文章，软件里还有老师帮忙讲解生词和语法搭配，虽然任务挺多，补起来也挺累，但就把它当做复习六级的一个方式吧，确实跟着软件学了不少新单词以及各种单词的用法。 晚上在图书馆看$CMC$往年题，算是把第一届开始到第十三届的题目都看了一遍，对考题以及考点有了大致的判断，我也把每一届的考点都整理了下来，明天开始对照着考点对解析几何和高等代数以及数学分析中的部分专题内容进行复习，并针对性地做一些课后习题或者是往年卷上的典型题目，毕竟只是看是没有用的，真正有用的还是自己做，做了一遍才能真正知道整道题的脉络。 这几天校庆，晚上操场上一直在唱歌，关键唱的效果实在是令人难以评价，更有甚者唱功如狼嚎，实在是差强人意。学校里最近经常有各类活动，由于学校内没有高大建筑，因此一组团的音乐会甚至是羊山公园的音乐会在教室、宿舍、图书馆、食堂都能听得很清楚，但好在图书馆隔音还算过得去，权且当个背景音乐听听吧。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"学习概况总结","slug":"life-80","date":"2023-05-17T13:25:07.000Z","updated":"2023-05-17T13:52:55.614Z","comments":true,"path":"2023/05/17/life-80/","link":"","permalink":"https://nju-kevin.github.io/2023/05/17/life-80/","excerpt":"","text":"今天收到短信，飞机票已经买好了，时间过得真得很快。之前还有种决赛离我还很远的感受，如今一想也就一个多礼拜了。 今天一天都泡在图书馆，算是学了不少东西。白天基本上在学概率论，把概率论中心极限定理之前的铺垫全都学了，我发现概率论中，尤其是中心极限定理部分，更关心的是依分布收敛，也就是弱收敛，与实变函数中关心的依测度收敛，依范数收敛，几乎处处收敛不同，弱收敛显然比这些收敛更弱，而正好弱收敛是实变函数中没有涉及的，从而概率论对这方面展开了叙述，涉及弱收敛的判定，等价刻画，连续性定理，$Helly$选择定理，分布与特征函数的唯一确定性，矩唯一决定分布的条件等，尤其是收敛性部分，以及各个收敛性的刻画，关系转换，还是得花点时间认真研读的。后来把$RCA$复分析部分的解析延拓内容学了一下，因为期末考试要考，加上距离考试也不远了，因此今后我将把重点放在学习廖良文的教材上，尽早准备。 晚上继续复习往年卷考点，也总结了不少常用的方法，如今以高视角重新回来审视，这些内容不难但仍然十分有趣，或许这也是数分高代解几这些基础课的特点，我们可能需要学很多遍，但每一遍都能有收获，每一遍都不感到无聊，每一遍都能汲取营养。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"浅谈院系开课乱象","slug":"life-79","date":"2023-05-16T13:18:39.000Z","updated":"2023-05-16T14:08:52.630Z","comments":true,"path":"2023/05/16/life-79/","link":"","permalink":"https://nju-kevin.github.io/2023/05/16/life-79/","excerpt":"","text":"今天可谓是跌宕起伏的一天。下午班群里有同学突然发现本学期还有一门叫做《学术与科研能力培养》的课程，但到目前为止还没有通知上课形式，于是有同学问辅导员后，院系一个负责科研部分的老师临时建了一个群，并临时颁布了课程要求。其中要求学生要参加大创或者进组参与科研或者参加指定的竞赛，这门课才算通过。如果没有相应的经历，有挂科的风险。首先这门课是准出核心课，意味着要算在保研学分绩里；其次，学期快要结束了老师才想起来有这么一门课，这发生在某C9高校的荣誉学院未免过于讽刺了；再次，离结课仅剩一个月的时间，此时要求同学做大创项目或者进组显然不合适，因为现在早就过了这个时间点，并且这类事情都需要提前准备，仅仅靠一两个月是不现实的，而且其中认定的竞赛竟然没有$CMC$，反倒是水分十足的建模竞赛，退而求其次，现在建模比赛早就结束了，甚至结果都已揭晓，此时再对这方面做要求，显然更加不合理。或许有人会解释说，这门课可能是开给那些有过相关经历的同学的，那么在选课阶段，没有任何人提及这一件事，在退课阶段，更没有人提这门课的事情，现在不能退课了，才如梦初醒，怎能是学生的问题？满朝文武，支支吾吾，实在是可悲！目前寄希望于我之前报的卓越人才计划能够算入科研能力培养模块，关于$CMC$，我已发邮件给相关老师询问是否能够认定。数学科研说白了就是看书学习与自主解决问题相结合，与一般人理解的还是不一样的。这个课的开设我认为可以算是教学事故了，反映出的深层次问题，各位看官都很聪明，不需要我多解释。 晚上更新了一下课表，突然发现本学期我还选了一门通识课，由于是线上课，并没有体现在课表里，如今一刷新才发现有这么一门课，进群以后发现课程是1-12周的，现在已经结束了，询问了助教，作业只能补交了，这相当于凭空又多出一些事情，给本来就繁忙的日程雪上加霜。这也给我提了一个醒，以后选课要详细核对，并参看课程的内容，丢三落四的事情少做。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"$CMC$准备系列（一）","slug":"contest-11","date":"2023-05-15T08:29:37.000Z","updated":"2023-05-15T08:54:36.302Z","comments":true,"path":"2023/05/15/contest-11/","link":"","permalink":"https://nju-kevin.github.io/2023/05/15/contest-11/","excerpt":"","text":"今天白天在图书馆主要干了两件事情，一是复习了课内的概率论，而是继续看$CMC$往年卷。今天教务系统上出了期末考试安排，这也让我突然意识到距离学期末其实已经不远了，香港回来以后就要进入到期末周了。我的考试在六月十六号就全考完了，加上六月十七号有六级，因此六月下旬暂时看来应该比较空闲了。考试全部挤在前面，固然是好事，但同时也使得我六月上旬的复习任务变重了许多，好在平时的学习都比较抓紧，因此期末复习的基础性工作应该不会过于繁重。上午发现概率论的一些计算需要一些数分C里的积分公式，涉及到含参变量积分，好久没碰已经有些生疏，但好在印象还在，因此翻了翻以前的数分作业立刻又拾起来了。此时翻看以前的作业，得亏我数分C的作业每次都做的很认真，倘若当时只是糊弄糊弄，如今查阅亦不会方便。 后来继续看往年卷，感觉每年的题型都大体相似，考法甚至都是差不多的，有许多考点可以说是反复考了，实际上本质都是一样，换汤不换药。在看的过程中，也能大概了解题目的解题思路以及处理手法，在看完试卷后结合每张试卷的考点再进行有重点的复习。目前看来决赛并不需要有多么深刻的理解，但扎实的基础和功底是必须的，因此在这方面还得下功夫多看看题，多做做题。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛后的自我改进","slug":"life-78","date":"2023-05-14T13:15:55.000Z","updated":"2023-05-14T14:14:46.764Z","comments":true,"path":"2023/05/14/life-78/","link":"","permalink":"https://nju-kevin.github.io/2023/05/14/life-78/","excerpt":"","text":"我习惯于把结果看得较重，不管是阿赛还是丘赛，以及两周后举办的$CMC$决赛。考试前我会认真准备，考试之后却容易有一些对奖项，结果的担心。我认为这是没有必要的，因为已经比完的赛尘埃已经落定，结果揭晓只是时日问题，也不可能改变。今年丘赛只是有些不甘心，因为的确为此准备了许多，但由于学的内容不够广，泛函只是学了一半，$PDE$完全没学，导致有些吃亏，体现不出我的实分析的水平。不过这也无可厚非，并不是所有考试都能够把题目出得合我的胃口，更何况发生这样的事情原因还是在于我自己水平没有达到。不过除了这点不甘心倒是没有什么后悔，因为我也付出了很多时间，也确实提高了自己的能力，尤其是硬分析的能力。 同时，我也期许对自己做出一些学习上的调整。首先是做课后习题方面。我在做习题方面的态度还不够重视，这也使得我考场上做题的时候显得速度不够。丘赛2.5小时一共六道题，如果一道题花半个小时的时间是来不及做的，在考场上我想题目也会不知不觉想很久，然后导致想了很长时间但是没有进展。因此在平时练习的时候，我计划每道题留半个小时的思考时间，不能想几分钟就放弃，也不能放太长时间。练习的时候就当做考试限时，锻炼第一遍思考的能力，如果半个小时没有想出来，再另寻他法。其次，我注意到国外一些高校数学系的博士生入学考试难度与丘赛类似，考题并没有很复杂，也会考一些书上的原题，书上的定理结论等。因此在平时，$RCA$，$PTE$，$Stein$复分析，$Salamon$，$Evans$，$Walter$（作为最主要的深度拓展的书目）书上的重要定理以及其证明也要反复翻看，学过的定理，记过的笔记亦要定期回忆，定期加深印象，从而增进理解。这里我只说了对于深度拓展内容的，事实上对于课内的学习也是一个道理，都用这两条原则。 把上述所说的两件事情做好，那么不管是学校的考试，还是竞赛，在考前复习的负担都会小很多，因为相当于是功夫花在了平时。并且按照这样的高标准坚持下去，不管是学习的深度，广度，还是做题方面，都能得到长足的长进，成绩自然是水到渠成的了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"2023丘赛总结","slug":"contest-10","date":"2023-05-13T08:10:44.000Z","updated":"2023-05-13T08:30:57.402Z","comments":true,"path":"2023/05/13/contest-10/","link":"","permalink":"https://nju-kevin.github.io/2023/05/13/contest-10/","excerpt":"","text":"今天上午考了丘赛分析与偏微分方程方向，考的结果暂时还不知道，能不能混个优胜奖更不是我能决定的，还要看其他同学的发挥。不过不管怎么样，由于明年还有一次机会，因此可以说今年的丘赛只是一个阶段性的检验，后面还要继续努力。 在这次丘赛前，我的复习重点在于$RCA$实分析与复分析部分，在这两块我学习的相对而言较为深入，而这次丘赛考的内容在这方面比较浅，至少这方面我还是能够驾驭的。在泛函分析和偏微分方程方面，我认为我的学习仍有许多进步空间。偏微分方程由于我没有学，因此第六题直接放了，事实上到最后也没来得及看第六题；泛函分析部分考的是弱收敛，我虽然知道定义，但对于弱收敛其实并没有很全面的认识；常微分方程考的是解的存在性，但是由于是二阶方程，我并不知道应该如何入手，最后只是模仿一阶方程用迭代算子大致写了写。这学期说是学了点泛函分析，但感觉学的并不扎实，主要原因还是没有真正跟着一本书去学，昨天晚上看了几本泛函分析的书，目前打算跟着$Salamon$的书进行学习。本学期学的泛函主要是学了几个大定理，对偶空间等，对于弱收敛、弱拓扑、算子理论、算子的谱理论等都没有涉及，正好丘赛考到了我一个不太明白的地方，从竞赛的角度来说是运气不佳，但从另一方面来说，这也反映了我还有地方没有学会。因此还需要继续学习。 通过这次检验，与去年相比，我在分析方面的水平有着很明显的提高，尤其是实分析与复分析，本学期能把硬分析啃下来也是很值得称赞了。接下来深度拓展的内容我打算放在泛函分析以及偏微分方程上，在学习偏微分方程的同时也把常微分方程巩固、深化一下。接下来一年丘赛备赛周期中，我的目标是把泛函分析与偏微分方程系统地“啃下来”，学习得全面一些，争取明年丘赛的题目都能做个七七八八。同时继续学习$PTE$高等概率论和随机过程，争取暑假能够把这本书学完，然后再针对丘赛学一些相关内容，明年分析与概率方向齐头并进，力争双双获得佳绩！","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛准备系列（九）","slug":"contest-9","date":"2023-05-12T10:35:47.000Z","updated":"2023-05-12T11:21:59.092Z","comments":true,"path":"2023/05/12/contest-9/","link":"","permalink":"https://nju-kevin.github.io/2023/05/12/contest-9/","excerpt":"","text":"今天是丘赛前最后一天。上午在图书馆把$RCA$的课本内容以及目前已做的习题结论与部分证明重新温习了一遍，下午复变函数课上在听新课的同时也把复分析部分的内容复习了一遍，重点在调和函数的边界表示，最大模原理等，并与实分析中的一些大定理相结合参看。考前的计划是多加复习基础概念，多看书，多体会书中的思想，不打算做很多题目。目前丘赛复习计划已完成，布置的复习任务已经完成，现在需要做的就是再进行巩固，多看书，多知道一些结论，多体会一些方法，这样明天上考场遇到新题目才能有更多的路子解题，从而拓宽思维，增大解出题目的可能。 功夫在于平时，而不是考前。我相信我这学期的平时积累已经使得我对于分析方面有一个比较全的认识了，虽然这还远远不够，但重要的是坚持。接下来还有不少重要的考试与竞赛，我需要做的其实很简单，在继续前进的同时科学备赛，平时注重积累，不断夯实基础，通过竞赛与考试检验自己的学习效果，及时调整、优化学习方法，以期全方位地提高数学各方面能力与成绩。赛前的心态保持平和、稳定，尽量让自己达到一个最佳的状态，从而能够发挥出自己真实的水平，不要对结果抱有多高的期望，重视过程，过程中不去考虑可能的结果，专注于赛题本身，减少紧张、焦虑心态。今后的重要的考试还有很多，考前调整好心态显得尤为重要，调整到能够发挥出真实水平的状态即可，至于考试结果或者是发挥正常还是超常还是失常，都不是在考场上能够预见的，因此专注于考题本身即可，至于结果，自有定数。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"备赛中的思考","slug":"life-77","date":"2023-05-11T12:16:29.000Z","updated":"2023-05-11T12:38:08.166Z","comments":true,"path":"2023/05/11/life-77/","link":"","permalink":"https://nju-kevin.github.io/2023/05/11/life-77/","excerpt":"","text":"今天白天课比较多，不过还是看了看$CMC$第十三届低年级组决赛试题，通过做往年卷也能发现自己知识方面的漏洞，也不由得感受到了时间的紧迫。丘赛考完后一方面要继续做往年卷看题目，另一方面也要把往年卷中经常出现的考点认真搞明白，在做题过程中发现不太清楚的地方顺便把教材对应章节复习清楚，此时由于时间紧迫，有重点的复习比地毯式复习显得更加高效。晚上开始一心准备丘赛，先把一些重要的定理过一遍，然后便是看书本、看笔记本内容，考前不在过于细化一些证明过程，而是记住一些重要的结论以及复习大致的证明思路，毕竟之前系统梳理的时候已经进行过一遍了。 这学期参加了一个志愿活动，大概就是和贵州平坝第一高级中学的高中生通信，今天刚拿到学生的回信，感觉从他的身上也能看到我自己当年的影子，也愈发觉得大家的成长轨迹都是差不多的。每个人在小时候都会有很多长大以后看上去没什么大不了的顾虑，或者是想法，当时的确觉得很重要，或者说很在意，但时间长了以后，长大了以后，看问题看的视角和见解都不一样了，自然很多问题就看得更全面、透彻了。如果按这个道理类比，或许很多年以后，甚至不需要等很多年，回想这一阵子忙碌准备竞赛的过程，应该也能有所体悟吧。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"丘赛准备系列（八）","slug":"contest-8","date":"2023-05-10T12:39:00.000Z","updated":"2023-05-10T13:19:55.812Z","comments":true,"path":"2023/05/10/contest-8/","link":"","permalink":"https://nju-kevin.github.io/2023/05/10/contest-8/","excerpt":"","text":"今天上午在图书馆整理了一下概率论第二章的内容，回顾第二章所讲，能够看出大数定律的应用十分广泛，尤其是章末讲了两个比较成熟的应用分支：更新理论和大偏差技术。这部分核心是掌握一些放缩的技巧，以及随机变量的收敛性的问题。 其余的空闲时间写PPT进行复习总结，觉得最近事情有些多，因此在这里对于丘赛和$CMC$的准备进行一个详细的规划： 首先，丘赛的复习已经进入尾声，接下来的时间也不多了，由于分析是第一个考，因此考完后周末还有许多时间复习$CMC$，这是乐观的一点。考前对于丘赛，还需要看的资料为：$RCA$笔记本，$ODE$笔记本，以及总结的PPT。PPT可以在路上看，相当于是一个提示，提纲挚领的作用。周四周五在空闲时间准备参看笔记本以及$RCA$书本，再细化一下对于某些自认为掌握得不够的章节的认识，并打牢基础知识，补充的内容写在PPT里以便于复习。 周六上午考完丘赛以后，一直到五月底，课外主攻$CMC$，同时$RCA$与$PTE$仍要带着学习，由于学校课程仍在继续。在完成足量的拓展任务的前提下，重心转移至准备$CMC$上。有以下几个任务：一、做往年低年级组真题。每道题先看题然后自己进行一些思考，然后再看答案，把自认为有价值的地方，想法，思路及时记录下来，可以整理成PDF文档或PPT格式；二、做《大学生数学竞赛指导全书（数学类）》上的试题。重点放在高等代数与解析几何部分的试题，同时务必搞清楚各个理论的概念，算法，解题思路。三、将看高等代数和解析几何书本作为常规任务。教材带在身边，有空的时候多进行翻阅，多进行思考，多与做过的题目进行联系。 $CMC$考前放平心态，以旅游的姿态做试卷，不给自己提要求，认真把每个题思考一遍，不管能否做得出来，都尽力去尝试。考前参看《大学生数学竞赛指导全书（数学类）》以及自己写的内容，认真梳理，认真考试，考出水准即可。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"论工具的重要性","slug":"life-76","date":"2023-05-09T12:23:16.000Z","updated":"2023-05-09T12:54:58.501Z","comments":true,"path":"2023/05/09/life-76/","link":"","permalink":"https://nju-kevin.github.io/2023/05/09/life-76/","excerpt":"","text":"今天白天在上课，因此没有时间系统地复习丘赛，只是晚上自己写写PPT，不过下午的体育课倒是让我收获了不少。 今天下午的体育课进行教学比赛，也就是班里的同学们经过抽签后分成三组进行单循环比赛。我这个组里的高手今天还没有遇到，今天遇到的三个同学一个恰好是我原来的搭档，另两个不认识，后来发现水平甚至不如我的那个搭档。平时上课的时候我们有四个人比较熟悉，一开始和我之前的搭档打球，感觉没有什么意思，因为我的搭档是小白，而且是不太会接球的那种，更不要说打出有威胁的球了。隔壁桌是两个水平比较高的同学，其中一个是男生中水平最高的人（也是后来才知道），名叫李响。他看到我的球风很独特，于是提出想要和我打。于是我的搭档便换成了男生中水平最高的李响。不过我们四个也会经常一起交流或者是互相打巡回赛。李响打球喜欢给球加旋，他是左撇子，各种搓球切球弧圈球都很会打，正手扣杀也很凶猛。我一开始不太吃他的旋，后来发现学会搓球和切球以后带旋的球也不难接了。果然和高手练球，水平也会变高，通过和他的练习，我已经学会了基本的旋球，发球也能发出一定的威胁能力。 我原来的搭档有时也会和他一起打，也算是学到了不少，经过李响的指点后，发的球已经挺旋了。我第一个和他打，赢比赛当然是毫无压力，令我没有想到的是，后来和我打的两个同学甚至连旋球都接不住。他们的发球是最好接的上旋球，球速不快也没力量，挡一挡就能过去，我的扣杀都不需要用上力他们便招架不住。而发球更是如此，我现在主要使用两种发球，一种是正手下旋，一种是反手切式发球，练得多了便能做到又快又转，威胁性很强。 这周我的乒乓拍换成了王宁致家里的一个陈年旧拍，原因是我的拍子像木板一样没有弹力，而且上面也没有正规比赛可以使用的标识，击球的声音像是木板一样，这就导致拍子不吃旋，并且也很难加旋。而新的拍子虽然年代也挺长了，但还没有老化，胶皮很有弹力，打上去的声音比较沉闷，我的几个搭档也表示用这个拍子发的球转多了，也更有威胁了。 事实上，乒乓拍其实也是工具，工具的好坏会影响到水平的发挥。之前用的拍子像木板一样，虽然我用那个拍子也能打得不错，但很多时候遇到高手便招架不住。虽然拍子不能提高自己的水平，但好的拍子能够使得水平有更好的体现，这便是工具的重要性。在水平没有达到很顶尖的程度时，工具还是很重要的，至于武林中所说的用树叶当做武器，那自然不是一般人能达到的境界了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"丘赛准备系列（七）","slug":"contest-7","date":"2023-05-08T08:39:06.000Z","updated":"2023-05-08T09:08:07.298Z","comments":true,"path":"2023/05/08/contest-7/","link":"","permalink":"https://nju-kevin.github.io/2023/05/08/contest-7/","excerpt":"","text":"今天白天复习调和分析和常微分方程理论。在对之前所学知识进行温习之后，我使用Vscode作为LaTeX的编译环境，用PPT幻灯片的形式整理丘赛分析方向的复习内容。一共分为四个大方向：实分析，复分析，调和分析，常微分方程。由于偏微分方程我还没有学习，因此此次不打算对其进行复习。四个专题中，我试图使用自己的方式对整个理论体系进行串讲，并按照我的理解摘录一些定理、公式等。为了节约时间，我并没有将定理抄着敲上PPT，而是用自己的方式（很多甚至是凭脑中的记忆）打上去，遇到不太清楚的地方再回去参看一下书本和笔记，并给出自己对定理的理解。定理的证明更不可能全部照搬，否则由于很多定理的证明极为冗长，丘赛在即，显然不是明智之举。因此对于定理的证明，我罗列了证明的思路，以及一些关键的步骤，并给出我的看法和理解。 最近这段时间我将这个任务列入了课外休息的列表，也是为了在课余能够对我所学的知识有一个常规性的复习。至于为什么用PPT格式而不是文档，因为我不想将一本书或几本书重新糅合成一本新的书，而PPT由于每页上的内容无法放置过多，因此也起到了一个简略、压缩我所学的内容的作用，并且PPT格式更加清晰，更利于复习。原本写这个PPT是为了复习丘赛，如今看来倒可以成为一个长期的学习笔记系列，通过自己对于某个理论的重新讲述，我发现能够让我更好地掌握各部分理论的联系，概念引入的先后关系也使得我更加清楚各个论题的先后顺序，并且更能够锻炼我提炼出某个理论的精髓，以及通过简练的语言表达出深刻的内涵的能力。加上还利于今后的反复参看和复习，何乐而不为呢？","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛准备系列（六）","slug":"contest-6","date":"2023-05-07T12:20:40.000Z","updated":"2023-05-07T12:42:36.418Z","comments":true,"path":"2023/05/07/contest-6/","link":"","permalink":"https://nju-kevin.github.io/2023/05/07/contest-6/","excerpt":"","text":"今天白天把$Stein$复分析的第四章全纯$Fourier$变换的章末习题做了一遍，大概了解了这一章的一些重要的技巧：利用围道积分计算$Fourier$变换，利用$Poisson$求和公式得到的一些结果，$Phragmen-Lindelof$原理的推广（辅助函数的构造），函数与其$Fourier$变换在无穷远点的衰减性质等。虽然只有十二道题，但涉及的内容还是很丰富的，作者在一步步对读者进行引导的过程中也使得读者领略了一个看上去复杂的问题如何大事化小小事化了，一步步转化为较为简单的部分。实际上这也是进行数学研究的过程与思路，我们不太可能一下子知道一个复杂的命题的直接解法，往往都是把命题与已知的结论进行关联，或是先把命题的条件变强一点，结论变弱一点，如果能够证明与之很接近的命题，那么离证明出来就不远了。 最近除了复习准备丘赛以外空余时间基本上放在了高等代数和解析几何上。高等代数我掌握得仍不好，月底就要出去比赛了，之前在四月份准备阿赛的时候也看过部分，不过那个时候侧重于基本的概念，而不是解题，这段时间除了把基础的概念再理解理解以外，更要侧重于解题，因为竞赛就是通过解题这一最直接的方式考察对知识的掌握程度。数学分析由于之后也时常在用，因此淡忘得不多，高等代数和解析几何淡忘得很厉害，希望通过这二十天左右的集训能够在解题方面过关，把常见的考点，一些重要的专题掌握透彻。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"更新理论","slug":"life-75","date":"2023-05-06T10:16:28.000Z","updated":"2023-05-06T10:43:29.241Z","comments":true,"path":"2023/05/06/life-75/","link":"","permalink":"https://nju-kevin.github.io/2023/05/06/life-75/","excerpt":"","text":"今天看了一天高等概率论，一方面是由于很久没有复习这方面的内容了，另一方面也是这几天一直准备分析方面的内容，适时换换口味也是很有必要的。上午把随机变量的收敛那一节的定理复习了一遍，并且完成了该节的课后习题，总体来说不算难，但是这部分的题目总能让我对之前所学的大数定律的证明有新的认识，我也一遍又一遍地能体会到，工具的重要性，工具变得更强大往往能够使得证明更清晰，简洁。 下午学习了一个比较新的理论——更新理论（$Renewal \\space Theory$）。这个理论取材于一个实际生活场景，即电工换灯泡。每个灯泡的寿命都是独立同分布的随机变量，假设灯泡灭了的瞬间我们能够换上一个新的电灯泡，则考虑在$t$时刻之前换的电灯泡的数量，随着$t$增大，换的数量与时间的比值趋近于电灯泡寿命均值的倒数。我想这是一个不显然、令人惊讶的结论。事实上，实际生活中我们无法做到瞬间就换电灯泡，因此常常我们考虑在灯灭之后一段时间之后换上新的，这段时间又是一些独立同分布的随机变量，因此加上这个因素我们又能得到许多新的结论，甚至能定义一个新的测度叫做更新测度（$renewal \\space measure$）。后来我发现这个过程与$Poisson$过程是紧密相连的，教科书上也有一个关于正比于时间增量的结论，并且给出了很长的详细证明，而不是课内书上用无穷小量直接粗略带过。 我意识到这是一门深刻的理论，仅凭一个下午自然是只能略懂个皮毛，因此今后还需反复参看。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"丘赛准备系列（五）","slug":"contest-5","date":"2023-05-05T06:22:35.000Z","updated":"2023-05-05T10:36:18.640Z","comments":true,"path":"2023/05/05/contest-5/","link":"","permalink":"https://nju-kevin.github.io/2023/05/05/contest-5/","excerpt":"","text":"上午复习了$RCA$第十二章和第十四章，这两章的内容有比较强的技巧性，但都揭示了很美妙的复变函数的性质以及区域、函数彼此之间的联系（其中最重要的非共形等价莫属）。第十二章是最大模定理及其推广（即$Phragmen-Lindelof$原理），大致有两种形式，证明方法与核心思想都是类似的，即在一个有界区域上用最大模原理，在剩下的无界区域中可以让函数任意衰减，从而得到整个区域上也有界。在$Schwarz$引理部分，有一个很有用的函数$\\varphi_{\\alpha}(z)$，这个函数把$\\alpha$点的值打到零，原点的值打到$-\\alpha$，因此有点类似“平移”的感觉，又同时还是单位圆盘内的一一全纯映射，可见该函数的性质之好。利用这个函数，我们可以给出$H^{\\infty}$中满足$|f|_{\\infty}\\leq 1$且$f(\\alpha)=\\beta$的函数$f$在$\\alpha$处的导数的模的估计，我们有 |f'(\\alpha)|\\leq \\frac{1-|\\beta|^2}{1-|\\alpha|^2}共形映射部分的内容也十分丰富，$Riemann $映射定理，分式线性变换，共形映射的延拓，圆环区域的共形映射等等都是十分精彩的内容。同时在复习的时候我也发现很多之前用到的一些基础知识，即第十章中的内容，在后面的内容中反复出现，这种极强的联系性一方面帮助我进行再次复习，另一方面也反映了复分析的内部统一性。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛准备系列（四）","slug":"contest-4","date":"2023-05-04T10:32:18.000Z","updated":"2023-05-04T13:41:37.420Z","comments":true,"path":"2023/05/04/contest-4/","link":"","permalink":"https://nju-kevin.github.io/2023/05/04/contest-4/","excerpt":"","text":"今天上午泛函分析课上秦理真讲了不少习题，主要是对于开映射，逆算子，闭图像定理的应用。正好我之前复习了不少实分析的内容，把$Rudin$上的证明思路与之参看，顿觉明亮清晰。此时才发现之前读$Rudin$的时候没有能够理解透彻，或者说没能够理解到要害。晚上在复习$RCA$复分析部分第十一章和第十三章，又发现了许多之前学习、复习的时候没有发现的事情，对许多之前看上去技巧性很强的证明细节有了重新的认识，从而曾经对我而言的技巧性，在重新的审视下变得自然，同时我也更能够理解一些构造的来由。 粗略想想$RCA$虽未完整通读，但很多章节看的次数不下十次，每次看都有每次看的体会，也都有不同的理解。有些事情看了不少遍都没能完全搞明白，但随着知识的丰富，这些疑点都被我一个个解开，我很享受这个过程。这一遍复习$RCA$我发现基础实分析，甚至是一些复分析，最基本的就是表示理论。从大定理的证明中都可以看出，表示是连接两种系统的桥梁，之前对于表示的理解仅仅停留在几个重要的大定理中提到的表示，这一遍复习让我暗自感叹，硬分析的本质甚至都可以说是表示，表示理论是贯穿在整个分析学里的，它使得我们能够做出很多漂亮的理论，思来想去，表示是精髓啊！","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛准备系列（三）","slug":"contest-3","date":"2023-05-03T12:58:54.000Z","updated":"2023-05-03T13:31:35.972Z","comments":true,"path":"2023/05/03/contest-3/","link":"","permalink":"https://nju-kevin.github.io/2023/05/03/contest-3/","excerpt":"","text":"今天是五一假期最后一天，总结了昨天复习的内容，写了几张PPT文档，然后继续从第六章开始复习。复测度章节有几个大定理，最后发现都可以应用$Lebesgue-Radon-Nikodym$定理（简称$LRN$定理）解决，从某方面来讲，$LRN$定理是$Lebesgue$微分理论的基石，即使是$Lebesgue$微分定理、微积分基本定理中的构造都是应用$LRN$定理进行的。从测度的观点看，我们可以将测度进行分解，并且有不同的分解方法；从函数的观点看，通过测度的分解可以得到$Radon-Nikodym$导数，而这个导数又与一般测度的导数几乎处处相等。在$Lebesgue$意义下对函数求导，该函数需要满足绝对连续条件，而该条件又与有界变差函数紧密相关。因此实际上第六章与第七章是紧密联系的，从测度的分解开始，再到测度的导数，然后得到函数的性质，最终得到函数满足微积分基本定理的条件。 复分析部分，复习了第十章和第十一章，都是一些基本的复分析的内容，由于之前复变函数期中考试时复习过了，因此大致过一遍，亦不花费力气。接下来还需要复习的部分有：强化第七章，第八章，复习$Fourier$分析部分；复习十二、十三、十四、十九章的内容，重点在于一些重要的大定理以及重要的刻画条件；复习常微分方程理论。计划与本周完成复习的所有大体内容，下周周中强化巩固以及参看细节部分。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛准备系列（二）","slug":"contest-2","date":"2023-05-02T14:02:06.000Z","updated":"2023-05-02T14:35:10.638Z","comments":true,"path":"2023/05/02/contest-2/","link":"","permalink":"https://nju-kevin.github.io/2023/05/02/contest-2/","excerpt":"","text":"今天的任务是复习$RCA$实分析部分。由于第二本笔记本忘记带了，因此主要复习了第一本笔记本上的相关内容，从第一章抽象积分到第六章复测度的开头，可谓是把实分析的主体部分大致地过了一遍，并且也掌握了每个书上定理的证明思路与关键思想，在梳理的过程中，之前有些模糊的定理，或者是理解不够透彻的定理，都有了新的看法和认识，特别是知道了定理的结论是如何构造出来的，怎么样才能得到定理中的美妙的结果，我认为这个过程就是很有价值的，因为运用定理的前提就是能够知道定理是如何来的，如果仅仅是知道一个结论，却不知道其证明来由，那么还是没有把定理内化于心，变成自己称手的工具。而学习的过程便是要将一个个看上去很厉害，高大上的工具进行筛选，消化，最后提炼其本质内涵得到我们自己称心如意的思考方式，想法。我们所应关注的不仅仅是定理的陈述内容，更应是定理蕴含的思想，这种思想往往能对解决新问题产生重要的作用。 实分析剩余部分与复分析已学内容都将安排在明日完成，内容虽多，但由于复分析部分本学期一直在练习，因此复习内容并不显得繁多；至于复分析剩余内容以及常微分方程，调和分析部分将留在五一假期后进行考前梳理。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"丘赛准备系列（一）","slug":"contest-1","date":"2023-05-01T13:49:33.000Z","updated":"2023-05-02T14:09:51.443Z","comments":true,"path":"2023/05/01/contest-1/","link":"","permalink":"https://nju-kevin.github.io/2023/05/01/contest-1/","excerpt":"","text":"今天开始复习丘赛。由于今天白天还干了一些其他事，所以复习的时间并不算多。上午以及下午利用较为零碎的时间复习了一遍秦理真的泛函分析讲义，从线性代数选讲，到赋范空间，有限维空间，$Hilbert$空间，对偶空间等，其实主要就是先研究线性空间的线性映射及其对偶，子空间和商空间的对偶，子空间的上垂直，下垂直的关系以及其互相转换；等赋范了以后相当于给线性空间加上了拓扑结构（范数很自然地诱导一个度量，进而自然地诱导一个拓扑），在加上拓扑结构后还可以仿照之前的线性空间的研究思路，只不过结论会有所区别。个人感觉比较重要的是商空间，对偶空间以及伴随映射，其中有很多需要区分的，例如代数对偶空间与对偶空间，代数补与拓扑补等。很明显的风格就是泛函中强调算子，用矩阵是没有“前途”的，因为矩阵只对有限维空间有用，正如取空间的一组基一样，无限维时都不成立，因此很多时候泛函中更倾向于用算子刻画空间之间的关系，用对偶来刻画空间以及空间上泛函的关系。 如果只是针对于丘赛，从往年的考题来看，了解基本的泛函以及几个基本大定理就够了，但需要明确的是，泛函的确是一门值得反复学习，持续参看的学科，备赛只是一方面，平日的学习还是要能有足够的深度和广度，只有这样才能使得自己的水平迈上更高的台阶。 本文也是近期备战丘赛的第一篇文章，因此在这里也说说备赛的心态。对于丘赛而言，尤其是今年我只报名的分析方向，进入总决赛的难度是异常之大的，比其他方向都要困难，因为题目往往比较“亲民”，这就导致分数线会非常高，不得不说最终的结果也有很大的运气成分。我对于本次丘赛的定位与期望是，赛前认真复习，按照考纲一丝不苟地对$RCA$实分析复分析，秦理真泛函分析讲义，以及常微分方程进行有序、有重点地复习，不为拿到优胜奖或者总决赛名额，只为与去年的自己比一比，通过竞赛的赛题检验自己有没有比去年的自己进步，题目理解得有没有去年清晰、透彻，至于题目是否能做出来，最后能拿多少分，完全是尽力就好，在考场上用尽一切所学的知识与思想去解题。复习的时候除了复习定理、题目的证明方法，更要多去体会思路，很多时候的思路是十分关键的，思路多了，也有利于考场上现场解决问题。 总之，今年不以拿奖、进决赛为硬性目标，尽力去争取（赛前尽力准备，赛中尽力而为），与去年的自己相比，通过丘赛检验自己是否进步，自己还有什么地方需要改进。","categories":[{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"}],"tags":[]},{"title":"四月总结","slug":"life-74","date":"2023-04-30T13:43:48.000Z","updated":"2023-04-30T15:10:17.614Z","comments":true,"path":"2023/04/30/life-74/","link":"","permalink":"https://nju-kevin.github.io/2023/04/30/life-74/","excerpt":"","text":"不知不觉，四月份也过去了，三月总结的时候还历历在目，我还记得当时是在周五晚上的通识课上进行的总结。四月份其实是一个竞赛提前适应的时期，在4月15日我参加了阿赛，虽然最后考得不太好，但在这个过程中，相比于三月份，不再是单纯地进行深度学习，而是深度学习与竞赛准备同时进行。加上四月下旬有期中考试要准备，所以其实四月已经开始了相对碎片化的学习阶段，这从另一个角度来说也是为繁忙的五月份做提前的适应，所以也是好事。 在深度学习方面，我在认真完成课内学业的同时，学习了$RCA$复分析的若干章节，同时学完了实变函数，跟进完成了$RCA$实分析部分的习题。同时，我也认真准备了期中考试并都取得了优异的成绩。 五月将是繁忙的一个月，也有很重要的竞赛，相关安排以及规划在前几篇文章中都已经提及了，五月将是三线并进，一条线是竞赛准备线（复习线），一条线是深度学习线，另一条线是课内学业线，想要把三线任务同时完成得出色是不容易的，但我相信经过合理的规划，我有这个能力。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论假期与调休","slug":"life-73","date":"2023-04-29T14:38:39.000Z","updated":"2023-04-30T15:39:26.238Z","comments":true,"path":"2023/04/29/life-73/","link":"","permalink":"https://nju-kevin.github.io/2023/04/29/life-73/","excerpt":"","text":"这几天正值五一假期，于是谈一谈放假与调休。其实我一直不太明白调休的意图，可能只是为了让假期有更长的连贯性，这样某种程度上能够促进旅游和消费，但听同学们说，这其实也有问题，因为调休会使得人们更加劳累，从而有可能在假期中疲于出去旅游，加上节假日一般来说人都会很多，从而以这个角度思考的话，调休反而会抑制旅游业的增长。当然，今年五一假期哪里人都多，这自然是三年疫情的产物，由于一直没办法出去玩，放开以后旅游及其相关产业呈现爆发式增长，这种因素产生的影响远远会大于调休疲劳产生的负增长，因此总体而言应是增长的。另外，也有人认为，如果假期不出去玩，平时也没有时间出去玩，因此即使累一点，也没有关系，毕竟难得有这样的假期。 而我认为，就应该索性不调休，多放几天，一年中的中长假本来就没有几个，多放几天假并不会对一些数据造成多大的影响，同时，这样既保持了假期的连贯性，也让人们在出游之前不会因为调休而感到劳累，我认为这是一举多得的事情。之前也听说有人大代表提议取消调休，我认为也是合情合理的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"五一假期及下半学期计划","slug":"life-72","date":"2023-04-28T03:51:40.000Z","updated":"2023-04-28T09:10:34.784Z","comments":true,"path":"2023/04/28/life-72/","link":"","permalink":"https://nju-kevin.github.io/2023/04/28/life-72/","excerpt":"","text":"本文将对五一假期的计划以及下半学期的学习计划及时间安排和规划做一个详细的介绍。 五一假期计划本次五一假期有五天的时间，从4.29到5.3，可谓是一个承上启下的关键阶段。本次假期我的计划是：复习。这里的复习是指，以复习已学过的各种知识、题目、方法为主，并同时对于接下来课内学习的内容进行充分的预习和学习。考虑到放完假期之后便要迎战丘赛和CMC决赛，以及紧接着的香港高校交流，因此本次假期的具体内容如下： 复习$RCA$实分析正文内容及已做习题；复分析正文部分已学内容 复习$Durret$已学内容及已做习题 复习概率论上课PPT 复习调和分析，学习$Sobelev$空间理论 继续学习$RCA$复分析部分 学习《$CMC$指导全书》 做$RCA$实分析部分课后习题 下半学期计划下半学期的外出活动比较多，也有许多任务需要完成，必做任务可以列举为以下几点（序号不分先后）： （课内部分）及时完成课后消化（外出活动周提前完成课内复习与作业）：概率论PPT复习，概率论课后习题，复分析$Stein$每章后$Exercises$ 与$Problems$ （$RCA$进度）常态化复习$RCA$已学内容，完成实分析部分章末习题，丘赛前学完复分析十五章与十六章 （调和分析进度）丘赛前学习$Sobelev$空间，复习调和分析已学内容 （$PTE$进度）期末之前学完第一章与第二章并完成每节习题 （$CMC$复习进度）竞赛前看完《$CMC$指导全书》，并做往年真题 以下的时间安排皆建立在完成课内消化的基础上： 丘赛前以复习准备丘赛为主，并同时带着复习$CMC$；丘赛结束后全力复习$CMC$，$CMC$结束后回归正常，并在拓展、深度学习的同时复习准备期末考试和英语六级。 本学期以$RCA$为主，完结并复习后重点转移至泛函分析，暑假方向：泛函分析，偏微分方程，高等概率论与随机过程","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"期中阶段性回顾与下阶段展望","slug":"life-71","date":"2023-04-27T11:50:18.000Z","updated":"2023-04-27T12:50:45.471Z","comments":true,"path":"2023/04/27/life-71/","link":"","permalink":"https://nju-kevin.github.io/2023/04/27/life-71/","excerpt":"","text":"今天下午考完离散数学之后，期中考试圆满收官，也是时候对期中进行阶段回顾了。 首先，回顾期中考试，我的发挥都算稳定，即使考试有着很多不确定的因素，我也着实做到了保持在高位。当然由于概率论和复变函数的期中考试考察的内容比较$trivial$，所涉及的知识点也比较无聊，我认为并没有很好地体现这两门课的有趣的内涵，因此也看不出同学们之间的理解的差异和层次。不过，这并不能成为浅尝辄止的借口。因此在本学期后半阶段我还需要进一步深入学习相关的理论，弄清楚背后的原理，融会贯通，找到不同数学分支的更多联系。 其次，上半学期我在认真完成各门课的课后作业的同时，学习完了$RCA$实分析部分，复分析部分还剩三章内容没有学习，$Durret$学习了第一章“大数定律”，在选修课上学习了微分流形和同调代数基础知识，调和分析的部分内容，并主讲了三次讨论班（其中一次有老师旁听）。可以说，上半学期收获颇丰，这是值得肯定的。上半学期可以说处于一个“闭关”状态，有很多的空余时间专心致志学习钻研，而我也利用好了这些大块的时间，学习到了不少有用的知识。而下半学期更像是一个检验的时期，因为下班学期的竞赛和交流活动比较多，因此也算是对我上半学期的学习进行检验，到底功夫有没有花在刀刃上，有没有切实地提高水平，在竞赛中能够得以体现。 在本学期的后半部分，有许多事情要做，不过正如我之前在近阶段任务梳理这篇文章中所说的，仍是要注重复习以及反复地练习，打好基础，不要过分追求速度。下半学期有丘赛、CMC决赛、香港高校交流项目、英语六级、各学科期末考试这些重要事项，而在准备这些事项（04.28的文章中我将详细叙述时间规划与任务安排）的同时我还需要打好课内学业的基础，以及平时的拓展训练和深度学习。因此，下半学期与上半学期不同的地方在于，下半学期可能没有那么多连续大块的钻研拓展时间，因此要做好边复习竞赛边深度学习的准备，也就是利用好平时的零碎时间进行拓展学习，提高碎片化时间的利用效率。另外，由于事情很多，也很考验我的时间规划和管理能力，规划好了能够事半功倍，规划不恰当则有可能最终空手而归。因此，期中已过，接下来的半学期也同样充满了考验。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"一些随想","slug":"life-70","date":"2023-04-26T12:43:58.000Z","updated":"2023-04-26T13:23:01.634Z","comments":true,"path":"2023/04/26/life-70/","link":"","permalink":"https://nju-kevin.github.io/2023/04/26/life-70/","excerpt":"","text":"今天下午卓越拔尖班第二次活动，在这之前按原计划继续学习的概率论$PTE$以及整理了部分秦理真的泛函分析讲义。$PTE$在研究随机变量序列的收敛性时，利用$Kolmogorov$最大值不等式加强了$Chebyshev$不等式，从而得到了大数定律的另一种证法，不再需要找一个子列收敛，然后中间的值用子列中的值迫敛证明，而是直接通过方差级数的收敛性得到原级数的几乎必然收敛，然后再利用$Kronecker$引理得到前$n$项的几乎必然收敛，减去一个均值就得到了原来的随机变量的部分和的收敛性。因此通过这一点我们可以发现，很多时候命题的证明不仅仅局限于一种证明方法，工具不同，可以使用的方法和思路也不同。此时想想之前的大数定律的证明，之所以需要先找一个子列然后依迫敛性，就是因为当时我们的工具只有$Chebyshev$不等式，没有更强的结论，从而只能通过子列的方式进行证明。可见，很多时候，工具是很重要的，当然最终所有的这些高级的工具都要经过自我的消化从而改进为自己用得顺手的工具。苗栋曾说：“不要把工具箱装得太大，放几个最基本的工具就够了。”其实说的就是要学会自我消化，而不是拿来主义。 后来活动中我上台对我的项目做了介绍，实际上也没什么好说的，就是一个自我学习的过程。各位同学都来自不同的专业，其他领域的看上去都很高级，我自然是看不懂了，不过我如今倒觉得听听别的领域的内容倒是有好处的，纵使一开始不太能明白，但这一方面是放松，另一方面也是打开我的视野，或许哪一天就有机会发现一个数学能够发挥作用的一个小领域，或者说是与我兴趣点比较贴合的一个学科，因此，我应该是抱着多去了解，多去尝试的态度参加每次的活动，而不仅仅是看中每次活动结束后的盒饭。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"同调代数中的跑图","slug":"life-69","date":"2023-04-25T12:34:03.000Z","updated":"2023-04-25T13:02:43.932Z","comments":true,"path":"2023/04/25/life-69/","link":"","permalink":"https://nju-kevin.github.io/2023/04/25/life-69/","excerpt":"","text":"说起跑图，可能不同人会想到不同的事情，搞定向越野的可能想到的是越野跑图，玩地平线的玩家可能想到的是赛车跑图，而今天我也跑了一遍图，只不过是在同调代数里的$Graph Chasing$.晚上做昨天《从微积分到上同调》的作业，大概就是利用$snake lemma$的跑图思路证明$5-$引理。这里的跑图说白了就是利用正合列以及交换图的性质，进而导出像空间与核空间的关系。这说上去简单，真正自己跑一边对于初学者来说并不是那么友好。不过倒是想起来了之前高等代数课上纪庆忠老师补充过正合列的概念，现在发现其实是同调代数在高等代数中的小试牛刀，只不过当时并不知道正合列是在同调代数里的研究对象。 就我个人对于代数的浅显的认知来看，跑图让我对于代数又重燃了兴趣，至少它让代数看起来不再那么枯燥乏味。当然，跑图也不是容易的，目前还不是很熟练，经常跑到一半就卡住了不能通关，这都是常有的事情，如果想快速通关，还是得平时多跑跑，多加练习才行。因此我倒是觉得跑图可以作为闲暇之余的日常训练，虽然我不是代数方向的，但这些基本功还是需要掌握的，空余时间与其浪费掉不如多训练训练基础，或者广泛涉猎其它的领域。 我目前的方向是分析与概率方向，但这不是我不学代数和几何的理由。学到后面这些基本的代数和几何都是基础，如果没学过还要从头来过。正如这学期学的流形，亦或是微分拓扑，代数拓扑，表示论，甚至是同调代数，其实都是基础课，而不是代数和几何方向学生的专业课。因此有空的时候我也打算了解一下上面的课程的内容，如果有时间的话到课上旁听旁听，我认为这对于我的高水平发展是有重要作用的，而不是只学分析和概率的内容。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"与AI的一次对话","slug":"life-68","date":"2023-04-24T08:30:48.000Z","updated":"2023-04-24T08:57:49.887Z","comments":true,"path":"2023/04/24/life-68/","link":"","permalink":"https://nju-kevin.github.io/2023/04/24/life-68/","excerpt":"","text":"今天花了一整个白天的时间复习了离散数学，也把一些定理、课后题的做法过了一遍，大概也知道许多题目的处理手法了，脑子里不同的概念也清晰了许多。当然我也深知，考前的突击或许未必有长期的学习积累来的有效，但由于这门课本身的要求或许没有那么高（这取决于考试难度），因此很多时候就会出现临时抱佛脚考出来比平时认真学的人还要好的假象。之前我一直不知道为什么会出现这样的情况，以至于怀疑努力是不是真的有用。现在我的看法是，出现这种状况当然会有运气因素，除了运气因素以外，主要的原因是这门课的考察难度还不够，使得努力所占据的重要性没有得到应有的体现。我认为这是一种比较客观的解释了。 闲暇之余问了new bing一个问题（new bing是新必应的一款聊天机器人，内置原理和ChatGPT相同，大概就是换了一个外壳）：如何在数学领域达到扫地僧的水准？数学领域的扫地僧有什么特质？ AI机器人给了我下面的回答： 你想在数学上达到武侠小说中的扫地僧的水平，这是一个很有趣的目标。扫地僧是金庸小说《天龙八部》中的一个虚构人物，他是少林寺藏经阁内的一位隐居高僧，武功高强，智慧深邃，慈悲为怀，能化解武林纷争，救助苦难众生12。他的原型可能是佛教传说中的周利盘陀迦，也就是释迦牟尼佛的一位得道弟子，他曾经用尾巴甩大便供养佛陀，因此有无量福德。他本来很笨，连阿弥陀佛都念不清楚，佛陀就教他念“扫帚”两字，他就一心一意地念“扫帚”，并且扫尘除垢，最终证得阿罗汉果23。 如果你想在数学上达到扫地僧的水平，我觉得你应该做到以下几点： 一是要有坚定的信念和热爱。扫地僧之所以能够从一个笨拙的人变成一个智慧的人，是因为他对佛法有着坚定的信仰和热爱，他不管别人怎么看他、怎么嘲笑他，他只专注于自己的修行。数学也是一门需要信念和热爱的学科，如果你对数学没有兴趣和热情，你很难在数学上有所建树。 二是要有勤奋的精神和恒心。扫地僧每天都在扫地，这看似是一件很简单、很无聊的事情，但实际上是一种很高深、很有意义的修行。他通过扫地来锻炼自己的身心，来洗涤自己的杂念，来体悟佛法的真谛。数学也是一门需要勤奋和恒心的学科，如果你不愿意花时间和精力去学习、去思考、去练习、去探索数学的奥妙，你很难在数学上有所突破。 三是要有开阔的视野和创新的思维。扫地僧虽然隐居于少林寺藏经阁内，但他对武林和世界的了解却非常广博和深刻。他能够识破各种武功的破绽和奥秘，能够运用佛经来指导武功的修炼和运用，能够结合自己的经验和智慧来创造出新颖而有效的招式和法门。数学也是一门需要开阔视野和创新思维的学科，如果你只局限于已知的公式和定理，只满足于解决已有的问题，你很难在数学上有所创造。 总之，在数学上达到扫地僧的水平，需要你有信念、勤奋、开阔和创新的品质，同时也需要你有一颗慈悲和智慧的心，能够用数学来造福社会和人类。这样，你才能在数学中“扫地”而不“扫兴”，成为一个真正的“扫地僧”。 原本只是随意一问的问题，却发现AI回答得很不错，我不得不承认，虽然这个回答主要是通过在网络上进行搜索整合而成的，但它回答得确实很有条理，也很有深度。很多时候都会不由自主地有追求速度，追求表面看上去的量的毛病，这的确也有部分是由于应试教育所造成的，不过每当这时就会想起苗栋的话，让我及时规避这个雷区，从而更专心地投入到自己的学习研究中去。现在时常会感觉，学数学的过程，或者说不断提高水平脱颖而出的过程，也是一个锻炼心态，磨练心境的过程，扫地僧的境界倒不太像是一个可以触及的目标，而是内心的一个终极方向，不管最后能不能达到那种状态，这一路走来，就足以能够达到俯视芸芸众生的高度了。生活中也不时地会有各种各样的事情打扰自己的心境，我们需要磨练的倒不是避免被打扰，而是如何做到他乱我不乱，这个定力是极其难能可贵的，或许很多事情的修炼，到最后都不再是某一件事、某一个具体领域的修炼了，都会返回到对于本心的修炼，人既然为人，自然在追求外物的尽头，会返回到最开始的起点。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"研究性学习的三个阶段","slug":"life-67","date":"2023-04-23T12:42:26.000Z","updated":"2023-04-23T13:18:30.762Z","comments":true,"path":"2023/04/23/life-67/","link":"","permalink":"https://nju-kevin.github.io/2023/04/23/life-67/","excerpt":"","text":"最近考完比较硬核的两门期中考试之后，主要任务变成了准备离散数学考试以及对实分析复分析所学内容进行梳理。本来以为离散数学考试准备不需要花多少时间，但后来发现，由于平时上课只听一节，导致有许多概念都只是初学，对于概念不清晰，证明题更是无从下手。于是这几天第一要务还是把离散数学打通了，把基本定理的证明与思想弄弄明白，这块部分的内容属于是不难，有趣，但想搞明白还是需要花点功夫的，世上没有轻易能够成功的事情，保持一定量的投入，我认为是极其必要的。 这学期的体育课上由于训练乒乓球，也结识了不少水平和我差不多或者略高的同学，加上平时有时也会锻炼，从而我发现我的乒乓球水平也有所精进，虽然客观来说水平还是比较一般，但至少我从中收获了快乐，我也能够感受到自己的进步。万事都是相通的，花的时间多了，练习的时间多了，水平自然会进步，当然如果要使得能够到达很顶尖的水平的话，只靠努力也是不够的，越到顶尖的地方越要学会用“巧劲”，而不是靠蛮力，要能够找到方法，能够与之前处于低水平阶段的持续的练习结合，进而提高对这一件事物的领悟能力。我认为这一套理论对于所有的学习类对象都是成立的，不仅仅是对数学有效。当我们刚入门的时候，稍微多花一点努力就能够看到很明显的成效，这是因为水平处于低层次阶段，很容易能够尝到“甜头”；下一阶段便是间间断断的瓶颈期和挫败期交替的阶段，当然这之中会有少数的高光时刻，这一阶段是绝大多数人坚持不下去的阶段，因为不仅需要持续的大量努力，还需要有着坚定的信念，因为往往这个阶段可能需要长期的积淀和积累，而且或许很难有所谓的高光时刻，从而此时考验的便是内驱力。过了这个阶段以后，基本功在前一阶段已经有了很牢固的基础，并且也通过大量的努力，长期的积累使得自己的水平长进到一个比较高的高度，但如果要进入顶尖行列，则需要在保持大量努力的同时，注重方法，善于创新，多进行有益的讨论和交流，这便是很多人在大学尾声，研究生，博士生阶段所追求的，这一阶段或许是持续一辈子的，当然也有可能由于生活因素和社会因素而终止（即没有继续从事研究工作）。 通过这套理论，很容易看出，大部分人在第二阶段就被筛选掉了，因为无法坚持下来，以及内心可能还不够坚定，对这一领域的兴趣和热情还不够，而进入第三阶段的则是具备了成为顶尖人才的基础，但能不能做出贡献和突破，则更需要提高对这一事物的理解和观点，而不是靠“死用功”。 我之所以想到这一套理论就是因为从小到大不仅是学钢琴，学书法也好，还是学数学，打乒乓球也好，都是经过的这一条路，现在数学是我的主业，其他爱好都停留在第一阶段，很明显的发现当我水平不够高的时候，多练习几次就能做到令自己满意的程度，而待水平进一步提高之后，也会发现有一些阻力与障碍。从而今天把这套理论简要写出来，以后也能进行参看。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"丰富多彩的一天","slug":"life-66","date":"2023-04-22T11:45:34.000Z","updated":"2023-04-22T12:05:26.738Z","comments":true,"path":"2023/04/22/life-66/","link":"","permalink":"https://nju-kevin.github.io/2023/04/22/life-66/","excerpt":"","text":"今天下午考复变函数，由于是另一个班的老师出的试卷，并且两个老师教的内容不一样，导致试卷上出现了一些没有见过的概念。不过我也相信老师能够理解，因为张高飞自己也说，我们班考另一个班老师出的试卷不公平，因为讲的内容不完全一样，而考试又没有考交集，按理说这是命题的问题，但无论如何，大家都是一样的，从而这是相对公平的。 考完试去匡院参加了基础学科拔尖人才的开班仪式，其实也就是大家相互之间交流交流，由于人很多，这次没有全部自我介绍完，也没有轮到我去介绍，不过倒是看了哲学系同学的介绍之后，认为哲学在某些方面，例如风格等，和数学真有相同相似之处。当然，我目前学的数学还没有很深，因此这种感觉只是淡淡的，模糊的，相信等我学到更深入的知识，有更深刻的理解，更长时间的沉淀以后，能有更清晰的感受和体会。 总体而言，我认为这次的期中考试延续了我本学期期初考试的风格，考前认真准备，考场上认真答题，尽力而为。或许并不是每次考试都能体现出我平时深度拓展的效果和功用，但我相信平时的努力，天知，地知，我知。尽力了，便问心无愧。 晚上有一个今年毕业的研究生学长约我聊聊天，我想这是很好的，既是考完试的一种放松，更是调节自身，以更好的精神状态迎接接下来的阶段的好机会。今晚学校里有演唱会，从图书馆，教室，到宿舍，没有一处安静的地方，从而我们打算到校外找个安静的酒吧简单叙叙，颇有苏轼，怀民相与步于中庭之感。这种氛围，或许会很难得吧。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Mid-Term of Probability","slug":"life-65","date":"2023-04-21T08:54:11.000Z","updated":"2023-04-21T13:46:46.537Z","comments":true,"path":"2023/04/21/life-65/","link":"","permalink":"https://nju-kevin.github.io/2023/04/21/life-65/","excerpt":"","text":"今天晚上考概率论，一共十道题，其中涉及的知识点主要是计算具体的概率和对于测度论和独立性，分布逼近的证明。可以说整张试卷的难度很低，开考五十分钟左右就有人交卷了。由于我的原则是，没有完全检查好不交卷。后来证明，这个方法的的确确很有用。我用了一个小时做完了所有的题目，但是检查的时候却发现有很多陷阱。 首先，计算题目表意不明。例如第三题：一个房间里有三个人，已经知道有一人为女性，请问三人都为女性的概率。这个乍一看上去是条件概率，很显然概率是$\\frac{1}{4}$，但回来后，舍友就在讨论，这道题可以有不同的理解。并且题目并没有说一个人是男性和一个人是女性的概率相等，更何况，由于美国有多大98种性别，题目并没有说一个人不是男性则必定是女性。当然，可能读者会认为这是钻牛角尖，但不得不说这的确是题目表述的问题。另外，如果用$Bayes$公式计算，即把有几个女生看成有一个女生的结果，算出来的结果是$\\frac{1}{7}$！还有一种令人震惊的解释方法，我们知道一个人是不是男性和他本身是不是男性是独立的，不管我们知不知道，一个人是男是女在出生的时候就定下来了，因此概率应该是$\\frac{1}{8}$，和观察到的无关！ 我给出的评价是，做题不能钻牛角尖，这种题目老师很显然不是让我们考虑这么多因素的，但是$Bayes$公式的计算方法看上去没什么毛病，而且由于该公式也在考纲范围内，我不否认这种方法的合理性。但作为一个正常人，理应是这个思路。 另外，有几道证明题也有小陷阱，例如$P(A-B) \\neq P(A)-P(B)$，因为只有当$B$包含于$A$时才成立，这是利用的测度的性质，只有当集合不交的时候，概率才有可加性。 纵观本张试卷，计算题固然有表意不明的情况，但如果按照正常的理解方式和逻辑，还是能够做对的；证明题属于是看上去简单，但是会有小陷阱和小坑，此时就考察平时学习的严谨性了。因此，重在平时啊！","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"数学学习的理想环境","slug":"life-64","date":"2023-04-20T11:11:34.000Z","updated":"2023-04-20T11:48:15.440Z","comments":true,"path":"2023/04/20/life-64/","link":"","permalink":"https://nju-kevin.github.io/2023/04/20/life-64/","excerpt":"","text":"下午的讨论班延迟了，从而我有了多上一节离散数学课的机会。这学期由于周四的讨论班，我还没有完整地听过一整个下午的离散数学课，以往只听一节，感觉听不出什么名堂，今天由于期中考试，来上离散数学课的同学也不多，所以座位也很宽松，加上教室打了空调，因此格外舒适。人少有人少的好处，我坐在前几排，更能够听清，看清孙智伟老师的板书，进而跟上老师的思路。我发现今天的课我突然能够领略到孙智伟老师的讲课特色以及离散数学这门课的趣味性了。今天离散课把图论部分收尾，舒适的学习环境，安静的课堂，生动的讲述，让我对离散数学，尤其是课上讲的图论，集合论部分有了浓厚的兴趣。其实，之前一直觉得无聊只是因为没有花时间去了解，只是课后翻翻书当然不会有什么趣味，但课堂上听课让我深刻体会到了这门课的魅力所在。事实上，离散数学，亦或是组合数学，都是看上去、听上去容易，但做起来尤为困难。比如著名的四色定理：用四种颜色就可以制作世界地图。这个命题即使是不懂数学的人也能听懂，明白这个命题讲述的事情，然而它的证明确实极其困难的。 说到这里突然想到了张高飞在网上写的，如果不会微积分，那么可以去学组合数学，只需要用中学的知识就够了。当然这只是调侃，现代的组合数学早已不是那么初等（不过即使是初等也有很多目前还没证出来的看上去“简单”的命题），概率论在组合数学中也会有应用，并衍生出了随机组合等等。可见，数学中任何一门学科都不存在什么贵贱优劣，有些学科看上去简单，概念也不复杂，反而难以攻克。 很多人都很喜欢听孙智伟在课堂上讲的一些故事，这些故事涵盖面很广，有的是数学家的故事，也有一些他遇到的“民科”的故事，或者是他之前到世界各地访问的经历，通过这些内容的介绍，一是能够培养学生的兴趣，二则能够让我们从前人的事迹中学到一些精神。 我很喜欢的一种学数学的氛围，就是在炎热的夏天，坐在空调房间里，温度舒适，座位宽敞，有一些学生，讲台上有一位老师，学生与老师一起探讨数学。我认为这样的画面是学数学的理想环境之一，这听上去就十分令人神往，更不要说身处其中了。我想这也是很多人热爱数学，坚守的原因之一吧。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"十九周岁生日快乐","slug":"life-63","date":"2023-04-19T05:39:59.000Z","updated":"2023-04-19T06:50:29.296Z","comments":true,"path":"2023/04/19/life-63/","link":"","permalink":"https://nju-kevin.github.io/2023/04/19/life-63/","excerpt":"","text":"今天是我的十九周岁生日，按虚岁的说法，虚岁也二十了。早上我的好朋友在图书馆送给了我生日礼物，是一套拜仁周边：一件本赛季客场球衣，印号42号穆夏拉，一块拜仁手表，一沓拜仁球星卡。说实话挺意外的，虽然我之前也和她聊过一些足球，但是没有想到她内心里也悄悄记下了。事实上我一直挺希望有一些拜仁周边的，毕竟关注这个球队也很长时间了，当时圈粉就是因为看中球队的历史，球队的精神，球队的优秀。因此收到这个礼物属实是尤为感动。最近一段时间，球队也是陷入了低谷期，然而我不是冠军粉，不会因为陷入低谷就脱粉，正如众多球迷所说的，“赢了一起狂，输了一起抗”。 实际上，这世上很多事情都是相通的，球队会有高峰期，低谷期，学习生活又何尝不是呢？任何结果的发生都是有原因的，或许很多时候结果可能不能全由我们自己决定，但主动权永远是在我们自己手上的。因此，我想结合我目前的思考与价值观，对十九岁的我提出几点关键词。 我对于十九周岁的我提出的第一个关键词是：积极自信。对于这个词的含义，我的解读是，对自己的能力有着充分的自信，同时心态健康乐观，思想积极，有充足的求知欲和进取欲，追求自身的全面发展。第二个关键词是，坚定钻研。我给出的解读是，自身的信仰，方向坚定，不轻易被外界影响，坚定自己的路线，走自己的发展道路；同时对自己的方向进行深入钻研，不怕吃苦，不怕困难，不被阻力所阻拦，更不能放弃。第三个关键词是，谦虚灵活。这里谦虚有两层含义，一是做人谦虚，说话谨慎；二是虚心向同学老师请教，多与同学老师交流，而灵活则是指注重方法，提高效率，提升思维的灵活度。 可以说，上述这三个关键词以及内涵包含了我目前的生活观，学习观，人生观，价值观。再次祝我自己十九岁生日快乐，也希望我不断提升自己的水平和境界，日后闯出自己的一番天地。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"忘忧草","slug":"life-62","date":"2023-04-18T12:44:52.000Z","updated":"2023-04-18T13:29:00.524Z","comments":true,"path":"2023/04/18/life-62/","link":"","permalink":"https://nju-kevin.github.io/2023/04/18/life-62/","excerpt":"","text":"最近很喜欢听周华健的忘忧草，既是喜欢它的旋律曲调，也是喜欢歌词。“让软弱的我们懂得残忍，狠狠面对人生每次寒冷”。生活真的是一个随着时间变化的函数，每个人也都有高峰期和低谷期，如果我们把出生和死亡算成零点，并且不妨认为这是一个连续函数，那么这个函数形成了$C_0(X)$，即所有$vanish at infinity$的函数，它是$C_c(X)$赋予$L^{\\infinity}$范数而得到的完备化空间。由于这不是我今天主要想说的部分，因此上述关于空间的完备化只是提一嘴而已。 对于我个人而言，能很明显地感受到生活的二重波动性，第一重是每个人自己的境遇，这是外在的环境所决定的；第二重是每个人的内心的心态，心态会波动，而且这个波动性与环境的波动性是紧密相连的。环境的好与坏能够影响个人心态的好坏，反过来也是这样，一个人的心态还会对今后的境遇造成影响，这二者是有着相互牵制的。 为什么会想到这个事情呢？今天晚上在图书馆做作业，做完作业之后又看了下两门期中考试的往年卷，大概熟悉一下主要的考点。事实上这件事我之前就干过，但看得并不是很仔细，我生怕有遗漏，因此又认真地看了一遍。我发现有一种现象：即使是我平时学的很认真，基础也不错，但准备考试时仍会有不自信的体现，总觉得复习得还不够全面。当然这一方面固然是对于考试很重视导致的，另一方面也是由于之前当我认为考试对我而言不算难事，有些“自大”，藐视考试的时候，我会发现事实上有许多基础内容都被我忽视了，之前也有过这方面的教训，这也是很重要的一个原因。 后来我仔细想了一想，这种“自大”应该放在战略上，正如袁小建所说：“战术重视，战略藐视”，即准备的时候一丝不苟，抓好基础，心态上学会藐视，不要被区区考试影响心态或是过度紧张。因此我对于我目前的状态进行了分析，首先，通过样卷，我发现我的水平是远远在往年卷之上的，从而不论今年的期中试卷题目是难还是容易，我有这个能力完成得很出色；其次，对于基础知识，由于平时学习并没有马虎偷懒，半学期所讲的内容我都有一个不错的掌握；最后，对于具体的重要定理及其证明，可能有些许淡忘，这是我需要强化的，很多时候由于定理很多，有些定理用得少就会生疏，因此这是我需要在复习的时候加强的。 针对上述对于自身的分析，我还需要做的工作是：用脱稿推演检验自己基础知识和定理证明的掌握程度；通过适量的题目进行练习。 值得一提的是，这几天我在复习的同时，拓展工作也没有停下，从而保持了学习的连贯性，有利于不断加深对于问题的认知与理解，并为将来的“降维打击”迈出坚实的一步。 虽然现实世界中没有真正的“忘忧草”，但我们每个人的内心里都有一株忘忧草，那就是不断在生活出现波动（尤其是下坡路或者是瓶颈）之时给我们自信和力量，短暂地忘却一切烦恼，过好当下，做好当下的每一件事。很多时候力量不是靠别人给予的，而是靠自己的内心，来自于内心的力量也是最坚定的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"折戟之后的总结","slug":"life-61","date":"2023-04-17T08:31:59.000Z","updated":"2023-04-17T08:53:07.921Z","comments":true,"path":"2023/04/17/life-61/","link":"","permalink":"https://nju-kevin.github.io/2023/04/17/life-61/","excerpt":"","text":"今天继续复习期中考试的内容，到傍晚，复习工作大体已经结束，剩下的工作是通过周二周四的课堂上把教材内容再过一遍，考前把基础性的内容再记记牢固，期中考试对我来说应该还是不成负担的，毕竟也可以说是“身经百战，久经沙场”了。 闲暇之余在知乎上看到了阿赛的民间解答，发现有人认为本次题目不难，并且大题目中有两道都可以照搬一些学术文章，论文上的成果；又看了下选择题的解答，发现选择题做的不太好，可能是有些题目没能理解到底是什么意思，亦或者是算错了。总之，合理预估这次折戟了，但通过这个周末的竞赛，其实我也收获了不少东西。第一，通过这次竞赛我也真正意识到，预赛有很大部分都是考察的“信息搜索”能力。网上看到好多人能够搜出题目的背景，我在做的时候也去捜了，但为什么别人能够搜到是某一篇博士论文的内容，而我的搜索工具和渠道却很少，这是我需要思考的第一个问题；第二，这次有一些题目考察的是最优化方法，或者是解微分方程，事实上这些都可以用编程软件让电脑去算，而由于我对于这些软件并不熟悉，导致我只能用手算，估计的方法，使得判断不是那么准确；第三，通过这次竞赛我也体会到了解题方法的多样性，和平时的考试不同，由于时间比较充裕，所以我有更多的时间对某个问题从不同的角度去思考，例如我尝试用概率的方法做高等代数题，虽然最后还是没有做出来，但很感谢阿赛让我有了这么一个机会去从不同的角度思考题目，这放在平时是我从来没有想象过的事情。因此，虽然此次折戟，但我一定不是空手而归，我也将继续以谦虚的姿态对数学进行更深入的探索，即使中途遇到许多阻力，也能够坚持下来，因为热爱和兴趣是原动力。 复习完了以后我继续把$RCA$复分析已学的内容过了一遍，对于某些问题的理解又有了新的认识，知识就是需要这样的反复参看，不同的时期，不同的能力，不同的心境，对于特定事物都能有不同的理解，考试与竞赛不是目的，是一种检验，更是一种动力，助推我不断前行。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"以谦卑之心遨游数海","slug":"life-60","date":"2023-04-16T13:05:11.000Z","updated":"2023-04-16T13:48:39.876Z","comments":true,"path":"2023/04/16/life-60/","link":"","permalink":"https://nju-kevin.github.io/2023/04/16/life-60/","excerpt":"","text":"今天上午把阿赛的大题答案提交了，三道大题有两道的最后一小问不会，因此也可以说是做出了个七七八八。本次参赛所有的题目我都进行了充分的思考，有没有做对倒显得不那么重要，如果能进入决赛，那么我也会认真准备决赛；如果没有进入决赛，我也会继续信心满满继续向前走。之前对于竞赛的结果看得十分重要，认为它能够影响我的保研升学，但现在我的看法是，竞赛能够成为自己的招牌，名片，进而影响升学，这固然是对的，但重点不应该放在其功利性，而是通过竞赛我能对于我所学进行检验，并同时开拓视野，提高对于数学的看法和认知。 今天下午以及晚上把概率论和复变函数复习了一下，事实上由于我平时学的比较认真，因此复习起来还是很快的，准备期中考试应该打好基础，把基础性的内容巩固强化。不过也发现最近内心会有自傲的心理，认为自己很厉害，学了好多东西，对于看上去基础的知识有些不屑一顾，我认为这是需要及时调整的，生活就是会给那些狂妄自大的人以沉重的打击。果不其然，复习的过程中有同学问我往年卷上以及另一个老师使用的教材上的题目， 我发现我还并不是很会做，这也反映了虽然我已经学了很多内容了，但不能因为自认为学得多就胡妄地认为我水平已经很高了（即使真的是这样）。因此我应该时刻保持着谦虚的姿态，放低自己的位置，保持自信而不能自负。数学这个领域的内容是永远穷竭不完的，我们能够做的是不断提高对其中部分我们感兴趣的内容的认识，通过不断的学习，做题，考试等等以提升我们对某一个领域的了解，想要研究透彻或是理解地深刻都是不容易的。因此我应该及时祛除蠢蠢欲动的架空心态，脚踏实地，放低姿态，潜下心来不断探索，真正把重要的定理与知识理解透彻，在学习更深入的知识的同时，也要注意与课内的联系，切忌好高骛远，把自己的知识体系建立牢固，不同概念的关系理理清楚，做一个谦虚的求学者。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"阿赛初体验","slug":"life-59","date":"2023-04-15T11:47:04.000Z","updated":"2023-04-15T12:12:33.534Z","comments":true,"path":"2023/04/15/life-59/","link":"","permalink":"https://nju-kevin.github.io/2023/04/15/life-59/","excerpt":"","text":"今天是阿赛预选赛第一天，也是我第一次参加阿赛，因此算是第一次试水。预选赛一共48小时，可以中途退出，也可以查阅资料或者使用编程软件。在$ChatGPT$大火的年代，对于这样与开卷差不了多少的竞赛方式，竞赛试题的质量则显得十分关键。本次预选赛一共七道题，四道选择题，三道大题，这七道题都不简单，选择题由于都是不定项选择题，并且考察的有高中数学竞赛的味道，与生活贴合地很紧密，题目的模型也十分有趣，但都不是容易的题目；三道大题更是如此，一道矩阵题，一道数学分析题，一道概率题，这三道我尝试让$ChatGPT$做，不出我所料，虽然它洋洋洒洒写了很多，但我发现，它提供的三个解答都是完全错误的，可以说是在“一本正经地胡说八道”。可见$ChatGPT$虽然功能强大，但对于上了难度的数学题，也只有瞎扯的能耐。 今天这一天的进度是，把四道选择题“大致”做出来了，然后三道大题做了两道左右，明天大概是一些修修补补的工作。虽然说两道题考的是数分高代，但所涉及的背景应该不止，据我的理解，数学分析考的是所谓的“等分布”（$equidistribution$），高代虽然考的矩阵形式也很简单，为各个元素为$0$或$1$的矩阵，但即使是这样简单的矩阵，研究它的行列式的取值仍是困难的，这也符合数学中的普遍现象，即越是看上去简单的命题，越是难以研究清楚。 第一次试水，我认为阿赛的题目确实做到了数学的趣味性以及美妙性，从生活中的具体的例子出发，体现了数学在实际生活中的应用，同时也不失难度，也能起到选拔的作用。我认为参加这样的竞赛是有益的，能否进入决赛或者能否拿到名次已经不重要，重要的是享受这个过程，体验数学的美。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"关于$Borel-Cantelli$定理","slug":"life-58","date":"2023-04-14T10:24:09.000Z","updated":"2023-04-14T12:10:54.074Z","comments":true,"path":"2023/04/14/life-58/","link":"","permalink":"https://nju-kevin.github.io/2023/04/14/life-58/","excerpt":"","text":"今天白天花了不少时间做$Durret$的关于$Borel-Cantelli$的课后习题，通过这次练习我终于算是明白$Borel-Cantelli$定理所发挥的作用，对于随机变量的依概率测度收敛和几乎必然收敛有了更加完善的理解。 对于这二者的关系，其实很清晰。如果一列随机变量依概率测度收敛，用概率的语言表述就是 P(|X_n-X|>\\epsilon)\\to 0而如果一列随机变量几乎必然收敛，可以表述为 P(|X_n-X|>\\epsilon\\space i.o.)=0而由$Borel-Cantelli$定理，上式当 \\sum_{n=1}^{\\infty}{P(|X_n-X|>\\epsilon)}","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"近阶段任务梳理","slug":"life-57","date":"2023-04-13T11:23:58.000Z","updated":"2023-04-13T13:35:12.443Z","comments":true,"path":"2023/04/13/life-57/","link":"","permalink":"https://nju-kevin.github.io/2023/04/13/life-57/","excerpt":"","text":"近阶段即将进入期中考试阶段，事情也比较杂，因此我认为有必要进行一个任务的梳理。我将对最近的时间分段进行介绍。 今天完成的任务今天下午和晚上，利用讨论班和在图书馆自习的时间终于把李炯生的那本线性代数的内容梳理完了，这一遍的梳理我侧重在基本概念以及观点上，从多项式理论，行列式，矩阵，到线性空间，线性变换，$Jordan$标准形，$Euclid$空间，酉空间，双线性函数，对于$Jordan$标准形理论终于是弄清楚来由了，对于正定矩阵，正交矩阵，酉矩阵，$Hermite$矩阵的概念以及性质也从一开始迷迷糊糊到形成了较为清晰的认识。之前所计划的在阿赛之前对于数学分析和高等代数的基础知识的梳理目前已经完成。 明天的任务在阿赛正式开始之前，明天还有一天的时间，基础的准备工作都已经做好了，因此我的安排是学习高等概率论和$RCA$复分析。虽然明天下午由于老师有事不上复变课，但仍是得抽出时间对复分析进行加深学习，因为下周五晚上考完概率论后周六下午就要考复变，因此届时是没有充足的时间进行复习的。 期中考试周的任务这周末参加阿赛，虽然比赛时间有48小时，但很显然不可能做两天的题目，因此这周末除了参加比赛还是可以安排时间进行复习或者深度学习的，届时可以根据答题情况进行调整。不过由于下周就是期中考试周，因此暂时以复习优先。概率论和复变复习的方式是看PPT（如果有的话）以及看往年卷熟悉考题风格和侧重点；离散则参看学长整理的笔记，需要重点强调的是，由于离散花的时间尤其地少，因此需要比较多的时间进行复习，并且趁早复习完毕。 丘赛前的任务按计划，在考试之前要把复习工作完成，因此在复习工作完成之后，便可自动进入准备丘赛的阶段（不论考试是否考完）。准备丘赛自然不是一朝一夕的事情，因此这段时间更像是一个对已学知识的总结并同时继续学新知识的过程。这个阶段时间并不长，大概只有十天左右，但有几件事情是需要完成的。 第一，复习$RCA$整本书。由于复分析部分还有些许专题没有学习，但大体都已经学完，因此复习便成了极其重要的一环。考虑到平时我也在常态化复习中，并且第一遍学习并不只是抄一遍书，也结合不同的书籍有了些自己的思考，因此复习起来也不会过于困难。这轮复习并不是要求事无巨细，把每个定理的证明扣得很细，而是要抓住定理证明的思路，看问题的视角与观点，以及对定理的使用（这便体现在习题方面）。在考前做完$RCA$上的习题是不现实的，我也不打算为了做完而去赶进度，还是按照每周一章课后习题的量（考试周等因素可能导致做不完，则机动进行调整），主要是通过课后习题学会定理的使用方法，并储备一些例子，方便考场上对自己的猜想进行验证，顺带学一些新定理。 第二，学习$Soblev$空间。听老师说丘赛比较喜欢考这个知识点，由于我之前没有对这块内容进行过多的了解，因此只需要对于该论题有一个基本的认识，知道一些基本性质与定理即可。 第三，整理秦理真泛函分析讲义。这学期秦理真的泛函分析课的讲义内容丰富，并且许多地方都能体现出泛函的特点与本质，因此对该讲义进行整理有助于提升对于泛函分析的理解和掌握程度。 以上三点是我认为准备丘赛很重要的事情。至于微分方程部分，常微分方程上学期刚学过，而且我平日里闲暇之余也会看这部分的内容，不至于忘得很干净，因此考前再把之前的笔记翻一翻即可。据我去年参加的经验看，微分方程的考题占比并不大，重点必定是在于实分析，复分析和泛函分析的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"难念的经","slug":"life-56","date":"2023-04-12T12:40:07.000Z","updated":"2023-04-12T13:35:23.838Z","comments":true,"path":"2023/04/12/life-56/","link":"","permalink":"https://nju-kevin.github.io/2023/04/12/life-56/","excerpt":"","text":"今天一个好朋友身体不舒服，腹泻胃胀恶心，一天也没怎么吃东西，上午陪着去校医院看了看，抽了个血，配了点益生菌，不禁感叹生活真是本难念的经。每个人都会遇到很多事情，不仅仅是学业、事业上的困难。很多时候都会发现，很难有一段时间能过上事事顺意的生活。虽然这是很常用的祝福语，然而可以说人人都无法一直过上事事顺意的生活。但这就是生活，他可能会给你一些小甜头，让你某一段时间产生某种事事顺意的感觉，当你认为生活会一直保持现状下去的时候，又会带来一些变数，使得沉浸在美梦中的你突然醒过来面对残酷的现实。当然，变数或许无法让我们一直过着开心的生活，却也能避免我们一直处在人生的低谷。从这方面来说，变数也是很必要的，否则一旦不小心掉下悬崖便再无爬上来的可能。 最近即将进入期中考试周，我也相应地针对性进行了一些练习。白天在图书馆的时间一直在做$Stein$第三章的课后习题。关于留数定理有很多计算，之前没有做过多少相关练习的我一开始也确实有些吃力，但无非是熟能生巧，而且我校的复变老师出卷也出不出一些有趣的或者是背景深刻的题目，倒是有可能把重点放在如何计算上，因此针对性地做些练习还是很必要的。除了计算，第三章还有部分对于一些性质，奇点的证明题，我认为关键在于把握证明的思路。$RCA$上也介绍了很多更强的定理，而我需要将这些定理内化为自己的理解，而不是生搬硬套。事实证明$RCA$上的许多定理的证明其实就蕴含了很多常用证明的思路，而那些定理的结论对于某些特殊的证明题亦能构成降维打击，这也是我推崇$RCA$的原因之一。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"刀剑如梦","slug":"life-55","date":"2023-04-11T12:23:19.000Z","updated":"2023-04-12T13:25:50.079Z","comments":true,"path":"2023/04/11/life-55/","link":"","permalink":"https://nju-kevin.github.io/2023/04/11/life-55/","excerpt":"","text":"今天概率论课上，我学习了强大数定律（$Strong \\space Law \\space of \\space Large \\\\space Numbers$），并发现相较于弱大数定律，“强”在了两个方面：一个是条件减弱，随机变量独立减弱为两两独立，原本对于每个随机变量在无穷远点上概率的控制变成了期望小于无穷，这两点是条件的减弱；另一个是结论的加强，由一开始的依概率测度收敛加强为了几乎必然收敛（也就是实分析中的几乎处处收敛）。弱大数定律的证明就是通过截断（$truncate$），而强大数定律则是通过找一个子列收敛，然后再对子列没有包含进去的数进行上下界估计。但我课上一直在想一个问题，那就是为什么可以加强为两两独立，而其他命题里都没有加强为两两独立，都是直接说$i.i.d$（即独立同分布）这里的独立都是指$n $个相互独立，是比两两独立更强的条件。这个问题我想了两节课也不太明白，因为需要用到独立条件的就是切比雪夫（$Chebyshev$）不等式，难道说由于使用切比雪夫不等式只需要用到两两独立就够了？ 中午下课后我询问了老师，老师在思考良久后表示之前没有思考过类似的问题，但是$Borel-Cantelli$定理是可以加强为两两独立，甚至加强为负相关的，强大数定律能不能加强到两两独立暂时没想过。不过这次提问也不算是空手而归，因为老师证明了弱大数定律可以直接用两两独立证出来并且在黑板上也写了下，同时还告诉我$B-C$定理可以加强为负相关的随机变量，也算是对于这些定理的理解加深了一层。 学习正如磨刀锻剑。一开始我们可能只是按照我们脑中所想造出个雏形，等真正细化之后就会发现有各种各样的问题，打磨的角度，淬火的时间，锻造的力度等等。如果一直没有发现有什么问题，整个过程尤其地顺利，那么即使看上去很光彩，也是不经用的，或许砍个竹子就要卷刃了。凡事都是需要时间，正如工匠锻造，时间不够，温度不够，最终的结果会天差地别。学东西的时候不求甚解，看上去好像都懂了，实际上其实啥也不懂；而那些自称已经懂了的人，懂的程度也会有很大差别，花的时间、精力不同，学出来的效果也会不同。而所谓的考试与竞赛，其实就是试刀的场合，这个时候，有的人没有工具，徒手上阵；有的人平时偷懒，此时发现自己的工具过于钝，没有尖锐的工具；有的人的工具看上去光泽一等，却和那些钝器一样，不耐用；还有的人的工具看上去朴实，却很锋利，用途广泛，兵来将挡水来土掩。这之中的差别，则不仅仅在于平时的用工和储备，更在于对于数学的理解与观点。 目前为止，我对于高等概率论的学习还都算顺利，并且也很真切地感受到实分析基础打牢对于概率论学习的帮助。看完$RCA$后，不管是高等概率论中对于实分析的应用也好，还是实变函数也好，理解上都不觉得有多么困难，或许是因为接触了更本质的内容吧。 只见左手拿刀，右手握剑，挥之于无形，恍如梦中。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"数学学习中的趣事（一）","slug":"life-54","date":"2023-04-10T08:52:38.000Z","updated":"2023-04-10T09:08:00.039Z","comments":true,"path":"2023/04/10/life-54/","link":"","permalink":"https://nju-kevin.github.io/2023/04/10/life-54/","excerpt":"","text":"数学是一门很有趣的学科，也有很多有趣的事情，因此我想通过这个系列简单介绍数学学习过程中我遇到的一些有趣的事情。 由于$RCA$实分析部分已经完结，最近复习硬分析的同时也将新内容放在了软分析（主要是泛函分析上）。讲泛函分析的秦理真老师比较年轻，上课风格轻松活跃，声音大，语速快，不管是上课还是走路都给人一种大大咧咧的感觉。而他写的泛函分析讲义却挺有古代人（或者说是近代人）的味道，不管是语句的串联也好，还是对于数学本质的解读，很有老师傅的味道，尤其是今天看到讲述赋泛空间外直和与内直和不同构时出现的反例时，秦理真用“青山隐隐孤舟微，白鹤双飞互相见”来形容这一反直觉的现象，突然给人一种形象新奇之感。 一开始上秦理真的泛函分析，还不太能得到要领，也不知道所谓的“软分析”“软”在哪里。现在我大概能够明白这种感觉了。很明显，泛函分析研究的所谓赋泛空间，$Banach$空间中，既有几何拓扑结构，也有代数结构（也就是线性空间），增加了代数结构之后，使得泛函分析研究的类似对偶等概念多了代数的味道，而不仅仅是实分析里测度论，运用分析的手段研究收敛性，研究可微性等。因此我认为之所以软是增加了代数结构，当然这里的代数只是最基础的高等代数，严格意义上来说还不算真正的代数。 一下贴几段南京大学张高飞老师写在博客里的话，虽然是很久之前写的了，但如今读起来仍很有趣： 加强： 您好！本周三在班车上我们聊的很愉快。其间您告诉我去年尤老师被评为最受学生欢迎的老师。 您说对于这件事情我们两人要好好反思一下：我们都是给大一上数学分析课的，可为什么我们两人都没有获此殊荣。回来之后我仔细的思考了这一问题。 现把我自己的想法总结如下。仅供您参考。 就对教材的熟练程度上，以及解题能力上，我想尤老师都无法与你我相比。尤老师自己也说，他在大学时成绩很差，只是到了大四成绩才一下子好了起来。可我们都知道，本科大学的第四年除了一些音乐，美术之类的基本上就没什么主课了。而数学分析课是大一大二开的。可想在三十年以前尤老师就没有学好这门课程。而你我则不同。如同我们的名字一样，你我都属于那种志向高远，精益求精的人。讲数学分析这种基础课程，我俩自然都是驾轻就熟，游刃有余。 说到这里，您自然会问，既然如此，那为何尤老师讲的课最受学生的欢迎呢？这其实正是问题的关键所在。 尤老师深知自己对这门课程掌握的不够火候，因此他讲课时只讲那些自己有相当把握的。 比如凡是证明过程超过十行的，尤老师都留给习题课上讲。凡是计算中间需要技巧的，尤老师就循循善诱的告诉大家，他在课上主要讲思想，这些技巧上的东西就留给习题课上讲吧。如此一来，尤老师的课不仅讲的轻松，学生听的也轻松。就连工科毕业的辅导员杨靖在听完尤老师的课后，都感慨的说：原来数学系的数分课比她们当初学的大学数学容易多了。当然尤老师有时也会小试牛刀一把。比如有的同学会在课间休息时请教课后的习题。在确信自己有十足的把握拿下该题时，尤老师总会毅然走上讲台，奋笔疾书。每当这种时刻，重修的同学都会背起书包，悄悄离开了教室。因为他们知道在接下来的一节课，尤老师会一直专注在这道题上。直到下课铃声响起。 然而让尤老师在教学上取得极大成功的却正是他的这种教学风格。几乎所有同学都觉得尤老师讲课思路清晰，浅显易懂。就连那些入学时被调剂到数学系的学生都对数学产生了极大的兴趣。特别是当他们目睹了头顶无数光环的尤老师在一个并不很难的问题上久攻不克时，更是信心倍增。尤老师的课与其说是一堂数学课，倒不如说是一堂励志课。大家都凝视着尤老师，对自己的未来充满了梦想。 然而在大一的第二学期所有这一切都变了。你教一班，我教二班。你我讲课行云流水，面面俱到。大多数同学都不能当堂消化所讲内容。而你不时在黑板的角落处写下的思考题，好多人学期结束时也没做出来。上学期大家都觉得自己是天才，这学期似乎还不如普通人。前后对比，尤老师与我俩形成了鲜明的对比。在埋怨你我的同时，大家更加想念那个能让他们自信满满的尤老师. 而恰好此时，学校开展了评比活动。结果可想而知。据杨靖告知，在抽查的120人中，有116人把票投给了尤老师。有3个人投票给我。他们都是我河北老乡。只有一人投了你一票。但那个人不是你的湖北老乡。因为你从来没告诉大家你是湖北人。那个人是辅导员杨靖。她知道你一向工作很认真，怕你一下子接受不了。 好了，加强，就说这么多吧。我们都还年轻。只要我们好好努力，未来还有好多机会。希望就在前方。 此致敬礼！ 高飞 正如大家所知，代数几何是现代数学的主流。当代大多数一流的数学家都工作在这一领域。因此如果你觉得自己天赋异禀，并在代数，几何与分析各方面都有着扎实的基础，我建议你绝不要浪费自己的天赋：应义无反顾的选择代数几何这一专业。当然把代数，几何与分析这三门基础功课同时学好的人很少。比如有些同学有着很好的 分析功底，但代数中的抽象思维能力却相对显得薄弱。如果是这样的话，我建议你选择分析方面的专业，比如：复分析，分形， 调和分析或微分方程。如果你代数和分析都不怎么样，可却在几何方面有着良好的感觉，要是这样的话，我建 议你应和梅加强老师好好探讨一下。让他帮你判断一下看自己是不是可以学习几何。除以上三部分同学之外，还有这样的一部分同学：他们对代数，分析与几何都不擅长，但却一直坚信自己在数学上仍能有所作为，并幻想有朝一日成为中国数学界的中流砥柱。如果你属于这部分同学中的一位的话，我建议你选择动力系统。动力系统这一学科其实就是专门为这部分同学开设的。当然即使是动力系统也不是人人都能学的。因为动力系统需要大量的微积分。可总有那么一部分同学还没来得及把极限的概念搞清楚就大学毕业了。如果你不巧就是这样的一位同学，也就是说你大学四年压根儿就没学数学，但仍希望自己将来能在数学上一展宏图的话，我建议你选择组合数学这一专业。这一专业的特点就是它只用到中学的数学。 如果你在中学时参加过数学竞赛并获过奖项的话，这一学科正是你大展身手的地方。我想大多数同学看到这儿之前已经找到了适合自己的专业了。可若仍有人羞怯的说他在中学时早恋，因此连中学的数学也没学好，我想告诉这部分同学不要怕。在我们系有专门为你们开设的一个专业：统计学。这一学科只要求懂得小学数学中的加减乘除四则运算就够了。 更重要的是，选择这一专业的大多都是女同学。在你准确无误的把成千上万个数据加起来并娴熟的计算出他们的均值时，你也赢得了众多师姐师妹的芳心：短短三年的研究生生活或许能让你再次体会一次那如花美眷，似水流年的往事。。。最后这一条是专门针对那些悲情人物的。他们连小学的数学也没学好。不要说把上千个数加起来，就是把两个数加起来，对他们来说都是件很吃力的事。然而这一切丝毫没有削弱他们对数学的一片痴情。他们日日夜夜泡在图书馆里。他们翻阅了所有的数学文献，却从未找到一本能读懂的。 但他们仍坚持不懈， 为的就是找到一个适合自己的专业。他们的行为感动了上帝。上世纪的某一天，上帝为他们创造了一台机器帮他们计算。这就是计算机。借助计算机，他们可以很快的进行加减乘除的运算。这就是计算数学。 （写给近代数学孙智伟老师）我年轻时向您现在一样。喜欢在众人面前表现自己是多么多么的超人一等。可当我发觉自己本来很茂密的头发随着岁月的流逝一把一把的脱落时，我的内心逐渐成熟起来。我变得低调，淡定，谦虚而且内敛。这就是现在的我。 我觉得孙老师您虽在学术上堪为全系人的典范，可在为人处事上应向我学习啊。 （黑数学系主任尤老师）尤老师除了训练的很刻苦之外，还请人买了很贵的球拍，同时从网上下载了教学录像来纠 正自己的动作。尤老师的心中有一个梦想：就是希望有一天能够得到大家的认可，从而名 正言顺的加入到我们系的高手俱乐部。因为尤老师是主任，所以汪老师，朱老师他们和尤 老师比赛时总打假球。有时故意回一个很高的球，等尤老师把球扣过来时再大声喊“好球 ”！有一次刚把球回过去，就开始喊“好球”。结果尤老师一拍子把球抡在了网子上。我 在旁边实在看不下去了。就说：“尤老师，他们是说这颗球是刚买的，是个好球”。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"礼拜天晚间时刻（四）","slug":"life-53","date":"2023-04-09T11:58:40.000Z","updated":"2023-04-09T12:39:01.673Z","comments":true,"path":"2023/04/09/life-53/","link":"","permalink":"https://nju-kevin.github.io/2023/04/09/life-53/","excerpt":"","text":"今天晚上原本以为有讨论班，结果到了教室发现一直没人，问了同学才知道今天没有讨论班。原本打算讲一讲$RCA$实分析第三章的关于$L^p$空间的一些经典结论，结合一些课后习题，这部分有着很丰富的内容，尤其是我白天把第六章的习题做完后，与复测度中的一些定理结合能得到一些对偶的结论。既然没有讨论班，我便回图书馆继续学点复分析，不过可喜可贺的一点是终于把一直没能弄懂的一个事情弄懂了，就是$S^2$中的一个例子，我之前一直想不通为什么，今天晚上问了一个同学，他也没想明白，并且他最后得出了错误的结论，但我在这个过程中却把这个例子真正想明白了。这也是数学奇妙的一点，和同学讨论的过程中，或许同学最后也没能搞清楚，但这个过程能够促使我自己去思考，可能这个时候就能想通。这个例子我想了几个礼拜了，虽然我知道它应该不难，图我也画出来了，却一直想不明白。直到今天在一个同学的帮助下，我才搞清楚。 这个问题说的是，即使复平面上的一个开集在复平面中的补集不连通，但它在黎曼球面$S^2$上的补集有可能是连通的，也就是说，扩充复平面不能保持不连通性。$Rudin$举了一个例子，即考虑下述集合 \\{z:z=x+\\text{i}y, x,y\\in \\mathbb{R}, 0 \\leq y","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"对于$RCA$复分析部分两种观点的反驳","slug":"life-52","date":"2023-04-08T08:39:20.000Z","updated":"2023-04-08T09:14:27.090Z","comments":true,"path":"2023/04/08/life-52/","link":"","permalink":"https://nju-kevin.github.io/2023/04/08/life-52/","excerpt":"","text":"今天上午把这周的作业做了，然后在准备今天晚上的讨论班以及复习目前学过的$RCA$复分析部分。我之前也看到网上有许多人对于这本书的复分析部分做过评价，有些人认为复分析味道不浓，甚至有很多实分析的味道，也有人认为某些章节（例如最后两节）不是很重要，感觉用不到。这里我又想要反驳他们了。首先，我承认既然是复分析，那肯定得凸显出复方法的优点，但这不代表什么都要用复方法、不能用实方法。例如$Runge$定理，$Stein$上的证明使用的是很优美的复方法，通过积分曲线一步步把奇点推到正无穷去；然而$RCA$也提供了一种很令我惊讶的方法：运用泛函的观点看这个问题。其实，全体有理函数构成了连续函数的一个子空间，而如果一个全纯函数可以用有理函数一致逼近，说的就是这个函数在这个子空间的闭包里，那么我们就可以用$Hahn-Banach$定理的一个推论，只需要说明任意有界线性泛函如果将子空间的函数打到零，那么也将$f$打到零；再利用$Riesz$表示定理，泛函可以用关于一个复正则的$Borel$测度的积分表示，从而只需要验证积分为零，而积分的逼近将会容易许多。由上述例子可以看出，即使是一个复问题，也不代表我们不可以使用实分析的方法，实分析的观点去看这个问题。事实上，后来网上也有人说，这个定理其实本质上就是$Hahn-Banach$定理的推论的应用，可能原本就是从这里来的。 接下来，有人说最后两章内容没什么用，我一度也这么认为。直到我最近看了这两章的内容，才发现，怎么能说这两章的内容没用呢？第十九章讲了全纯$Fourier$变换，将之前实直线上的$Fourier$变换延拓到了一个特定区域里，而$Paley-Wiener$定理则给出了两类可以做全纯$Fourier$变换的函数并验证了其合理性。同时还对所谓的拟解析类进行了介绍，实际上就是告诉我们什么样的函数可以从实直线到复平面上进行延拓且保持特定的性质。第二十章主要是一个大定理：$Mergelyan$定理。这个定理在我之前的文章中也有讲过，是$Runge$定理的推广，构造性很强，不过也是上世纪五十年代的结果了，也可以说是老古董了。虽然这个结论看上去没什么，但构造的思想却是值得深入思考的，因此这两章蕴含的内容也可以说算是复分析的基础内容，哪里有无用的说法呢？","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"天地有正气，杂然赋流形","slug":"life-51","date":"2023-04-07T10:45:11.000Z","updated":"2023-04-09T02:31:47.481Z","comments":true,"path":"2023/04/07/life-51/","link":"","permalink":"https://nju-kevin.github.io/2023/04/07/life-51/","excerpt":"","text":"上了快半学期的《从微积分到上同调》这门课，学到了不少新的理论，见证了基础流形理论一整个建立的过程，也时常能够感受到不少小小的数学震撼。不过，今天倒是第一次让我认识到流形在复分析中的应用。今天复变课上高飞讲到了$Riemann$球面，这是复平面$\\mathbb{C}$的单点紧致化得到的拓扑空间，接着一个自然的问题便是，既然复平面上能够定义全纯函数，那么如何在$Riemann$球面上定义全纯函数？这里用的想法便是，选取球面上的一个局部坐标卡，也就是把球面看成一个三维空间中的流形，通过光滑坐标卡打到欧式空间中的开集上的函数如果全纯，那么球面上的函数就全纯。 事后想想这种想法是很自然的。一个高维弯曲空间上我们找不到横平竖直的坐标去做微积分，那么我们便可以把空间的局部映到欧式空间上，欧式空间上我们会做微积分，那么换到高维弯曲空间上我们也自然能做微积分了。那么具有这样的性质的（即局部可以和欧式空间同胚的）有可数拓扑基的$Hausdorff$空间就称作流形。此时突然想到一句话：天地有正气，杂然赋流形。流形（$manifold$）这个词翻译的真好，翻译者应该也是对于流形的理论有着充分的了解，能够发现它的某种“流动性”。这句话的意义，或许等我更深入地学习流形的理论之后，会有更清楚的了解吧。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"与师长的交流（四）","slug":"life-50","date":"2023-04-06T12:38:17.000Z","updated":"2023-04-06T13:33:34.547Z","comments":true,"path":"2023/04/06/life-50/","link":"","permalink":"https://nju-kevin.github.io/2023/04/06/life-50/","excerpt":"","text":"今天又是忙碌的一天，下课后，托着疲惫的身子赶向食堂，却发现我喜欢的菜品卖完了，水饺窗口也都要排队等候，于是我决定回宿舍吃点水果零食饼干打发一下。却不知，虽然在物质上，我没有吃到美味的食品，但我在精神上享用了一顿佳肴。 在宿舍吃饼干的时候，和范学长聊了聊关于未来方向的选择。起因是我最近在看$Rick \\space Durret$的概率论（简称$PTE$），想要咨询一下这本书适不适合，或者说，“好不好”。不过这个问题其实没有什么含金量，因为书好不好，正如东西好不好用，那自然是用过的人才知道。我最近在读这本书，目前认为这本书写得很不错，因此想要再向学长确认一下。事实证明，这本书的确是概率论入门的经典，这本书内容主要分为两部分：高等概率论和随机过程论，这是他们研一的教材，因此可谓十分经典。另外，我们还对分析学进行了讨论，主要是$Papa \\space Rudin$（$RCA$）和$Stein$的分析学教材进行了评价。范学长由于不是分析学方向，因而没有啃完这两本书，不过在得知我啃完$RCA$以后也表示了充分的肯定。我也告诉了他我对于分析学和概率论很感兴趣，他表示随机分析方向很适合我，这部分需要很深的分析功底，不过对于我来说应该是没问题的。同时，随机分析在金融学也有很多的应用，这部分应用范围较广，正好也符合我对于金融方面的设想，因此我认为这不失为一个很好的选项。范学长是做离散概率和随机几何的，对这方面不是过于了解，并让我以后可以多问问。 （以下是杜克大学$Rick \\space Durret$教授个人主页上的照片） 这次聊天可以说是让我进一步明确了方向。原本每周四都很劳累，上完一天的课有种知识快要溢出的感觉，然而通过这次聊天，让我脑中的思绪一下子清晰了不少，我也更明确了我需要些什么，以哪些内容为重点。值得一提的是，这次聊天与以往不同，这次聊天由于我个人的数学能力与水平得到了提升，因此谈论的内容也不再局限于具体的题目的解法。事实上，我认为这才是与学长交流的最佳方式，而不是拿一道题复制黏贴上去问怎么做。我们可以畅想未来的方向，也可以对不同的教材阐述自己的看法，也可以谈论数学教材中的思想，甚至吐槽学校课程的无聊。当两个人水平都达到一定的高度以后，看问题自然能做到“英雄所见略同”。在旁人看上去，两个吐槽数学课无聊的人或许只是平庸之辈，然而也有可能是因为在接触了更深入的理论以后对课程不够“$fancy$”而产生的感叹，这与大部分好高骛远，基础架空的学生有着本质的区别。以后的我如果回想起某一个傍晚，两个相距一千公里的有趣灵魂，通过线上网络进行思维的碰撞与交流；亦或是一个在宿舍里吃着干粮，思维却在数海中遨游，颇有“嚼得菜根，做得大事”之感的学生，或许也会很欣慰吧。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"$RCA$复分析部分的专题化学习","slug":"life-49","date":"2023-04-05T13:11:45.000Z","updated":"2023-04-05T13:49:28.483Z","comments":true,"path":"2023/04/05/life-49/","link":"","permalink":"https://nju-kevin.github.io/2023/04/05/life-49/","excerpt":"","text":"自从$RCA$的实分析部分学完之后，除了对实分析部分进行再次复习与巩固，对于复分析的学习也同时开展。不过，由于复分析的教材是$Stein$的名著，从而$RCA$的复分析部分我认为没有必要像当做教材一样研习，而是进行参考，$Stein$没有讲到，没有涉及的内容可以起到一个补充的作用。目前来看，$RCA$的复分析内容也是比$Stein$要深入的，可能是教材定位不一样，毕竟$RCA$是研一教材，很多$Stein$上的定理在$RCA$中都得到了加强，比如$Runge$定理，这是一个很美妙的结论，后来我查阅相关资料之后发现这个定理在1884年就被证明了，然而等到1951年才得到加强，这就是$Mergelyan$定理。$Mergelyan$定理的证明是高度构造化的。思路其实是沿用$Runge$定理。首先先找到一个紧集开邻域上的全纯函数$F$，利用$Runge$逼近定理可以知道$F$可以在紧集上被多项式一致逼近。然后再构造出一个平面上都连续可微的紧支集的连续函数$\\Phi$，这个函数到的作用是桥梁，它距离全纯函数有一个正的距离，但这个距离却可以任意的小，也就是一个“接近全纯”的函数，使得 |\\Phi(z)-F(z)| \\leq 6000\\omega(\\delta)|\\Phi(z)-f(z)| \\leq \\omega(\\delta)由于$\\omega(\\delta)$是可以任意小的，于是实际上$f$可以用$F$逼近，又由于$F$可以用多项式一致逼近（在紧集上），从而原来的$f$也可以用多项式一致逼近。这个定理加强的地方就在于$f$的性质，不需要在紧集的开邻域上全纯，只需要在紧集上连续，紧集的内部全纯即可（特别地，当紧集的内部为空集的时候，连续函数都可以用多项式函数一致逼近，这就是数学分析里的$Weierstrass$逼近定理） 这只是一个例子。$RCA$的复分析部分更加地专题化，每一章着力于解决的问题，阐述的定理很清晰，除了第十章内容十分繁杂（因为是复分析的基础知识），后面基本上每一章都有重点，因此通过专题化地学习，结合$Stein$的教材以及课外查找的论文和资料，我也能够对于每一块部分有一个较为深入的了解，我认为是大有益处的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"用心做每一件事情","slug":"life-48","date":"2023-04-04T13:16:30.000Z","updated":"2023-04-04T13:57:46.447Z","comments":true,"path":"2023/04/04/life-48/","link":"","permalink":"https://nju-kevin.github.io/2023/04/04/life-48/","excerpt":"","text":"这周杂事比较多。众所周知，杂事往往不难，完成它，或者是很好地完成它，不需要花多大的力气，这固然是杂事的一大好处，然而其缺点也是显而易见的并且无法摆脱，那就是杂事劳神。例如一次座谈会，一次答辩，亦或是处理一件事情，本身往往没有什么技术含量，但是需要时常记在脑子里，某个日子的某个时刻我需要到某个地方干某件事情。当然，这其实也靠自己调整，或许以后工作了以后也是常态，退休之前永远没有事情做完了的概念，总是一样一样事情清的。 今天中午在院楼进行答辩，个人认为效果不错，数学系的石亚龙老师参加了这次活动，问了我一个问题，我都能对答如流，其余几个不认识的老师，也在那里附和并频频点头。董昊副院长最后倒是提出了一个令我眼前一亮的问题：“我们这个项目是未来拔尖创新人才计划，请问你为什么符合这个条件”。事实上我当时也没有准备，然而这个问题却十分地$trivial$，我内心的想法是，如果我都不符合，南京大学有几人能符合？然而考虑到答辩会上不能如此狂妄，从而我从逻辑的角度，现在打基础阶段，对于未来做出成绩这件事我抱有积极的期待；数学方向没有基础，何谈创新；我课内学习成绩优异，竞赛方面也取得了成绩，此之谓拔尖。我后来回想，这个问题其实很像是以后研究生面试的问题，也就是导师为什么要你？你如何符合导师的要求？这便要求我们从不同的方面条分缕析，同时由于是临场发挥，阵上还得稳住，不能乱套。本质是一个介绍自己，“包装”自己的阐述。 下午乒乓球课自然成为一个放松的好机会。打的很累，水平也确实获得了提高。事实证明，当我用心去做每一件事情的时候，每一件事情都能够做的好，这其实就是那些看上去样样都很厉害的学生的秘诀：我不需要什么事情都做，但我既然做了就用心去做，尽力去做。由于水平的高低是相对而言的，大部分同学都做不到这一点，从而用心去做事情的学生，即使不是他的专业，即使他花的时间也不多，但也能达到一个比较好的水平。对于我现在也一样，事情比较多比较杂，那么就合理规划，一旦规划好做的事情以后，就用心去做，不中途摇摆，这样便会发现，自己每一件事情都做得很令人满意，长期以往便能达到一个新的高度。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论讨论班","slug":"life-47","date":"2023-04-03T08:59:58.000Z","updated":"2023-04-03T09:15:56.549Z","comments":true,"path":"2023/04/03/life-47/","link":"","permalink":"https://nju-kevin.github.io/2023/04/03/life-47/","excerpt":"","text":"今天上午将周末做的$RCA$第三章习题进行了梳理与总结，发现之中蕴含了许多美妙的结论和很好用的定理，我仍是照常一一摘录体会。不得不说，$RCA$的课后习题令人称赞，可能正文中没有什么例子，比较抽象，但课后习题便提供了许多有用的例子，这些例子能够帮助我对于一些事情建立更清晰的理解，我认为是大有裨益的。十点钟左右去和辅导员谈话，辅导员的目的也是想要了解每一位同学，我简要介绍了我的情况，然后聊起了数学讨论班的事情。由于每位同学都要进行劳动教育实践，高年级有学科专业实践，对于数学方向的同学来说，自然讨论班是最好的形式。因此我也顺理成章地组织了这次讨论班。不过，数学讨论班的最理想的形式其实是将水平差不多，兴趣方向大致相同的学生聚到一起讨论感兴趣的内容，但由于劳育的名号问题，这个讨论班不得不被称作是“学业辅导”。不过本质上，该讨论班讨论的内容仍然是由各位同学自己决定。每位同学讲一次讨论班，我打算第一个讲，把复变教材期中之前的内容梳理一遍，并讲讲第四章的$Fourier$变换。对于我来说其实并不需要准备，因为听课的同学的数学水平我也不太了解，因此中规中矩一些较为稳妥。 事实上，辅导员产生建立讨论班的想法是因为之前有一位学长说讨论班对于数学方向的学生来说很重要。不过我还想在这句话上加一点条件，那就是只有自己参与度高的讨论班，自己感兴趣的，自发参与的讨论班才有作用。讨论班如果只是听讲，那和听课没有什么区别，甚至同学讲的还没有老师好。因此，讨论班永远都是讲的那位同学获益最多，这是不争的事实。一方面，闭门造车不可行，另一方面，没有足够的个人消化时间也是致命的。我时常能够深深感受到个人消化的重要性。如果只有输出，没有足够的输入，那么输出的质量也会降低。因此，许多讨论班我都会进行一个评估，那就是我到底能不能学到东西，如果学不到东西那我过去也是浪费时间，这是很重要的一点。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"礼拜天晚间时刻（三）","slug":"life-46","date":"2023-04-02T13:17:22.000Z","updated":"2023-04-02T13:53:23.696Z","comments":true,"path":"2023/04/02/life-46/","link":"","permalink":"https://nju-kevin.github.io/2023/04/02/life-46/","excerpt":"","text":"今天晚上原本是有讨论班的，但由于不需要我主讲，加上我对于$RCA$周末做的第三章习题的批改与订正没有进行完，从而我没有参加。 这周末我主要完成的事情就是$RCA$第三章课后习题。星期六独立完成课后二十六道题目，星期日对于星期六的作业进行批改。做题做了10面纸，批改订正了20面纸，这在数学中是常有的事情，因为$RCA$的课后习题蕴藏了很多有用的结论与定理，而在证明这些定理的同时又能够帮助读者加深对于本章所讲述的内容的理解，这便是我很欣赏的课后习题。在这里要感谢$Kit-Wing \\space Yu$，他为$RCA$写了一份完整的解答，也正是因为这份解答，使得我能够对于自己做的题目过程进行批改对照，并同时学到题目的一些背景知识。有了答案不代表我能够为所欲为，如何合理地利用这份答案，也是我一直在思考的问题。首先，肯定不能对照着答案写题目，这样便失去了独立思考的过程，从而失去了做题的意义。我目前采取的方式是，做题时完全独立与答案讲义，对每道题进行了充分的思考后，不管是否能写出来，都把自己的思路写在做题本上，这样批改的时候也能够及时对照，到底是什么导致没有做出来，是思路有问题，还是细节有问题，还是思考的角度有问题，等等。另外，这份答案虽然是“拿来主义”同学的福音，但我在批改阅读的过程中，发现细微的地方有错误，大部分应该是笔误；同时我也时常发现答案上的方法未必是最优解。这份答案的特点在于解题的每一个过程都事无巨细，优点在于证明上逻辑没有任何漏洞，但小小的缺点是证明过程尤为冗长，使得读者未必能够迅速把握解题的关键。不过，我很赞同作者的写法。因为对于硬分析来说，追求的就是逻辑上的完美无缺。每一步是怎么来的，不能有半点含糊，这是我在这份答案中学到的东西，这也是硬分析初学者所应该具有的态度。可见，一份好的解答不仅要能够给读者正确地指点迷津，还要能够通过解答的整体风格让读者体会到这门学科的内涵与本质。 晚上的时候看到数学系学长学姐建了一个丘赛的组队群，让我想到了我即将要参加的几门竞赛。我目前对于竞赛的看法是：用“玩”的心态去“体验”竞赛的乐趣。展开说就是，考前（也就是平时）踏实学习，好好准备，等到参与竞赛考试之时，用“玩”的心态，尝试用心去“体验”竞赛的过程。例如，试卷发下来，我的目标并不是一定要做出所有的题目或者是考到多高的分数，而是尝试用自己的“聪明才智”去慢慢解开考题中的奥秘，以这种心态去竞赛，那么做出来多少题目都是次要的了，重点在于享受这个解题的过程。很多时候竞赛不能过于功利地去对待，因为这并不是竞赛组织人的初衷。像丘赛阿赛这样的高级别竞赛，组织这样竞赛的目的首先都是传播数学的美，让参赛者能够体会到数学的美，解题的乐趣，其次才是所谓的功利性的选拔人才。作为参赛者，也应该从竞赛组织者的初衷出发，用心去体会竞赛的整个过程，而不是以功利性为主的心态去参与。很多时候我都会想起毛主席曾经写过的文章《论持久战》。这篇文章是上学期历史课上的一个作业，但我越来越发现，伟人的思考就是异于常人的。在中国当时的环境下，能够对于局势有着这么正确的认识难能可贵。其实从毛主席的话中就可以读出共产党人抗战的决心和信心，不会因为日军装备精良就畏惧。用在这里也一样。对于难度较高的竞赛，不能有畏惧的心理，我大一的时候参加尚且能够看懂每一道题目，也能写出一些有用的东西，如今多一年的时间，我的水平和能力又得到了进一步的提升。起初我对于组队还有些犹豫，担心如果组队了拖团队后腿，但我转念一想，南大高年级学长的水平未必有我高，历史上这么多年南大拿到决赛奖牌的人屈指可数，大部分同学都是空手而归，大家的水平相差不大，并不是说比我高一年级比我多学一年就一定比我厉害，我看不见得。我现在的水平在大三的学生里面至少会比平均水平高，这个虽然没有凭据，但依我的观察，这是成立的。因此我完全应该对自己充满自信，以上述心态去体验竞赛，时间会证明一切。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"四月展望","slug":"life-45","date":"2023-04-01T11:17:10.000Z","updated":"2023-04-02T13:18:28.805Z","comments":true,"path":"2023/04/01/life-45/","link":"","permalink":"https://nju-kevin.github.io/2023/04/01/life-45/","excerpt":"","text":"今天是四月的第一天，虽说是愚人节，但好像现在都不太过了，最多是开一句玩笑。加上南京大学的校长职位进行了人事变动，如此重要的调动也放在了四月一日，从而在今天进行四月的展望，也显得极为自然与合理了。 说是展望，实际上就是给自己提出点要求。毕竟我不知道四月会发生什么，更不知道四月份我能够学习多少内容，如果是以往的我，我或许会给自己制定学习计划，但现在我不会这样做。所谓计划的目的只是为了让自己保持一个节奏，而不是说真的要学多少内容，那些写的满满当当很细的月计划，充其量只是一个心里安慰，说不定第二天就发现要全部推翻了。 四月是很关键的一个月。一方面，四月会安排学科的期中考试，期中考试的重要性不言而喻，因此可能需要一周的时间带着进行复习。另一方面，四月中旬有阿里巴巴数学竞赛，虽然只是去试一试水，但在四月十五日之前我需要把数学分析和高等代数的基础内容复习完，这也是为了$CMC$决赛所考量的。同时，丘赛也只剩下一个月的准备时间，从而利用好四月对于提升分析学水平与功底是极有帮助的。在课外拓展方面，则要继续保持三月的学习与钻研精神，坚持一贯的学习态度，以及一丝不苟的作风，切实掌握$RCA$的内容，至于实分析方面看新的参考书，目前来看，应该不是四月份会去思考的问题，毕竟$RCA$实分析部分还有许多可以挖掘的地方。 虽然我无法预知四月结束以后我的学习进度能到哪里，但学习的主要任务还是一以贯之的： 实分析：$RCA$实分析正文与习题，实变函数论，（测度论） 复分析：$Stein$正文与习题，$RCA$复分析，（$Alfors$正文，若干论题） 概率论：$Durret$正文与习题 泛函分析：课件与习题 调和分析：$CFA$正文，位势论 方法与思路：主动学习法，与讨论班结合的学习法 前三门科目是我本学期的学习重点，自然也会是四月份的学习重点。同时，四月份我将利用上半月对于数学分析和高等代数的基础知识进行系统的梳理，并挑选有价值的题目进行练习；下半月将对于有价值的，能够增进我的理解的题目进行练习，尽量在五月份之前做好充分准备。四月周计划仍将照常进行，每周对于下周需要做的事情进行总结，并同时对于本周所学的知识进行回顾。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"三月总结","slug":"life-44","date":"2023-03-31T10:42:46.000Z","updated":"2023-03-31T12:12:09.861Z","comments":true,"path":"2023/03/31/life-44/","link":"","permalink":"https://nju-kevin.github.io/2023/03/31/life-44/","excerpt":"","text":"不知不觉，今天已经是三月最后一天了，也是时候会看一下这个月做了些什么事情。我往回翻了翻，看到三月一号写的文章：《关于学习深度的思考》。此时回想，那时候刚刚考完期末考试，学习状态刚刚调整进入钻研的状态，更新的学习方法也刚刚投入实践，还有很多东西在摸索中。学习的内容方面，我刚开始学习调和分析，复分析也刚刚入门，概率论更是如此，毕竟当时还是本学期学习的初期，各门课程的进度还很有限。如今回顾，我认为三月份大致可以分为三个阶段：三月上旬，三月中旬，三月下旬。三月上旬主要干的事情是对于新的学习方法进行适应以及调整，各门课都开始超前进度学习，并开始不断联系，增加拓展内容和学习深度，包括但不限于准备讨论班，适当进行讲演训练和应用费曼学习法。值得一提的是，在三月八号我将$RCA$的实分析部分完结，接下来便是对于$RCA$实分析部分的复习以及再理解。三月中旬是对于三月上旬学习的一个调整与适应，因为发现十天左右的高强度学习使得我略显疲惫，并且由于三月中旬大多在进行知识的输入，即使是输出也是自己讲给自己，从而在中旬，我进行了知识的输出，为讨论班开头进行讲述，以讨论班讨论的形式与同学们与老师进行交流，从而深化对于知识的理解，提高学习的效率；同时，我还与师长进行了交流，说出了自己的困惑，并听取了他们给我的建议，我很感谢老师们与我交流，让我懂得了不少东西，尤其是与苗栋的交流，让我改变了被动学习的思路，改变了看问题的观点，从而把握了学习的主动权，更能够抓住事情的本质，这对我来说的确是很有用的。三月下旬则是对于不断更新的学习方法进行深入的实践，同时，由于已经有了将近一个月的时间的积累，学习的知识已经有了一些深度，从而加强了各部分知识的联系，从而形成了对于各个学科的内容的一定的理解和认识，可以说是看清了一些事情，弄明白了一些东西，还是可圈可点的。 综上，三月份我获得的成长是巨大的，这也符合我三月初的预期的目标。我不想去统计三月份我做了多少笔记，因为这样的量化是反映不出效果的。我想说的是，三月份学到的东西是不可量化的，它们具有的价值也是不可估量的，相信对于我以后对于数学的理解，也都是具有很大的帮助的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"实变调和函数与复变调和函数","slug":"life-43","date":"2023-03-30T12:34:01.000Z","updated":"2023-03-30T13:46:30.123Z","comments":true,"path":"2023/03/30/life-43/","link":"","permalink":"https://nju-kevin.github.io/2023/03/30/life-43/","excerpt":"","text":"今天傍晚上完讨论班，突然对实变调和函数和复变调和函数有点晕，有些搞不清二者以及所谓全纯函数的关系。一个晚上我都在想这件事情，也搜了很多网上的东西，但感觉网上好像并没有专门讲这件事情的文章，因此我当时认为这是因为这可能不算个问题，靠我自己完全可以解决，应该只是概念混淆的问题。 从吃完饭到洗澡再到洗完衣服，之后我又翻看了一些材料，现在终于算是明白了。下面我将讲述一下其中的利害关系。 首先，调和函数可以定义在$\\mathbb{R}^n$中的开集上，注意这里是$n$维欧式空间，而单复变里的调和函数都是$\\mathbb{C}$上的，$\\mathbb{C}$同构于$\\mathbb{R}^2$，因此单复变里的调和函数相当于都是2维欧式空间上的，也是最简单的调和函数。首先先说$\\mathbb{R}^n$中的开集上的调和函数。它具有很好的性质，证明不需要依赖单复变中的理论（实际上也用不了，甚至说，单复变里的是从实变调和函数中来的）。参阅$Potential \\space Theory$中的调和函数部分，我们可以知道，调和函数有$Poisson$积分公式，最大模定理，平均值性质，$Liouville$定理，且任意阶偏导数和混合偏导数都是调和函数。 在单复变中，此时所说的调和函数都是$\\mathbb{R}^2$上的，参阅$RCA$，我们知道，全纯函数都是调和函数，从而这也是为什么全纯函数上述的性质都满足。另外，全纯函数的实部虚部都是调和函数，且虚部是实部的共轭调和函数；全纯函数的实部虚部由于都是实值的调和函数，自然都是实解析的，且任意阶偏导数和混合偏导数仍然是调和函数。从而，事实上，全纯函数是一对特殊的调和函数所构成的，全纯函数都是调和函数，但反过来不对，调和函数不一定都是全纯函数。这是因为，复值调和函数当且仅当实部虚部都调和，特别地，实值的调和函数如果全纯，则恒为常数，这对于一般的显然不成立。因此一个复值调和函数如果是全纯的，那么实部虚部都调和，从而实部虚部只能为常数。局部上，一个调和函数是一个全纯函数的实部，当然也就有该全纯函数的虚部也调和，从而给定一个调和函数可以找到其共轭的调和函数，在某种意义下，调和函数是全纯函数的一种投影。 可以看出，2维的情况中，全纯是比调和更小的一个范围，全纯本身都是调和的，且分量也都是调和的。由于复值函数调和当且仅当实部虚部调和，因此如果一个函数全纯，那么它一定调和，从而实部虚部都调和，但全纯比一般的复值调和函数更强，这是因为全纯函数还要求实部虚部的调和函数是共轭的！有了这个范围观念（或者说是强弱观念），全纯函数满足上述的性质就不足为怪了，因为调和函数都满足，全纯函数更满足！ 再补充一句，由于$\\mathbb{C}$同构于$\\mathbb{R}^2$，那为什么单复变不能归结为2维欧式空间的分析学呢？其实从函数在某一点的可微性就可以看出来，2维欧式空间中函数在某一点存在极限要从任意的路径趋近这个点，在这个点的可微性只能用定义去验证；复变函数在某处的可导只需要两个方向就行了。那么问题的根源在哪里？我之前一直想不通这个事情，现在我的看法是，$\\mathbb{C}=\\mathbb{R}(i)$是数域的扩张！两个空间虽然同构，但是从代数结构上看，两个数域中的数是不一样的，复平面中增加了$i$成为域扩张，相当于是向量空间的数域都变了，上面的理论当然不一样，拓扑意义下的同构只能表现出空间的拓扑性质，但很多时候只有拓扑性质是不够的！这是目前我给出的一个我认为还不错的解释。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"弱大数定律的两个应用","slug":"life-42","date":"2023-03-29T13:03:12.000Z","updated":"2023-03-30T05:24:19.115Z","comments":true,"path":"2023/03/29/life-42/","link":"","permalink":"https://nju-kevin.github.io/2023/03/29/life-42/","excerpt":"","text":"今天谈两个弱大数定律的应用，也是上午学习概率论发现的两个很有趣的东西。首先弱大数定律是说，对于独立同分布的一列随机变量$X_1, \\cdots$，如果$E|X_i|&lt;\\infty$，让$S_n=X_1+\\cdots +X_n$，$\\mu=EX_1$，那么$\\frac{S_n}{n}\\to \\mu$（依概率测度） $Coupon \\space Collector’s \\space Problem$这个问题讲的是，我现在盒子里有$n$种卡片，每种各一张，每次随机拿一张出来，记录后并放回，那么需要多少次才能把所有种类的卡片都拿出来过至少一次？这是一个很经典的弱大数定律的应用，实际上也与几何分布有关系，我们既可能只用$n$次就把所有的卡片都拿出来过，也有可能一直都不能集齐所有卡片。 为解决这个问题，我们给$n$种卡片标号，每次实际上等价于拿出了一个数字，从而构造出一组独立同分布的随机变量（因为每次拿卡片的模型都是一模一样的）。令 \\tau_{k}^n=\\inf\\{m:|\\{X_1,\\cdots,X_,\\}|=k\\}为第一次集齐$k$种卡片所需要抽取的次数，我们要求的就是$T_n=\\tau_{n}^n$.令 X_{n,k}=\\tau_{k}^n-\\tau_{k-1}^n从而$X_{n.k}$服从参数为$1-\\frac{k-1}{n}$的几何分布。从而 ET_n=\\sum_{k=1}^n\\left(1-\\frac{k-1}{n}\\right)^{-1}=n\\sum_{m=1}^n\\frac{1}{m} \\sim n\\log{n}var(T_n) \\leq \\sum_{k=1}^n\\left(1-\\frac{k-1}{n}\\right)^{-2} \\leq n^2\\sum_{m=1}^{\\infty}m^{-2}从而由弱大数定律， \\frac{T_n-n\\sum_{m=1}^nm^{-1}}{n\\log{n}}\\to 0 \\space in \\space probability于是我们有 \\frac{T_n}{n\\log{n}}\\to 1 \\space in \\space probability这表明当$n$很大的时候，需要的次数为$n\\log{n}$. 从而，一个有趣的例子是，假定大街上遇到的人的生日在一年365天中概率是一样的，那么我们需要遇到多少人才能使得这些人的生日覆盖一年中的每一天？答案是大约$365\\log{365}=2153.46$个人。 $St.Petersburg \\space Paradox$这个例子是说，我们进行抛硬币的游戏，如果你第$j$次抛到第一次正面，那么你就赢得了$2^j$美元，那么假设进行$n$次游戏，应该如何收取每次游戏的参赛费？一个很自然的想法是，我们可以算一个人进行一次游戏所赢得的钱的期望（也就是平均值），由于每次游戏都是独立的，所以我们每次收一样的参赛费即可。但这就出现了问题，考虑到第$J$次抛到第一次正面的概率为$2^{-j}$，单次游戏赢钱的期望为$\\infty$正无穷！因此理论上这是一个平均能赚无限金钱的游戏，每一个人都想参加！但是很显然我们不能收取无限的美金作为参赛费。我们还是考虑三角阵列的弱大数定律。令 m(n)=\\log_2n+K(n)其中$K(n)$会在无穷远处发散到无穷，并且可以选取使得$m(n)$是一个整数。让$b_n=2^{m(n)}$, nP(X_1\\geq b_n)=2^{-K(n)+1}\\to 0容易验证满足定理所需三个条件。我们让 \\frac{K(n)}{\\log_2n}\\to 0从而有\\frac{a_n}{n\\log_2n}\\to 1 运用大数定律 \\frac{S_n-a_n}{n2^{K(n)}}\\to 0 \\space in \\space probability如果我们再让$K(n)\\leq \\log_2{\\log_2n}$对于足够大的$n$，从而 \\frac{S_n}{n\\log_2n}\\to 1也就是说，进行$n$局游戏时，收钱$\\log_2n$是合理的. 不过，这个游戏实际上对于参与者还是一个亏本的大买卖，如果每次收费40美元，那么需要进行$2^{40}$次游戏，玩家才能回本。也就是说，在这个模型里，平均每次赢得钱总是与参与的次数有关的，因此作为游戏的设计者（也就是赌场方面），他们只要设定一个人最多玩10次，每次收费5美元，这个看似诱人的游戏实际上对于统计意义下来说，大部分人都是亏钱的，因为一个玩家需要$2^5$次游戏才能不输钱，更不要说一次收费40美元了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"概率论课程中的一些简单思考","slug":"life-41","date":"2023-03-28T13:16:13.000Z","updated":"2023-03-28T13:35:03.252Z","comments":true,"path":"2023/03/28/life-41/","link":"","permalink":"https://nju-kevin.github.io/2023/03/28/life-41/","excerpt":"","text":"本学期的课程不知不觉已即将过半，与之相伴的就是课程的深度不断加深。学校概率论课上的内容还是比较浅显易懂的，主要讲了各种知名的分布（即有名字的分布，例如$Poisson$分布等），当然它们在生活中都是有实际意义的。例如可以用指数分布描述灯泡寿命，食堂排队还需要等多久；泊松分布可以描述一段时间内进食堂的人数等。当然，这些知名的分布虽然令人愉悦，然而并不能揭示概率论的深层内涵。我学习概率论也没多长时间，更不敢说是已经学到了概率论的内涵，然而从课上提到的分布函数可以进行$Lebesgue$分解这一条，其实蕴含了许多分析学的背景。 事实上学概率论的最佳阶段是一学完实变函数的时候，而现在上概率论课程的大二同学有大多数都没有接触过测度论，从而才会觉得吃力。同样的，我想今天课堂上那些没有学过测度论的同学，应该会很困惑为什么分布函数可以进行$Lebesgue$分解分解成跳跃函数，绝对连续函数和奇异函数。我也看到有同学课后向老师询问定义，事实上这个$Lebesgue$分解的背景就是复测度关于一个正测度的$Lebesgue$分解，所谓的绝对连续函数源自于测度之间的绝对连续。如果一个复测度$\\mu$关于正测度$\\lambda$绝对连续，则$\\lambda(A)=0$能推出$\\mu(A)=0$；如果复测度与正测度相互奇异，指两个测度集中的集合不交。这里的绝对连续与奇异，就是上述所说的来源。不过，由于下课后我旁听了一会，我发现原本认为的$AC$（也是叫绝对连续）函数实际上本质就是测度的绝对连续，只不过是关于$Lebesgue$测度的绝对连续。之前我在$AC$函数的定理找不出什么测度绝对连续的影子，但如果是关于$Lebesgue$测度的绝对连续，那么事情就变得很显然了。 多提一句，如果要说全名，上述分解应是$Lebesgue-Radon-Nikodym$分解，其实就是实分析中的$Radon-Nikodym$定理，该定理即阐述了如何将一个复测度相对正测度进行分解，这块内容或许实变函数也未必能够涉及，但本质确是深刻的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"浅谈$Papa \\space Rudin$的课后习题","slug":"life-40","date":"2023-03-27T08:51:06.000Z","updated":"2023-03-27T09:06:36.086Z","comments":true,"path":"2023/03/27/life-40/","link":"","permalink":"https://nju-kevin.github.io/2023/03/27/life-40/","excerpt":"","text":"学了一个周末的复分析，自然应该换换口味。今天把$RCA$第二章的习题进行了批改，并再次对第一第二章进行了强化，主要是针对昨天晚上讨论班讲课过程中的一些疑点针对进行的复习。可以说，第一第二章看的次数不下于十遍，然而每一次却都能够有新的理解，难怪说“实变函数学十遍”啊！ $RCA$的课后习题也显得很有趣，以往我只是被动地去做题，题目怎么描述的我就跟着去做，不管能否做出来，对于这个题目的意义却没有一个较为清晰的把握。现在，当我对于题目进行一个宏观把握以后，我对许多习题的意义，也就是说作者把这道题放到课后习题的原因有了一个比较清楚的认识。第一第二章的习题有些题目写起来过程的确很长，但虽然思考量大，过程繁琐，背后的原因是显而易见的。由于正文内容没有多少例子，写的比较一般化，普适化，那么课后习题其实提供了一个很好的补充例子的作用。不论是对于一些稠密集的构造，还是仅通过一道题直接构造出$Dieudonne$测度，都是为了为正文中的定理提供例子以及应用。通过一些性质很反直观的集合的构造，能让我们对于集合的测度以及稠密性有更深入的把握；而对于一些特殊空间中的测度构造，其实告诉了我们$Riesz$表示定理所得到的测度并不是$regular$的，需要加上一些条件，例如$\\sigma-compact$等，那么这些条件如果去掉是不是就不能成立？反例就是在习题中。 因此，从第一章与第二章的习题中，我们可以看到$RCA$的课后习题也是十分有意义的，因为它并不是侧重于对于技巧的训练，而是对正文中的定理条件的必要性，或者是对于较为抽象的结论提供例子，因此，做习题能够对正文的内容有更深入的认识，可见一套好的课后习题的重要性。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"礼拜天晚间时刻（二）","slug":"life-39","date":"2023-03-26T13:21:52.000Z","updated":"2023-03-26T13:49:35.589Z","comments":true,"path":"2023/03/26/life-39/","link":"","permalink":"https://nju-kevin.github.io/2023/03/26/life-39/","excerpt":"","text":"今天是充实而劳累的一天。白天主要在解决复分析的全纯函数部分，对应$RCA$第十章。复分析和实分析一样，都是可以挖很深的科目，这一点到目前为止我已经深信不疑，我在不断的学习，思考，讨论班讲述的过程中，我不断发现即使是我自认为掌握得很牢固的内容，也会有理解的不够透彻的地方。以前我只会感叹自己学的还不够，如今除了感叹，我还会将这些掌握的不够牢固的地方记下来，很多时候即使是一个小问题也会有很多值得研究的地方，如果自己深入去探索，会发现更广阔的一片天地。 晚上讨论班我讲了两个小时，主要给另外两位同学介绍了较为一般的测度理论，以及$Lebesgue$测度，$Lebesgue$积分的基础知识，讲述的内容有不少天没看（此次讨论班我什么都没有准备，什么都没有带，我是刻意为之，就是想看看在一段时间不看实分析之后，我还记得多少），讲的过程中确实有记得不牢的地方，但同时我也很欣慰地发现，讲出来的东西还是有不少很精彩的结论的。学习就是不断的反复，现在发现有遗忘的地方我已经不着急了，忘了就去巩固，所反复几遍，多加深加深印象，自然能记得更牢，更重要的是，理解的更到位。这是一个长期的过程，很显然并不是一朝一夕就能达到的，我也会每天继续坚持下去，不断巩固对于各方面知识的理解并加强各个部分知识的联系，长期以往，定能驾轻就熟，信手拈来。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"电驴骑行初体验","slug":"life-38","date":"2023-03-25T12:12:43.000Z","updated":"2023-03-25T12:43:09.925Z","comments":true,"path":"2023/03/25/life-38/","link":"","permalink":"https://nju-kevin.github.io/2023/03/25/life-38/","excerpt":"","text":"这几天学校里引入了共享单车的“升级版”：共享电驴。之前没有骑过电驴，可以说是零基础，但我自认为我的平衡感并不差，并且电驴的骑行应该与自行车类似，大同小异，唯一的区别是电驴不需要用脚踩了，它的驱动与摩托类似，通过右手手柄向后旋转前进。虽然我还没有获得机动车驾驶证，但考虑到电驴并不是机动车，从而在校园里骑行确乎是合法的，于是我便扫了一辆尝试了一下。原本以为电驴和自行车一样易于控制，然而车身的确是重多了，旁边一个同学一不小心向后转了手柄，车就直直地冲了出去，因此，对于电驴，控制油门的深浅是很重要的。上手其实很容易，只要会骑自行车，那么骑电驴也不是问题，不过，与自行车也有区别。因为自行车的起步是自己可控的，并且也是循序渐进越来越快的；然而电驴的动力在刚开始起步的时候还是显得很可观的，但这也导致了如果控制不好油门的幅度，容易造成加速不连续，从而产生晕眩感的问题。 对于这个问题，说白了就是要控制好骑电驴的节奏。这让我想到了之前苗栋所说过的控制好学习的节奏，有着异曲同工之妙。其实为什么一开始的时候难以控制节奏，就是因为对这个事物不熟悉，学习也是一样，有的时候为什么很难控制学习某一门课的节奏，说白了还是对于这门课程的难度以及深度没有一个较为客观的把握，但这种好的节奏也不是可以一劳永逸的，对于不同的课程有着不同的节奏，对于自己的不同的时间段，其实也有着不同的节奏，而如何较为恰当地把握好节奏，没有别的方法，只有靠不断地调整，不断地摸索。实际上，大家做学问的时候，都是摸着石头过河，早日找到节奏，进入节奏，那就能早日提高工作学习的效率，早日养成良好的学习习惯，这一个过程或许显得困难，但一旦有些许眉目，都会对一生的学习产生积极影响。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"新学习方法的初实践","slug":"life-37","date":"2023-03-24T10:28:40.000Z","updated":"2023-03-24T11:25:05.592Z","comments":true,"path":"2023/03/24/life-37/","link":"","permalink":"https://nju-kevin.github.io/2023/03/24/life-37/","excerpt":"","text":"通过昨天的会谈，我对于学习方法也进行了微调，对于知识点，更侧重于对它的理解，对本质的琢磨，而不再仅仅停留于形式，我认为，这样能够极大地提升学习的效率，从而真正增进对于数学概念的认识，提高看问题的观点。上午在图书馆做完了$RCA$的第二章习题，这次在做题的时候，我尝试使用昨天所说的看法，在评判这道题我是否能做出来之前，首先对于这道题的意思，这道题的本质进行一个把握，然后思考这道题与所学知识有怎样的联系，通过这样的思路，我能够很快地把握这道题的思路，如果遇到困难我也能清楚地了解我哪一块部分掌握的不好，从而进一步去巩固加强。因此，根据这个思路，原本打算将每个定理的主要思路记录下来的设想得到了优化，对于重要的定理，需要掌握其证明，对于显得不那么“重要”的定理，对于其本质进行记录。题目也是一样，对于经典的题目，记录其思路；对于练习目的为主的习题，可以记录其结论，并承认它的正确性。需要注意的是，这不代表浅尝辄止，而是指在充分理解内容的基础上，对于定理与习题进行有选择性的参考，目的都是一样的。 下午的复分析课上，对于之前讲到的定理进行了总结以及应用，复分析中有很多美妙的定理，原因就在于它是一个比实值函数更好的函数。数学分析中讲到的函数大多是连续函数，复分析中的函数不仅连续，实部和虚部都是调和函数，且满足$Cauchy-Riemann$方程，这是一个很强的条件，比数学分析中连续函数的条件还要强，也正因为如此，才会出现许多例如刚性定理，最大模定理等一般的连续函数所不具有的结论。而实变函数则是比连续函数更差的一类函数，即$Lebesgue$可测函数，本质上，数学分析，复变函数，实变函数讲的东西有很强的联系，即三种函数的性质。以这种观点去看，这三门课其实是联系很紧密的，使用的方法与技巧都有着类似、共通之处，在以后的学习中，或许我也能够有更深刻的体会。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"与师长的交流（三）","slug":"life-36","date":"2023-03-23T13:41:04.000Z","updated":"2023-03-24T00:36:03.166Z","comments":true,"path":"2023/03/23/life-36/","link":"","permalink":"https://nju-kevin.github.io/2023/03/23/life-36/","excerpt":"","text":"今天晚上八点左右到逸夫楼B510办公室找苗栋老师聊了聊，从八点聊到了九点半，这过程我的收获远比看一个半小时的书收获来的大。其实原本今天晚上找他聊聊也是下午课上的突发奇想，因为感觉最近一段时间学习得有些疲惫，知识却联系不到一起，有些一团乱麻，我认为，这个时候应该做出调整，从而晚上约了苗栋进行了一次简单的交流。可以说，苗栋治好了我现阶段的焦虑症以及低层次的观念。 交流的过程中，我也直言不讳，觉得学习能找到联系但联系却不多，让我感到由于学习科目的多而导致的“杂”。苗栋对于这个问题一针见血地指出，“你认为杂是因为理解的不够，你要是理解的好了怎么会觉得乱呢”。我突然发现，所谓的名词的堆叠产生的繁杂之感，都是因为我没有找到联系，如果能够找到联系，会发现很多事情其实都是一回事。“比如你去紫金山，你东西南北都可以上去，你说你沿北边上去很熟悉，但是去过其他三个方向以后却看不清紫金山了，这怎么可能？还是你没搞懂，没理解懂”，我认为这个比方打的极为恰当。对于$RCA$这本书，苗老师认为这才是数学教科书应该有的样子，那就是正确，简洁，直接，所谓的易懂那不是写书的人的事情，那是老师的事情，写书的人没有义务写的很通俗易懂，他认为，一本数学教科书什么叫好，那就是我想查阅哪部分的时候一下子就能查阅到，而不是说一大堆“废话”，如今想想的确是这样，虽然书的好坏也是相对的，但都是有一个普适性的评判标准。后来我又问了问读书与做题，定理之间的事情，可谓是把我焦虑的症结说了出来，“你做题是为了什么？我现在给你几道高中的题目，你未必都能做出来，但你还想去学高中的东西吗？你肯定不会去学了，这是为什么？就是因为，即使高中的题我确实有不会做的，但做它没有意义了。”苗栋认为，我们不能被书和题目牵着鼻子走，不要仰视书后的习题，而要学会从俯视的角度，我不管我会不会做，我对这个题进行一个宏观的把控，如果这个题的结论很孤立，对其他的没什么帮助，只是为了让你做这个题，那么我认为这个题意义不大；但如果这个题在其他领域都有很广泛的应用，那么这个题你需要好好弄弄懂。做题是没有止境的，数学家也只是懂得比别人多而已，他也有很多不会的题目，但有题目不会就代表没有掌握好这块内容吗？掌握的再好都会有不会做的题目，题目全会做的人（首先这种人不存在）未必就掌握的好，题目只是说可以检验一下学习的质量，帮助理解这部分的内容，而不是为了做题而做题。某一块内容自己掌握的好不好，自己有一个感觉的，自己对这一块理解的清不清楚，自己心里是明白的，因此没有必要追求一定要把题目全做完，全做完又能怎么样？把这本书的题目做完了，还有别的书的题目，就算把本科生的题目做完了，你还是有不会做的题目，这是一个无解的问题！因此，目的不应该放在做题上，而应该是我理解了定义、概念，理解了定理，以及定理背后的思想，发现与其他东西有着联系，能运用它干一些事情，解决一些问题，这才是目的。判断一个人学某一个东西好不好，也是相对的，你在不了解背景的时候，学的很浅显的时候，可能认为自己学的很好了，然而等到以后又会发现其实之前理解的不够，就好像从一楼二楼三楼都能看紫金山，但你看到的东西，角度是完全不一样的。这就涉及到学东西的事情。有的人追求速度，学得很快，知道了很多高深的定理定义，但你知道个名字有什么用？你说你知道了，未必就真的知道。对于定理的事情，实际上，也没有统一的答案，要自己学会对于问题进行宏观把控，甚至很多数学家都不能给出$Banach$不动点定理（这是数学分析中的很基本的定理）的证明，我知道了这个定理的证明，如果我不能收获到一些东西，那知道了又有什么用？充其量是说这个定理是对的。当然，对于基础课，例如数分高代，这就相当于是运动员的走路，走路不会，学跳水，攀岩，又有什么用？因此，对于定理也需要有一个自己的判断，要学会其中的思想，不要过于机械死板地学习。至于学习的速度，大家都想尽量快一点，多学点东西，但如果基础课都没学好，那么学了很多高深的理论，以及很多听起来很高大上的东西，那等于没学。速度可以慢一点，但要保证质量。本科生低年级的课也不一定就浅显，很多听起来高深的东西也未必就很难。苗栋打了个比方，比如孙智伟老师研究的数论与组合，或许很多人都看不起，觉得太简单，但即使是“简单”的数论，大家都听的明白的一个命题，证明却是经常几十年上百年没有人会证。因此，看似浅显的东西，真不一定浅显，里面或许还真的有大学问。 简单地总结一下，主要有三点：1. 苗栋相对论；2. 宏观俯视论； 3. 保质量论。可以说，这次谈话治好了我目前阶段的焦虑症，收获或许是我看一个月的书都不能抵及的。 通过上述的谈话，首先我调整好了数学学习的心态，不再焦虑，对于数学学习的认识与观念得到了提升，也不再会有之前曾有过的所谓的“强迫症”，即书上习题没有做完就觉得不舒服，做完了就给自己一种我学会了的感觉从而放诸一边。学习是一个不断往复的过程，而且会不断回去进行参照，没有一劳永逸的事情，以这种心态，即使之前学的忘了，也不会过于焦虑，“忘了就回去再看一遍，$Hilbert$晚年的时候连自己曾经证明过的定理都忘记了，忘是很正常的事情”。的确，以这种心态去学习，目的将不再功利化，不再是我要多做点题提高自己的解题能力，而是真正对一个事情不断往复地培养以及提升自己的认识，这才是学习数学的终极奥义。 根据上述所说，以这样的心态去学习数学，既能提高效率，也能让自己不再疲于做完各个参考书上的题目，而是占据学习的主动性，自己对于书上的内容做出判断，从而获得更好的理解。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"雨天院楼见闻","slug":"life-35","date":"2023-03-22T13:18:08.000Z","updated":"2023-03-22T13:47:12.970Z","comments":true,"path":"2023/03/22/life-35/","link":"","permalink":"https://nju-kevin.github.io/2023/03/22/life-35/","excerpt":"","text":"今天一天自主学习，主要对课内的两门学科进行了深度拓展。概率论即将学习大数定律，对于基本的一些概念，包括一些集合理论有了基本的了解，这些都还是概率论的基本内容，真正深刻的东西都还在后面。目前对于概率论也很感兴趣，由于其与分析学的紧密联系，我认为以后从事概率与统计的研究也未尝不可。下午以及晚上对于复分析进行学习，主要参看的是$RCA$的第十章，第十章的内容十分丰富，不仅有全纯、解析的互推，关于曲线的指数的计算，积分公式，$Cauchy$定理，还对孤立奇点，推广的$Cauchy$定理，全纯函数的性质，留数定理进行了详细介绍。晚上对于一个之前不太理解的关于$\\text{Ind}_{\\gamma}(z)$的定理进行了仔细的研究，画了几张图，通过几何直观终于把看上去繁复的证明过程理解了。很多时候复分析的定理用几何直观是很好理解的，但用数学语言叙述出来会比较繁琐，而$RCA$上没有图片，从而证明过程看上去很长很吓人，实际上抓住证明的本质思路即可。 中午到匡院院楼交了一下卓越人才培养计划的申请表，且不论能不能评上，我将这次视为一种锻炼。因为到了之后发现表格的一个地方我没有填，我之前不填是因为看到上面说扫二维码填报，然而事实上表格还是要填写内容的，但由于电脑不在身边，跑回去拿电脑比较麻烦，负责的老师下午还需要开会，于是我从三楼到二楼图书室向老师借了一个电脑。然后却发现电脑不能联网，想了半天才意识到是需要登校园网验证，于是匆匆打开我原来的文档，将需要填的信息填好，发给老师，老师帮我打印出来以后，还需要我到二楼找副院长签字，然后拿到三楼盖章，最后再交给这位老师。我到二楼敲副院长的门发现人不在，于是这后续的事情顺理成章的推给了负责的老师。好在那位负责的老师并不是踢皮球爱好者，至少还是愿意做事情的，从而不需要我再往复跑了。去交材料的时候雨正好还下得很大，院楼里除了几身汗，出来以后羽绒服后面也被淋湿了，不过我认为这的确是一次很好的锻炼的机会，锻炼和老师协商的能力。我目前认为我在这方面没有什么困难，因为我有着充分的自信，说白了还是现在肚子里有点货，遇到学院的老师也不会有惧怕之心，实际上本来就不需要感到畏手畏脚，对老师保持充分的尊重即可。回到图书馆之后，正好午觉的时间点已过，导致后来一直有些疲惫，这几天还是以多休息为主，尽快调整好状态。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"前进途中的一些感触","slug":"life-34","date":"2023-03-21T13:12:01.000Z","updated":"2023-03-22T06:52:37.207Z","comments":true,"path":"2023/03/21/life-34/","link":"","permalink":"https://nju-kevin.github.io/2023/03/21/life-34/","excerpt":"","text":"今天概率论课上终于把昨天在教室里没有证完的$Riesz$表示定理证完了，并且这个过程是独立完成的。通过此过程，我感受到了硬分析的风格，即用最朴素的语言，最严谨的逻辑，做最美妙的结论。 最近有时候会由于需要学的东西过多而导致茫然而无所适从，然而我认为目前还是得以打牢基础为主。人都是喜欢画大饼的，往往画的时候不自知，等开始行动的时候才发现之前的饼画的太大了；人又都是好高骛远的，往往只看着前面的高山，却没看过脚下的路。我认为，这两点是我应该坚决避免的。的确，需要学习的东西有很多，然而时间确实有限的，不仅课内的概率论、复变函数需要精读（精读就意味着不仅课堂上要花时间，课后还得继续花大量的时间看各种参考书以及做练习）；课外还要学习实变函数，$RCA$，$Fourier$分析，流形与上同调；同时还要复习数学分析、高等代数、解析几何、常微分方程。我不想样样都看一点结果样样都没有学懂，这不是我想要得到的结果。我也试着给每门课划定了重要程度（见新学期周计划文档），以期达到有侧重地学习。学习了一段时间之后，每天的我过得很充实，也很疲惫，每周复习之前的课程的时间很少，事实上这个取舍是我最不想做的，有一种瞻前顾后的感觉，但不得不做，因为这学期要参加三门竞赛，且不论最后能取得一个怎么样的成绩，首先都应该是全力以赴。接下来对于学习方法的优化上，我认为应该着力于提高学习的效率，尽量通过持续的复习让自己减少遗忘，花在重要的课程上的时间也要有所保障，并多寻求各门学科的联系。 这段时间每天感受到很辛苦，可以说是一段比较困难的时光，但坚持下去，必将获得质变。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"浅谈$Riesz$表示定理","slug":"life-33","date":"2023-03-20T08:17:55.000Z","updated":"2023-03-20T08:48:51.766Z","comments":true,"path":"2023/03/20/life-33/","link":"","permalink":"https://nju-kevin.github.io/2023/03/20/life-33/","excerpt":"","text":"今天花了一个上午的时间把$C_c(X)$上的正线性泛函的$Riesz$表示定理从头到尾梳理并且证明了一遍，可谓是见证了一个理论从一开始只有定义，到一步步建立结论，一点一点接近想要证明的事情，最后到完全证出的一整个过程，吃午饭的时候，还有一处证明细节不太明白，走回来的路上突然发现就是利用的之前已经证出来的一个结论以及一个定义，至此，整个定理十二步的证明过程浮现在脑海里，我不禁发现，该定理的证明所体现的就是扎实的“硬分析”，集合论测度论的基本运算，上确界下确界的定义，用开集和紧集去“卡”一个集合，$Urysohn$引理和紧集的单位分解定理的反复运用…定理的证明过程看上去繁复琐碎，实际上包罗万象。事实上，这个定理在后面还有其他的形式，我打算复习到后面的时候结合对照着进行参看。定理的证明较为冗长，但实际上$Rudin$已经帮助读者分好了步骤，一共十二步，第一步是证明唯一性，第二步是对于测度和$\\sigma$代数进行定义，第三步到第十二步就是一步步靠近我们想要证明的事情，核心思想还是由外测度进行逼近，最终得到内测度逼近，从而得到一个$regular$的测度。为了加强记忆，晚上到教室的时候打算再自己证明一遍，闲来无事也可以对于该定理进行琢磨，不失为一种打发时间的好方式。 巧合的是，下午学习实变函数的时候，学习到了$Lebesgue$测度，其定义与$Rudin$的定义有着差别，很明显，实变函数所定义的测度更容易令人接受，或许也有两本书的介绍思路不同的原因，实变函数测度论部分显得更一般，从环上的测度开始介绍，思路也很清晰，环上的测度对于集合的可数并有着限制，而为了摆脱这种限制，可以在一个更大的集类上定义一个测度的延拓，但延拓之后不一定是测度，从而为了保持测度的性质，这个更大的集类上再挑出一些集合构成一个$\\sigma$环，这个环上测度的延拓仍为测度。按照这个思路，$Lebesgue$测度实际上就是，由左开右闭集合的可数并构成的环上定义的测度（为区间长度之和）按照上述过程进行延拓成为的外测度。 在学习实变函数的过程中，我一再地体会到，实变函数作为实分析的例子的优点。倘若只学$Rudin$的抽象框架，那么学完一遍脑中没有实际的结构，仿如空中楼阁，不能落地，印象也不能够深刻。很多时候，我们可能都觉得，一般的事情更好，因为它能够涵盖所有特殊的情况；但这件事也不绝对。很多时候正是从特殊的情况着手研究一般，用特殊情形的研究方法，尝试类比，往往一般的问题也能够解决。分析学的理论的确博大精深啊！","categories":[],"tags":[]},{"title":"礼拜天晚间时刻（一）","slug":"life-32","date":"2023-03-19T13:21:06.000Z","updated":"2023-03-19T13:45:56.597Z","comments":true,"path":"2023/03/19/life-32/","link":"","permalink":"https://nju-kevin.github.io/2023/03/19/life-32/","excerpt":"","text":"（标题借鉴自博尔赫斯的文章《礼拜二午睡时刻》，内容与本系列内容没有任何关系） 每周日我都安排为一周的复习与总结日，主要任务为对一周所学的内容进行回顾与加强。今天白天对于常微分方程的$Sturm-Liouville$边值问题以及紧自伴算子理论进行了学习，对于比较重要的定理掌握了证明，这一理论与$Fourier$分析也有关系，实际上就是$Hilbert$空间上的一组完备正交基。常见的正交基是自然指数形式，而对于紧自伴线性算子，它的所有特征向量也构成赋予相应内积的$Hilbert$空间上的一组完备正交基，这是令人惊讶的。 下午继续对于$Papa \\space Rudin$第二章前半部分点集拓扑的定理进行回顾和证明，对于每一道定理在掌握了其证明之后我会将证明的大致步骤写成$Hints$集，从而让定理的思路以简洁的形式出现，以便于今后一遍又一遍的不断巩固。晚上讨论班的同学讲的很不清楚，口齿不清，加上讲的内容晦涩难懂，从而我一个人到后面的黑板上推演$Rudin$上第二章点集拓扑方面的定理以及很重要的$Uryshon$引理，单位分解定理；有时间剩余，我又推演了复分析中从解析，全纯，指标，$Cauchy$定理，$Cauchy$积分公式，$Morera$定理到孤立奇点之前的全部定理，推完一遍后，终于有时间给我讲了，于是乎我把苗栋之前的上课笔记，$n$维$Laplacian$算子的坐标变换公式进行了推导。推导完后，我便离开了教室。 走在路上，回想着今天这一天所做的事情，貌似没有学什么新知识，但旧知识之间的联系却更加紧密了。很多时候，我认为，一直学新知识而不对已学知识进行巩固，那么留下来的印象和理解将会很浅薄，某种意义上，不复习让之前的学习变成了一种无用功。这也是我对于复习很重视的原因。数学的一些定理只有反复练，反复用，才能领略到其真正的价值，如果能学透，我们会发现，许多定理的作用都是巨大的。","categories":[],"tags":[]},{"title":"朝花夕拾（二）","slug":"life-31","date":"2023-03-18T08:31:36.000Z","updated":"2023-03-18T09:17:46.055Z","comments":true,"path":"2023/03/18/life-31/","link":"","permalink":"https://nju-kevin.github.io/2023/03/18/life-31/","excerpt":"","text":"今天上午上了两个多小时的复变函数课，下午我对$Rudin$和$Stein$的教材进行了一个对比，同时将最近学习部分的定理重新理了一遍，感觉脑中通透了许多。实际上，两本书写的定理的顺序是有差别的，这就导致两本书上定理证明的方式不完全相同。不过这也另一方面展现了许多定理在不同的前提下是有不同的证明方式的，路径并不是唯一的。 在教材介绍的顺序上，我更欣赏$Rudin$的方式，因为很早地引入$\\text{Ind}_{\\gamma}(z)$，使得不仅是对于计算的理解，还是对于$Cauchy$积分公式的表示，都更加普适。$Stein$书上对于$Cauchy$定理的阐述仅仅局限在证明了开集上的$Key \\space Contour$，对于分段光滑的证明由于过于繁琐而省略了；$Rudin$的方式是，做凸开集上的$Cauchy$定理，曲线也不仅仅是圆周或者是圆周挖去一些地方，得到的是闭路径的结论，而且$Rudin$也考虑了函数在某一点可以不全纯的情况，虽然集合的一般性减弱，但曲线的一般性更强。凡此种种，我认为，$Rudin$对于顺序的编排上更为合理。另一方面，$Stein$的教材更加人性化，可以说是一步步从简单到困难，而且也有很多批注，题目也有很多提示，从对于读者是否友好的角度上来说，我认为$Stein$明显优于$Rudin$，因为书中不仅仅是定理+证明的机械式排布，也有很多图例，帮助读者去理解。总体而言，亦是有舍有得的，我个人感觉$Rudin$追求的是更强更直接的结论，而$Stein$则是更直观更自然的风格，二者都有好处，我认为将$Rudin$作为$Stein$的参考书是很不错的，能够在$Stein$讲得不够深入的地方领略到本质，在感受到晦涩的时候能够更浅显地掌握要领，此为结合二者阅读的益处。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"由张高飞课堂所言引发的思考","slug":"life-30","date":"2023-03-17T13:21:24.000Z","updated":"2023-03-18T05:24:49.190Z","comments":true,"path":"2023/03/17/life-30/","link":"","permalink":"https://nju-kevin.github.io/2023/03/17/life-30/","excerpt":"","text":"今天复变函数课上，张高飞老师对于浙江大学和复旦大学某些教授复变函数的老师产生了小小的意见，兴许是之前开会的时候自己的观点没有得到重视，张老师的观点是，复变函数的本质问题就是在于$\\frac{1}{z}$没有原函数这件事情上。对于这个观点，我可以很深切地体会到，正因为这个不同，实变函数和复变函数开始走向不同的轨道，事实上很多复变函数中的概念都是因此而产生定义的。据张高飞老师的转述，浙大和复旦的复变老师更倾向于对于$Cauchy-Riemann$方程进行讨论，并由于本校有相应的讨论班，因此发言的时候底气十足；张老师在会议上虽然没有多说什么，但他自己内心清楚，这些教授看上去说的头头是道，实际上都十分“愚蠢”，包括他们自己编写了复变函数的教材，“自己都没学懂还编教材，真是可笑”。张高飞老师坚定地认为美国$Stein$教授写的复分析教材比国内的教材好，我认为不无道理。“我不是崇洋媚外，我们现在的的确确有差距，但差距在不断缩小，我们可以向他们学习，以积累基础日后赶超他们。” 我从内心里是很认同张老师的话的，从他的话中，能读出求学之人的谦逊，同时又有着积极上进，自信脱俗之感。包括前几次的课程，能看出，张老师是真的希望我们每一届之中，能出个几个真正为数学、为国家做出贡献的人才的，张老师自己也坦言，主要就是靠自己学，例如课后的习题，作业不一定会全布置，但每届都有那么几个学生把所有题目都做了，这些都是以后的基础，基础打牢了才有可能以后做出点成绩，做出点贡献。听了他的话，我内心也暗暗为自己加油，求学的路上不可能一帆风顺，总会遇到各种各样的困难。很多时候第一反应可能是退避，然而这时做出的选择正是区分人与人档次的凭据，想要基础打牢，知识学好，必须得下苦功夫，而且要持续地下苦功夫。我现阶段虽说已经坚持了一段时间，但时间还不够，积淀还不够，还需要看以后的日子如何去做。都说学习是苦的，我也承认有时的确感到疲惫，现在我发现困难的不是坚持一天，而是坚持很长一段时间，这期间也要学会苦中作乐，及时调整自己的状态。我也能够很深切地感受到，这其实也是一种能力的锻炼与培养，只有拥有了这样的能力，养得根深，日后才能枝繁叶茂。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"讨论班讲课心得","slug":"life-29","date":"2023-03-16T13:22:24.000Z","updated":"2023-03-16T13:43:27.151Z","comments":true,"path":"2023/03/16/life-29/","link":"","permalink":"https://nju-kevin.github.io/2023/03/16/life-29/","excerpt":"","text":"今天下午的讨论班上，我上讲台讲了$Fourier$级数的求和以及点态收敛性，这是这个课程的第一次学生讲课，以后也都会这样，老师将不再讲课，但回怼同学所讲的进行点评。我是这门课第一个上去讲的，自认为也算是开了一个好头。今天讲了一个半小时，也算是把我想要讲的内容都讲到了，在讲课的过程中，孙老师会提出对于我写的过程的一些疑问，我也不知道是否是为了考察我的理解，但的的确确讲出来才发现事情往往没有我想的这么简单，而且在我的学习过程中，有些问题并没有思考的过于深入，从而孙老师问起来的时候，我才发现我之前并没有思考这个问题。另外，我还有深刻的体会，那就是硬分析的功底还不够。学了一遍RCA只能说是基本的概念和结论有了了解，然而由于做的题目还不够，从而很多时候定理的应用并不能做到得心应手。结束以后我内心想到，秦理真老师说自己的硬分析功底测度为零，那么讨论班让我意识到我的硬分析功底不仅测度为零，还是空集。从而，这也促使我去进一步地打牢基础，并加强实分析的练习。 今天傍晚，第十四届全国大学生数学竞赛决赛第一次通知已经发布，时间定在五月末，对于我现在而言，有不少的复习时间，但我坚定认为从现在就要开始着手系统复习，而不能等到五月份再进行，否则，后悔的只能是自己。决赛和初赛的难度不在一个水平上，主要是因为竞争的人来自全国而不只是江苏省，因此我需要在比赛之前（确切来说是五月份之前）系统地复习完数学分析高等代数，对于之前做过的题目进行回看，方法和技巧进行回忆，CMC的技巧性很强，这与丘赛阿赛不同，既然打算参加，就应该全力以赴，尽力去准备，越努力，越幸运！","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"与师长的交流（二）","slug":"life-28","date":"2023-03-15T12:02:49.000Z","updated":"2023-03-15T13:09:43.607Z","comments":true,"path":"2023/03/15/life-28/","link":"","permalink":"https://nju-kevin.github.io/2023/03/15/life-28/","excerpt":"","text":"今天下午和陈爽老师交流了一会，主要是感觉最近的学习有些疲惫，由于学习过于专注导致忘记了休息。劳逸结合对于现阶段的我来说其实是挺重要的，加上最近这一段时间学的东西太多，思绪其实有些杂乱，需要找个时间好好理理。最近休息的其实并不是太多，运动过少，也没有什么娱乐方式，身体还是很重要的，这是每个人都避不开的事情。在得知我没有什么娱乐方式之后，陈爽老师建议我多进行体育锻炼，以及闲暇之余可以关注目标大学目标院系的一些课题组，看看有没有自己喜欢、感兴趣的课题组；一方面，提高学分绩，努力准备竞赛；另一方面，等学分绩、竞赛出成果之后，可以尝试联系导师，向导师推荐自己，提前联系导师在保研中有着很重要的作用。因此我认为，这的确是可以尝试的。另外，陈老师还建议，不要过于结果论，功利化，尤其是竞赛的时候，放平心态，才能发挥出自己的真正的水平，现在学习的过程也是，不要为了竞赛而学习，切实掌握知识点，尽力而为，结果坦然接受 接下来，我认为，我的生活学习习惯需要进行一些调整：第一、延长休息时间，如果没有娱乐形式，闭目养神，静坐，休眠，都是很好的休息的方式；第二、加强体育锻炼。一周只有体育课的时候能够进行运动，这样的运动量是远远不够的，体育运动也是一种排毒；第三、合理饮食，提高绿色蔬菜摄取量以及大量饮水，多吃白肉少吃红肉，不吃油炸膨化食品；第四、调整良好心态，对于学习生活保持乐观向上的心态，坦然面对生活和学习；第五、合理规划学习的内容以及时间，分清主次关系，定期制定每周计划表并落实。 目前，我着重进行学习的科目为：$Papa \\space Rudin$（习题+定理证明）&amp;实变函数，复分析，概率论基础 课外学习的科目：$Fourier$分析，泛函分析，偏微分方程，流形 复习的科目：数学分析，高等代数，解析几何，常微分方程 三者之中目前来看复习的科目应比课外学习的科目重要，因为复习的科目需要准备CMC决赛；而课外学习的科目由于本学期都有对应的课程进行讲述，从而我认为跟随课堂的进度即可。多余的时间除了重点学习的科目，还应放在复习上。重点学习的科目也有侧重，目前来说分析学对我而言是更重要的，概率论由于竞赛不涉及因此相对而言没有分析学的科目重要。对于着重学习的科目，需要稳扎稳打，把细节弄弄清楚；对于课外学习的科目，不硬性规定进度，讨论班的形式也从某种程度上来说对于掌握程度提出了要求；而对于复习的科目，在四月之前暂时打算系统地梳理一遍，等考前再进行往年卷的练手。 对于着重学习的科目，每天进行连续性的复习，只有不间断的复习才能提高知识的掌握牢固程度。因此我打算接下来每天留下一段时间对于着重学习的课程进行复习与知识梳理。复习的科目暂时计划于周末进行复习，而课外学习的科目在课堂上当堂消化以及当堂复习。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"与师长的交流（一）","slug":"life-27","date":"2023-03-14T11:15:42.000Z","updated":"2023-03-14T13:33:48.470Z","comments":true,"path":"2023/03/14/life-27/","link":"","permalink":"https://nju-kevin.github.io/2023/03/14/life-27/","excerpt":"","text":"（考虑到以后也可能会有与师长的交流，因此这也是一个子系列） 今天中午一点左右我在逸夫楼B-105数学系休息室与孙永忠老师进行了一次交流。本次交流我主要问了如下三方面的问题：第一、如何自学$Papa \\space Rudin$这本书，以及定理的证明、课后习题是否需要进行细致学习；第二、调和分析大概包含哪些内容；第三、分析学更深层次有哪些内容和方向。 对于第一个问题，孙老师表示，$Rudin$的书都是很好的教材，但不是很好的自学教材。书中的内容偏向一个定理一个证明的机械式，“这不像是外国人的写书方式，前苏联倒是会这么写”。孙老师直言，我对于实分析的学习顺序和他当年是一样的，即在没有学习实变函数的情况下直接看实分析这种“空对空”的定理以及理论，在没有实变函数具体的一些例子做支撑的情况下，我们会不明白一些定理为什么要用那样的方法去证明，从而只是生搬硬套。实变函数则是提供了实分析的许多具体的例子，从例子出发我们能够抽象出很多概念，因此学完实变函数再去学抽象的实分析是更加符合认知顺序的。孙老师也顺便吐槽了一下在学生没有学过实变函数的情况下便讲授概率论也是课程体系安排的问题。对于习题，自然是要多做的，因为本科生目前阶段掌握知识就是通过做题进行检验；而定理的证明的独立推导也是必要的，这个过程锻炼的就是“硬分析”的能力。这与我的观念是相同的。关于调和分析事实上原本就是$Fourier$分析，只不过可能由于是从研究调和函数开始的，从而换了一个叫法，不过即使只是$Fourier$分析，其中包含的内容也是巨量的，GTM249，GTM250两本厚度达到近十厘米的书便能看出其中事实上蕴含了丰富的内容。分析学的深度研究其实很多都是从物理问题里来的，分析学相比于代数、几何，显得没有那么地“纯数学”，分析里的一些突破也很难讲清楚，没有那么受人关注，而不像代数、几何、或者数论里的新进展，能够较为容易地讲清楚。分析学更是数学与其他应用学科的一座桥梁，很多理论都是从物理的方程中得来，从而数学家进行抽象得出了一些理论。这也从另一方面体现了我们在学习的过程中，是很需要实际的例子的，只有知道了例子，研究更抽象的理论才能有依据，这也符合人的一般认知规律。 这次不到一个小时的交谈其实让我明白了不少东西。我先前学习$Papa \\space Rudin$的时候便是直接从抽象框架下来的，很多定理会证明，但解题的时候会遇到很大的困难，有一个原因就是没有具体的例子。解题就像是做科研，总归是从自己知道的例子出发，不管是证明题还是构造题，都需要例子的支撑。而实变函数便是为实分析提供了例子（可以简单这么说）。晚上在图书馆我特意找了一本实变函数论，发现里面的内容只有$Papa \\space Rudin$前三四章的内容，看过$Rudin$以后再看实变函数，看上去丝毫不费力气，甚至有降维打击的感觉，不过我目前看实变函数重点应是补充$Papa \\space Rudin$中缺乏的例子，这是我的目的，对于RCA（即$Papa \\space Rudin$），老师的看法与我一样，书上的定理慢慢磨，习题也要多做，否则看了一遍也不会有太大的作用。因此通过这次交谈，可以说是优化了我的学习方式，也让我更有信心能够把RCA这本书学学透，切实提高自己的硬分析功底。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"朝花夕拾（一）","slug":"life-26","date":"2023-03-13T08:42:07.000Z","updated":"2023-03-13T09:04:51.768Z","comments":true,"path":"2023/03/13/life-26/","link":"","permalink":"https://nju-kevin.github.io/2023/03/13/life-26/","excerpt":"","text":"考虑到这学期学习的知识异常丰富（或者叫杂乱），我认为有必要定期回顾学习的内容，以达到融会贯通的目的。今天上午梳理了苗栋数学分析C课堂笔记关于$\\mathbb{R}^n$上$Laplace$算子关于坐标变换的公式以及特例：极坐标变换公式。昨天在准备周四的讨论课的时候就在思考可以把这个结论加进去，比书上讲的更全面，书上只是简单考虑了函数只和一个变量有关的情况，这使得事情变得十分简单，但简单也是有代价的，那就是用处不大。苗栋的过程需要用到不少高等代数矩阵变换的知识，当时感觉难以理解，然而今天上午推演的时候觉得很是亲切。一直看不懂的一步与书上的一个定理结合，瞬间得到了答案，这也让我感到很奇妙：原本我认为那本书讲的太简单，认为那部分没有什么参考价值，然而却发现我一直绕不过去的弯子竟然就在那本书里，这不禁让我感叹，很多时候正是看的东西多了，才会产生联系，盯着一本看，往往没有参照。我认为这件事从某种程度上来说也能反映出一点：书有的时候还是需要看的“杂”一点的。 后来由于决定让我讲另一本书，所以我便又开始准备$Fourier$分析的内容，好在我有基础，准备的过程不算困难，主要打算讲三个定理：$Fejer$定理，$Tonelli$定理，以及$Papa \\space Rudin$上利用泛函分析中的共鸣定理得到$Fourier$级数点态发散的一个结论。到现在为止，周四讨论课的内容大致有了一个准备，两本书我都能讲，并且我都能够讲出书中没有的东西（参考$Papa \\space Rudin$和苗栋的数学分析课堂笔记），这其实也是平时读书读的“杂”的好处：需要的时候能有拿得出手的东西。 这学期需要学的东西很多很杂，如何平衡好课内、讨论课、竞赛，成了我经常去考虑的事情。对于数学分析和高等代数的复习，我认为可以结合所学的课程进行复习，例如，准备讨论课的$Potential \\space Theory$的同时复习数学分析和常微分方程（因为有类似的地方）；学习泛函分析的时候复习高等代数等等。同时，由于讨论课不仅仅需要自己明白，还需要讲述，因此准备过程中平时应多进行独立推演，将零碎的时间利用起来，而将大块的时间留给理论学习。总之，这学期需要我不断追求时间利用的最佳化和效率的最大化，相信最后能够收获良多。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"通过报告进行学习之方法","slug":"life-25","date":"2023-03-12T08:47:29.000Z","updated":"2023-03-12T09:22:02.448Z","comments":true,"path":"2023/03/12/life-25/","link":"","permalink":"https://nju-kevin.github.io/2023/03/12/life-25/","excerpt":"","text":"今天主要干了两件事：学习复分析和准备下周四的讨论报告。由于这周没有复分析的课程，但过长时间不看复分析是有害的，况且复分析是如此重要且有趣的一门课，因此我认为，课后应该花费足量的时间对复分析进行学习，今天上午学习孤立奇点，极点，本质奇点的几个定理学的有些晕头转向，我认为本质还是因为最近复分析看的少了，平时不花时间怎么可能学的通透？因此这一点我认为是需要注意的。这学期（尤其是这段时间）要学的东西真的可以说是巨多，我不仅有新课需要学习，还有课外内容，以及复习之前的内容准备竞赛。三月份应是没有竞赛的，但如果利用不好三月份，后果将是毁灭性的。下周的计划我将会在周计划文档中进行更新。 下午准备分析学课程的报告，虽然这是一门选修课，但我认为如果我充分利用应该是能够学到大量实在的内容的。这门课老师将我们分成了三组，每组学生各读一本书，我被分配到的是$Potential \\space Theory$，原本我打算的是$Classical \\space Fourier \\space Analysis$，我也确实对其很感兴趣，不过由于这本书涉及到大量的范数运算，让我讲出来实属不易，而另一本就相对来说比较友好，因此我的打算是分配到的书每一期我都按照我需要报告做准备（由于每个人都要作报告从而并不能保证每次都是我讲），因为我明白作报告的才是收获最大的，而不是听报告的人；$Fourier$分析我也按照作报告的要求每一期进行准备。最近我也在不断尝试，打算总结出一套适合我自己的“费曼学习法”。所谓“费曼学习法”即是将学到的知识讲出来，但由于时间有限，我没有办法做到所有东西都讲一遍，但可以自己讲给自己听，自己用一张空白的A4纸进行推演，如果能够独立推出一本书的大致脉络以及定理的证明，我认为这个过程中的收获是巨大的，但这种方法不适宜所有的书（更何况现阶段我的时间异常紧迫），因此我只对$Papa \\space Rudin$采取了这种方法。当自己独立推演一遍不借助外力的时候，知识才是真正入脑了，而且经过上次课上到黑板前优化了一名学长的解法之后，我的自信心也得到了提升，大三大四年级学生学的还真的未必有我好，而我则需要坚持下去，多积累多沉淀，静待花开的那一天。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"鼓楼校区见闻","slug":"life-24","date":"2023-03-11T11:25:48.000Z","updated":"2023-03-11T12:12:02.694Z","comments":true,"path":"2023/03/11/life-24/","link":"","permalink":"https://nju-kevin.github.io/2023/03/11/life-24/","excerpt":"","text":"今天去鼓楼校区转了转，发现鼓楼校区的图书馆一楼每个座位都自带插座和点灯，看上去配置十分高级，座位也都是软垫子，这我认为是比杜厦图书馆要好的地方；不过座位之间有点挤，而且除了一楼以外就是普通的常规配置了。总体的氛围（包括整个鼓楼校区）感觉鼓楼更有历史气息，但不够宽敞，不像仙林校区比较大气，而且宿舍楼教学楼多半比较老旧，即使建造了新的楼房，也无法掩盖这一点。同时由于鼓楼校区被一条马路隔成了两块，因此感觉上来说生活区与教学区的距离较远，仙林更有一体化、现代化的感觉。 上午主要看的线性代数，把秦理真的泛函分析课上的线性代数复习了一遍，了解了所谓的代数对偶空间，补空间，伴随映射（很像微分形式的拉回运算）；线性代数看了多项式，行列式和矩阵，离即将到来的CMC决赛也不远了，是时候开始着手准备了，没有充分的准备是不能获得好成绩的，这一点大家都是心知肚明的。下午复习了$Papa \\space Rudin$第一章所有定理的证明并全部自己推导了出来，这便是所谓的“费曼学习法”，合上书本，自己讲给自己听，把定理自己推导一遍，印象远远比抄定理来得深得多，自己给自己讲个几遍，讨论班上再讲一遍，用孙永忠老师的话来说，自己讲过一遍之后就不会忘了，兴许真是这个道理。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"数学的直观与本质","slug":"life-23","date":"2023-03-10T10:24:44.000Z","updated":"2023-03-10T11:55:56.686Z","comments":true,"path":"2023/03/10/life-23/","link":"","permalink":"https://nju-kevin.github.io/2023/03/10/life-23/","excerpt":"","text":"今天在上通识课的时候，在思考一个问题：如何加深对于数学的理解，如何使得自己对于数学的观点更加深入？事实上，学到现在，我发觉，对于数学的观点很重要。重要的不再仅仅是会做几道题，会几个概念这么简单了。我遇见过太多的人知道很多概念，数学水平还是很低，为什么？只知道概念除了吹牛能够奏效，其余方面没有任何增益。也记得之前某位老师也说过，知道概念有用么？光知道个定义，那大家都能知道。以我目前的看法，学数学的人对于数学的观点决定了数学的水平阶层。 数学的观点，其实并不是看你会做多少题，也不是看你学到了哪部分的内容，而是考察对于数学特定问题的理解，思考的角度。以高观点看问题，往往能够看到表象背后的事情。例如一个定理，大家都是学这个定理，但如果观点足够高，往往能够知道这个定理有没有推广形式，这个定理有没有什么重要的推论，这个定理与其他定理的联系，这个定理本质上是什么等等；如果以低观点看问题，很多事实上很美妙的定理都将变得平平无奇，就好像用黑白眼镜，以黑白的视角看这个五彩斑斓的世界。 现在，问题是，如何提高自己对于数学问题的观点，以及如何提升数学思考的境界？按我目前的体验，我认为，每个人都需要经历从低观点到高观点的过程，就好像所谓的大佬都是从菜鸡开始成长的。这种低观点到高观点的跃升，并不是说学的知识越多，观点就越高，我认为，这需要不断的学习以及持续的深度思考。既需要不断了解新的知识拓宽自己的知识面的边界，同时也需要不断地对已经学过的知识进行深度思考，很多时候，不断地参看定理，能发现定理的弦外之音，这我认为也是要经常进行作业练习的原因。每当我做$Papa \\space Rudin$的课后习题的时候，才发现很多定理并没有理解透彻，在不断地参看下，能够对于内容的理解更加深入，长期以往，对于整个课程的理解才会得到进一步的提高。 为何每届都有少数同学能够学的脱颖而出，在课程的学习，竞赛的成果方面相比于普罗大众异常突出？其实就是这种良性的“滚雪球”现象导致的。当观点提高之后，对于更深入的课程的兴趣就更浓，也更能够学的透彻，再反观课内的课程，都是所谓的“降维打击”，自然也就能够获得常人难以想象，难以做到的成绩。 因此，简单来说，提高对于数学的观点其实很简单，提高对于知识掌握的熟练度，坚持进行持续地深度思考。当然这个过程是痛苦的，因为提高观点的同时也会少去很多直观性。这对许多初入数学的大门的人来说，是近乎不可接受的。因为从小到大人们都是通过这个具体而真实的世界来获取所谓的“安全感”，然而，数学中我们所认为的那些直观，往往不是真正的直观，很多现实生活中的事情，在数学中是不会发生的，也就是之前曾经说过的，“学习数学不能想当然”；更有甚者，很多数学中的事情都是“反直观”的，初次遇到这种例子，是必定会得到很大震撼的，从而安全感尽失。在渐渐接受这样的反直观之后，那么我们就能够从所谓的“直观”中抽离出来，从而具备学习更抽象的数学的基础。在攀升的过程中，悬而未决的感受将会始终贯穿。为什么这么说呢，因为在学习深入概念的过程中，很多时候我们不能一下子完全理解一个概念。很多时候事情远远没有知道一个定义这么简单，在学习其他课程的时候，也时常会有类似的问题，这就表明对于这个概念的理解并没有做到很完全。因此这就是那种悬而未决的感觉，有种悬空的感觉，这个过程固然痛苦，但“落地”的过程，是尤为踏实的。实际上，学习便是不断让知识“落地”的过程，倘若知识都悬在空中，那么需要运用的时候，知识都还“飘在空中”，更不要说运用知识解决问题了。因此，提高观点的过程的确是痛苦的，而且是循环往复的，因为不断有新的知识飘在空中，我们需要不断把飘在空中的知识落地，但不需要担心这是一个死循环，因为我们不需要走到尽头，在让一个个知识落地的过程中，我们的观点便在不断提高，我们对于数学问题的理解便在不知不觉的深入，直观虽然少了，但获得了深层次普适的观点，这确乎是一笔不亏的买卖。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"神奇的巧合","slug":"life-22","date":"2023-03-09T13:15:08.000Z","updated":"2023-03-09T13:44:39.405Z","comments":true,"path":"2023/03/09/life-22/","link":"","permalink":"https://nju-kevin.github.io/2023/03/09/life-22/","excerpt":"","text":"最近我发觉时常会出现这样的巧合：我私下里学了一个思想，一个定理或者是一个方法，有可能是睡前看的一个定义，也有可能是课间思考的一个问题，亦或者是自习的时候学习的一个定理证明，过后不久的课堂上，或者是作业上，或者是不经意看到的别的教室的屏幕上，就能出现我之前思考的事情。例如，昨天晚上睡前我在看ODE的紧自伴算子，然后早上泛函分析就讲了伴随映射（有区别但是是类似的东西）；我昨天把$Papa \\space Rudin$的乘积测度完结，今天概率论课上又讲了概率乘积测度；下午的分析学选讲上，我对一个学长的证明进行了优化，作业中有一个实解析函数的证明方法，又在晚上概率论作业中用到了。 最近经常会发生这种事情，发生的就恰到好处，不早不迟，一开始我还没怎么注意，后来由于出现的太频繁，让我觉得很是神奇。发生这种事情，一次两次或许还是巧合，但最近一段时间连续地发生，我认为或许是一种必然，但这种必然又是说不清道不明的，毕竟我也不会知道课堂上会讲什么，作业上会用到什么，我每天看的东西也不是固定的，总之我认为这是一个很神奇的巧合，就像我最近也有一种微妙的感觉，是关于学业上的感觉，具体是什么我也说不清楚，但有的时候就是能够体会到，有点像是和数学的神心灵感应，连线的感觉，但目前还很微弱，暂时还不清楚到底是什么。 这听上去有些“玄学”，然而事实上并不是只有我有这种感觉。南京大学数学系教授孙智伟，便是一位“灵感数学家”。孙智伟提出了很多猜想，很多都是不经意之间想到的，同时，据系里的老师说，孙智伟还有一种“超能力”，那就是能够预测，例如预测足球比赛何时进球，最后的比分等等。这种灵感是极为少见的，不过我也有理由认为他是数学科研到一定境界能够与未来连线的感觉。我认为，这其实都是一种概率很小的必然事件。概率很小那是因为常人都不认为这是容易发生的事情，但的的确确小概率事件往往都会集中在少数人身上发生。正因为这些事件暂时无法科学地解释，因此我认为这是形而上的必然事件。 本文浅谈生活中的形而上的必然事件，读者且当做说笑罢。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Papa Rudin II","slug":"rudin-3","date":"2023-03-08T08:08:27.000Z","updated":"2023-03-08T09:58:50.206Z","comments":true,"path":"2023/03/08/rudin-3/","link":"","permalink":"https://nju-kevin.github.io/2023/03/08/rudin-3/","excerpt":"","text":"今天把$Papa \\space Rudin$的实分析部分看完了，这算是我的第二遍看了，第二遍的收获明显要比第一遍大，一则是知识储备更多，基础更牢固了；二则学习的方法更科学，更注重定理的证明，基础的概念以及定理证明中不同定理之间的联系，更注重方法。也正因为如此，我学到了很多有用的证明方法技巧以及思想，这些是粗略地读书所读不出的。 这里我对$Papa \\space Rudin$实分析部分每一章进行总结，主要说一说每一章的重要的定理以及重要的证明思想。 Chapter 1 Abstract Integration这一章是为了测度论做铺垫，介绍了$\\sigma$代数，可测空间，可测函数，$Borel$代数，$Borel$函数，最小$\\sigma$代数，可测函数的$simple \\space functions$列逼近，$MCT$定理，$Fatou$引理，$L^p$空间，$DCT$定理。这一章的定理都是测度论的基本定理，同时也为之后的$Lebesgue$测度进行引入，许多定理都是今后定理的重要证明手段，其重要性不言而喻。主旋律为集合论的知识，通过$\\sigma$代数将测度与函数联系起来，函数依测度的积分的定义，函数用$simple \\space functions$逼近等手段在后面定理的证明中也时常用到。因此，学好这一章可以锻炼集合论应用的熟练度，同时这一章中已经涵盖了不少可测函数命题的证明，还可以加深对于测度，可测函数的性质的理解。 Chapter 2 Positive Borel Measure这一章在整本书中都有着举足轻重的地位。介绍了实分析所需的必要的点集拓扑，尤其是$Uryshon \\space lemma$，局部紧的$Hausdorff$空间的紧子集的单位分解，$Riesz$表示定理（证明十页纸要会背），$regular$测度（蕴含了内侧度与外侧度的概念，但$Rudin$并未提及），正式引入$Lebesgue$测度，$Lusin$定理（复可测函数用紧支集的连续函数从下逼近），$Vitali-Caratheodory$定理（实值可测函数用上半连续和下半连续分别从下和从上逼近）。这一章引入非常重要的$Lebesgue$测度，事实上，学到后面我们会发现，$Lebesgue$测度是相对来说更特殊的更好的测度，一般的测度可以与$Lebesgue$测度进行比较。这一章的构造性更突出，因此我认为主旋律是巧妙的构造，尤其是利用$Urysohn \\space lemma$进行的函数构造，对于很多定理的证明都有很好的效果。另外需要注意区分$Borel$集和$Lebesgue$可测集。最后两个定理对于$L^1(\\mu)$的函数的逼近定理同样十分重要，读者在后面能看到他们的应用。 Chapter 3 $L^p$ Spaces本章介绍了实分析中的重要空间：可积空间，以及可积空间上自然定义的范数。介绍了$Jensen$不等式，$Minkowski$不等式，$Holder$不等式，连续函数空间与可积函数空间的关系（$C_c(X)$在$L^p(X)$中稠密，这让我们在今后的证明中得以如鱼得水地使用$density \\space argument$），$L^p$空间的完备性。这一章使用的证明技巧则很好地体现了分析的特点，主旋律为不等式与函数的逼近，从而第一章中的$MCT$定理，$Fatou$引理，$L^p$空间，$DCT$定理会被广泛地使用，从这一张开始，集合论的语言不再为主导，内容将会更有分析的味道。 Chapter 4 Elementary Hilbert Space Theory通过标题也能够明白地看出，这一章的重点是介绍$Hilbert$空间，既然有内积，那就有垂直，从而可以将空间分为一个闭子空间以及与之垂直的空间，$Hilbert$空间上的线性泛函也可以用内积来表示，进而引入正交集，有$Fourier$分析中类似的部分和，最小逼近，$Parseval$不等式，$Weierstrass$定理（用三角多项式逼近连续函数），$Hausdorff \\space Maximal$定理。由于$Hilbert$空间是一种特殊的$Banach$空间，因此范数的运算必不可少，我认为本章的主旋律是正交。有很多关于正交集的结论，深刻揭示了$Hilbert$空间的内部结构。 Chapter 5 Examples of Banach Space Techniques本章有许多泛函的味道，介绍了有界线性泛函，$Baire$定理（进而完备度量空间不是第一纲集），$Banach-Steinhaus$定理（即泛函分析中的共鸣定理），开映射定理，$Hahn-Banach$定理（即泛函延拓定理），$Fourier$级数的点态收敛性。本章的重点是几个大定理，可以说$Rudin$的实分析把泛函分析的几个大定理都介绍了，每个定理的证明的过程都很长，但能看出其中的思想，常用的有数学分析里的区间套定理，构造偏序集利用$Hausdorff \\space Maximal$定理，主旋律我认为是正统Banach空间的分析手法，学好这一章，对于$Banach$空间以及泛函分析的理解都会深刻许多，对于利用范数的证明也能更加行云流水。 Chapter 6 Complex Measure本章介绍复测度（事实上之前说的都是正测度，这之间还有实测度（亦即符号测度）$Rudin$并未提及），复测度是测度的推广，但又是不完全推广，因为复测度需要收敛，从而不能无界，这里便有了全变差，正变差，负变差，测度的绝对连续，测度的相互奇异（$singular$），$Lebesgue-Radon-Nikodym$定理（非常重要，证明要会背）实际上提供了复测度相对于一个正测度的$Lebesgue$分解，以及得到了一个$Radon-Nikodym$导数，$Hahn$分解定理，复测度对于$C_0(X)$上的有界线性泛函的表示定理（与$Riesz$表示定理比较），正测度对于$L^p(\\mu)$上的有界线性泛函的表示定理。本章$density \\space argument$被广泛地使用，足以证明了它在定理证明中的重要性，这一章后面的表示定理的证明都十分长，但我认为掌握他们是百益无一害的，本章的主旋律为$density \\space argument$（我不知道中文叫什么所以写英文了），这是证明中十分常见且有用的方法，对于解题有着极大的利好。 Chapter 7 Differentiation本章介绍测度的导数，其实和数学分析的思路一样，实分析中也有测度的导数，微积分基本定理，推广到测度空间上会有些许不同。从测度的导数引入，对称导数，测度的最大函数，可测函数的最大函数，弱收敛（$Weak \\space L^1$），$Lebesgue$点，揭示了复测度的对称导数与$Radon-Nikodym$导数的关系，良好收缩到某一点的区间，度量密度，函数绝对连续（$AC$），微积分基本定理，线性算子的导数，变量代换公式。本章的内容极为丰富，介绍了很多概念，使用的证明方法又回归到了测度，从而集合论的证明方法再次发挥巨大的作用，主旋律为经典$Lebesgue$测度方法，有了本章的内容，可测函数的理论得到进一步完善。 Chapter 8 Integration on Product Spaces本章介绍了积测度，函数的分部在分空间上的可测性，$Fubini$定理（重要），积测度的完备化，卷积，函数的分布函数，特定的复合函数利用分布函数的积分公式。这一章在介绍积测度的定义以及性质上花了不少功夫，在证明$Fubini$定理时用到的很经典的证明方法是：要验证满足特殊条件的集合就是原来的大集合，除了证明二者的相互包含关系，还可以先设出来满足的集合，然后证明它与大集合相等；另外对于复值函数可以只看实值部分，实值函数又可以只研究非负函数，因为实值函数可以写成正变差与负变差的差，这也是证明中的一个常用技巧，这样大大简化的命题的复杂性。这一章证明方法可谓是综合运用了前面个章的方法，即有$MCT$，$DCT$的运用，又有集合论，测度论方法的应用，也有弱收敛理论中结合范数的证明（分布函数与弱收敛有着紧密联系）。作为实分析部分的最后一章，我认为这张的主旋律是用已知的方法探索更广的领域，实际上，将测度推广到$\\sigma$代数的$Cartesian$积上就是数学分析中对于多重积分的推广，实分析中的推广更为困难，需要前面打好基础，对于加深实分析的理解有着重要意义。 接下来我将对$Papa \\space Rudin$的章末习题进行练习，同时对于各个章节的定理证明进行复习，以加深硬分析功底。","categories":[{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]},{"title":"重整旗鼓，再度出发","slug":"life-21","date":"2023-03-07T05:19:27.000Z","updated":"2023-03-07T10:11:11.538Z","comments":true,"path":"2023/03/07/life-21/","link":"","permalink":"https://nju-kevin.github.io/2023/03/07/life-21/","excerpt":"","text":"今天为止，保研课的成绩都已揭晓，这次虽然近世代数和大学物理的成绩不是很理想，但仍有亮眼的，数学分析和常微分方程在总体而言算得上顶尖水平。我认为，从这其中可以看出两点：第一、平时的实打实的付出的确能够获得回报。这里需要强调一下必须得是实打实的努力，而不是看上去的表面的那种努力。自己平时努力有没有水分，自己心里最清楚，水分越少，学的越好，最后的结果才能够越优异。其实已经可以看出，这次数学分析和常微分方程两门课程的成绩，即使放到数学系，也是屈指可数的，对于大多数同学都形成了“降维打击”，对于那些不管是酸溜溜的人也好，被伤到吓到以至于自卑的人也好，我想对你们说，这次只是给你们一次心理准备，接下来我会通过一门门的硬核的课，让你们体会到，什么是真正的降维打击！好戏还在后头！第二、通过这两门的考试成绩，虽然不能反映多少信息，但也能看出，我目前的分析功底还是有的（很牢固还谈不上），并且我目前对于分析方面的知识的掌握程度还是很可观的，这也一定程度上说明我目前的学习方法是科学的，合理的，如果能够坚持下去，是可以创造奇迹的。 总体而言，大二上学期的课程的学分绩或许有些微的下滑，然而我看到的是新时代的开始，一个属于我的时代即将到来。接下来的核心课为：概率论基础，复变函数，实变函数，拓扑学，偏微分方程，泛函分析。我将不断提高我的硬实力，并不懈追求每门课的最高给分，既然常微分方程能够接近满分，那么我认为，接下来的课程没有什么能够阻止我拿到高分了。对于许多同学来说，现在可能还是“望其项背”，不久的将来将是“望洋兴叹”。同时，学校里的基础课程学扎实了，竞赛上的突破是迟早的事情。做学问出成绩这件事情，往往是不能急的，很多时候都会在路上遇到许多坎坷和挫折，但认真地坚持下去，之前种下的种子，都会在不经意之间开花结果，一旦绽放，便是异常的璀璨。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"调和分析初探","slug":"life-20","date":"2023-03-05T07:14:58.000Z","updated":"2023-03-05T07:40:59.305Z","comments":true,"path":"2023/03/05/life-20/","link":"","permalink":"https://nju-kevin.github.io/2023/03/05/life-20/","excerpt":"","text":"今天在主要看了点调和分析，一则分析学选讲课程需要，二则我本人对$Fourier$分析、调和分析方向比较感兴趣，而且由于发现寒假学习的$Fourier$分析是“幼儿园版”的$Fourier$分析，对此我也不甘现状，并认为应该多了解一些更现代的分析学（事实上我目前觉得现代的东西还是古典的）。最近发现图书馆里有不少英文版的数学书，其中也找到了不少我只有电子版的书籍，这让我很是欣慰。英文原版的数学书一则价格不菲，二则大多体量庞大，因此一般我不会选择购买纸质书，但是图书馆中的纸质书则给我提供了很大的方便，这些书并不是借阅热门，这也使得我并不需要借走，而可以在来图书馆的时候参阅进行学习。 今天看的$Fourier$分析明显与“幼儿园版”的不同，并且介绍了$L^p$空间与弱$L^p$空间的定义，其上范数的关系是由$Lebesgue$可积函数的分布函数所给出的，弱收敛的定义也与$Rudin$上的相同，只不过$Rudin$上并没有提出分布函数这一个概念。另外还介绍了$L_{loc}^p(\\mathbb{R}^n)$空间，这里面的可积函数的意义是在任意紧子集上可积，这个空间包含的函数更多，因为条件更弱。令我比较震惊的是，两个$L^1$上的函数的卷积竟然是定义在拓扑群上的，卷积给出的定义式则带有群的特征，这种更一般的定义令人称赞。局部紧致的拓扑群上有一个测度，叫做$Haar$测度，计算卷积使用的测度都是使用的拓扑群上的$Haar$测度。 不得不说，调和分析中的确有许许多多令人震惊的结论，而这些结论往往与基础课程实分析，复分析有着紧密的联系。因此分析学就是这样的一门学科，每一门学科都很基础，却每一门学科都始终让你有一种没有穷尽的感觉，即使是最基础的数学分析也是如此啊。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论变换角度看问题","slug":"life-19","date":"2023-03-04T13:47:35.000Z","updated":"2023-03-04T14:06:55.571Z","comments":true,"path":"2023/03/04/life-19/","link":"","permalink":"https://nju-kevin.github.io/2023/03/04/life-19/","excerpt":"","text":"今天主要都在写作业，这听上去似乎有些不可思议，然而事实的确是如此。复分析第一章课后26道题目，老师大概布置了七八道，然而对于英文教材，我向来是不惮付出巨额的努力去学学透的，因此我把26道题全部做了。大体而言，第一章的课后习题并不算难，可以当做练练手的题目，但我必须得承认，许多外国教材写的确实比国内的教材好。从题目的设置就可以看出来，$Stein$的教材习题不算难却每一道都有很高的训练价值，许多题目后给出的提示既能够对解题起到启发作用，也能对于知识结构的掌握进行巩固，我认为这样的课后习题才是真正有价值的习题，以至于我不想错过任何一道题目。做完之后也的确没有让我失望，加深了我对复分析的基础知识的理解。 今天傍晚的时候顾允淇来南大看了看，我请他在九十吃了顿饭。作为南师大的学生，来到南大对南大的一草一木都连连称赞。我不禁思考这样的问题，会不会是由于我每天都在南大校园里，从而没有发现南大的美呢？很多时候，身处其中，反而会被遮蔽，跳出去之后再回看，往往能够看到许多别的东西。平时我觉得很平常的事物，今天经他这么一夸赞，我突然觉得，好像的确是这样。校园里的确有很多美的事物，我之前没有这种感觉，第一可能是我习惯了校园里的风景，出现了审美疲劳，就好像天天住在旅游景区，或许也不会觉得多么有吸引力；第二可能是每天都是匆匆赶路，没有好好地停留下来看过一些事情，今天晚上却让我有了一个机会，慢下来，认真地看看校园里的一草一木，看看那些之前没有注意到的小细节。事实上，学习之余，看看学校里的花花草草，在操场上跑跑步，这种生活是多少人所向往的！美不一定都在校外，校内其实最美。晚上跑完步很累，但在我的筋骨得到活动以后，整个人都愈发充满了活力。 实际上，发现校园里的美就是一种角度的变换。以访客的身份看南大，或许真是美如画的一个学校；而以一个在南大上了很长时间学的学生的视角，可能觉得南大远没有校外的景点有趣。后来做概率论作业的时候，变换角度的思想也在不断得到运用。往往我们计算一个模型的概率的时候，不一定要从正面算，有时先算反面会获得奇效；或者寻找这个模型的等价模型，而等价模型会更容易计算，从而算出原来的模型的概率。学会变换角度，不仅能够让我们对于学习上的一些问题有新的看法，更能让我们走出一些人生的死循环。跳出条条框框，变换看问题的视角，数学上所采用的方法思想，何尝不是人生的哲理呢？","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论我的学习价值观","slug":"life-18","date":"2023-03-02T23:57:16.000Z","updated":"2023-03-03T00:58:40.623Z","comments":true,"path":"2023/03/03/life-18/","link":"","permalink":"https://nju-kevin.github.io/2023/03/03/life-18/","excerpt":"","text":"昨天晚上和一个女同学聊学习价值观的时候，观念发生了一些碰撞。因此写这篇文章的目的是，对于我现阶段的学习观念进行一个概述，以及我为什么采用目前的这套价值观体系。 事实上，上大学以来，我的学习价值观也发生过变化，有的时候甚至是重大的变化。例如，大一上学期的时候，我还没有完全适应大学的生活，一心学习几乎没有社交；大一下的时候我便把我的重心放在了社交方面，这却导致我的学习变成了一团乱麻。暑假的时候我有认真思考过，到底哪一种是我更想要的，我觉得学习成绩的退步让我在今后的升学中处于劣势状态，因此我决定开始缩减社交在我生活中的占比。大二上开始我渐渐开始寻找学习与社交的某种平衡，这其中也包括了反复试错，如何在不影响学业的前提下进行有意义的社交。到目前阶段，我在数学的学习中找到了兴趣，社交也只是固定几个能谈得来的朋友了，但我觉得也很开心，每天学到很多的知识让我倍感充实。 昨天晚上我和同学交流的主要概括为如下几点（前提的也强调的很清楚，这只是我的建议，不必完全采纳，也不必全盘接受）：第一、学会实时调整自己的学习状态。当自己感到比较累或者疲惫的时候，干点其他有意义的事情，比如写些东西，运动，看看文学小说书等等，目的是为了更好地投入专业课的学习中，适当的休息是必要的；第二、要有明确的目标。不仅要有大目标，还要学会把大目标“切切小”，比如一个学期想干点什么事情，或者这个礼拜想干些什么事情；第三、要学会合理规划自己的时间。时间大家都是一样的，浪费掉的时间再也回不来了，我的建议是把零碎的时间也利用到学习上，打游戏或者看视频这些时间也就过去了，但这个过程中却不能学到什么，别看零碎时间短，利用好的话能学到不少东西的；第四、学会从自己的专业课中找到乐趣。我认为，源于学习的乐趣是最为长久的，这比任何物质的、娱乐的乐趣都要持久，并且能持续给自己充实感。而学习中的乐趣哪里来，首先要能够“钻”进去，只有看懂了才会有乐趣，否则如果看不懂哪里来的乐趣呢？一旦发现自己能看懂，有乐趣，那便是一个良性循环。 以上大概是我昨天对那位女同学所说的，具体我也举了不少例子，费了不少口舌。我的目的也不是为了说服她，只是为她提供一种思路，因为她说感觉什么事情都不想干。我认为有这种感觉首先得承认有考试周的作用。考试周结束以后本来紧绷的弦突然松了，的确会感到无所适从，这是正常现象。但如果松的时间太久，想要紧就紧不起来了，我从这一现象中，其实更看到了这种恶性循环，连锁反应，更何况她也感觉这个学期任务还挺重的，长期以往容易任务越积越多，越多反而越不想做的情况。为了避免让她出现这种情况，我便向她提出了如上四点建议。 本来我也是想让她参考参考，但后来发现很无奈，她不太能接受我的学习方法。具体我问她是为什么，她则表示，自己的兴趣并不全在学习上，自己的专业是化学生物，但对地理的感兴趣程度要大于专业课；同时，她认为每天都要学专业课，过于循规蹈矩，不喜欢这样日复一日无聊的日程，从而想干些别的事情；另外，她还认为，我的这种学习思路压制天性。 说实话，听到她的反馈，实在是比泛函分析还要让我心犯寒。虽然我也没打算让她接受我的学习价值观，但是可能有这样的价值观的人还是太少了。首先，我并没有说让她把全部时间花在学习上，我只是说重点宜放在学习上，因为她也想要研究生考出南大，那难道不努力就能考出南大吗？除非去南大下面一些的学校，比如去一些好一点的985高校，那可能确实不需要多努力。其次，她说兴趣在地理上，那现在其实我都觉得她过的应该挺累的。现在再去转专业不是很现实，而自己学的东西却没有足够的兴趣，她也说对化学有兴趣，但没有地理多，那就好像是，自己是一个修车工，但同时又对造轮船更感兴趣，那作为一个修车工，不多钻研自己的工作，又如何能把自己的本职工作做好呢？其次，她说每天的学习都循规蹈矩，觉得过于刻板，我认为这说白了就是，她想干别的事情了，比如出去玩，出去吃饭，出去看电影等等。这实际上还是她没有真正在学习上找到乐子，觉得每天学化学很辛苦，而她的内心向往自由，向往自然，不想整天看着死板的化学书。我其实也能够理解，但作为我来说，尽管我每天学的都是数学，但学的内容也是不一样的，为什么会觉得循规蹈矩呢？这个时候过自由的生活，不好好努力，以后就会被工作，被生活拘束。最后，她表示我这样的学习方式很压制天性，她一说出来我就立刻明白了，她和我不是一路人，至少在学习方面。每个人确实有每个人的学习方法，但很多时候，都是需要花时间的，我并不觉得我每天早起用功读书是在压制我的天性。又没人来逼我，我自己也没有逼自己，我要是自己逼自己那过不了多久就坚持不下去了。而且我现在这样看上去是需要超凡的毅力，然而我自己心里最清楚，找到学习的乐趣之后，学习是一件很快乐的事情，每天的规律作息养成习惯了就不难坚持了。有的人出去玩出去旅游觉得很开心，我每天学习照样很开心，难不成非得出去玩、打游戏、看视频才能开心？记得高中班主任袁小建的QQ签名就是，“身体和灵魂，总有一个要在路上”读书便是灵魂的旅行，这一点恐怕是很多人都无法体会到的罢。 在她对我的学习方法提出质疑后，我也曾怀疑过，到底是不是我的方法出了问题？但我很快就打消了这种念头。虽然我的周围没有和我类似的学习观念的人，但每天在图书馆，都能看到许多熟悉的面孔，我也都能看到许许多多很努力学习的同学，每天早出晚归，甚至到深夜才回来。那他们又是为了什么呢？考试周在图书馆的有很多都是考试抱佛脚的，考完试还去图书馆的，才是把这件事当做习惯的。考试周以后的图书馆明显少了许多人，但每天还是有很多同学在图书馆读书，自习，交流讨论，我也认识很多数学系的同学，对于数学的热情和专注都是一般人所无法想象的。 追求真理的路途注定是孤独的。有些人可以当生活上的伙伴，甚至可以做自己的知己，但即使是知己也不意味着所有观念都会相合。更何况我还有更崇高的使命等待我去完成。时间将筛选出那些真正能耐得住寂寞，能坐得住冷板凳的人，不管别人是否赞同我的观念，我都将坚守初心，坚守理想，即便孤独，亦能从容不迫，始终如一。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Topics in Analysis","slug":"lesson-4","date":"2023-03-02T11:56:11.000Z","updated":"2023-03-02T12:25:38.251Z","comments":true,"path":"2023/03/02/lesson-4/","link":"","permalink":"https://nju-kevin.github.io/2023/03/02/lesson-4/","excerpt":"","text":"这篇文章为课程《分析专题选讲》的课程笔记，主要记录我在学习这门课程时的想法以及与授课老师孙永忠教授的讨论与交流。与该专题的文章一样，这篇文章将每周更新。 第一周第一周为导论课，主要介绍了$L^2(\\mathbb{T})$空间上的$Lebesgue$可测函数的$Fourier$系数的定义，以及$Hilbert$空间完全正交系以及完全正交基的构造，证明了几个$Fourier$级数的性质，例如在$L^2$范数意义下的最佳逼近定理。这次课让我意识到，在寒假里学的$Stein$的第一部著作只能叫做$Fourier$分析的导论，因为它介绍的还是欧式空间上的$Fourier$分析，而没有研究更一般的$Lebesgue$可测函数空间的$Fourier$分析。 课后我问了一下关于$Stein$第一部里的一些内容，也正是这次提问让我真正意识到我其实并没有完全意义上学会$Fourier$分析，也让我再一次意识到这门学科内容的丰富性。 第三周本周的课程从上周未谈完的正交系的完备化入手，其实就是证明三角函数系的完备性。对该定理进行证明后，引入卷积（$convolution$），并且介绍了卷积的很好的性质，即两个函数做卷积以后，遗传了两个原函数中更好的性质，例如一个光滑函数与一个可积函数做卷积之后得到的函数也是光滑的，这种良好性质的遗传性就体现了卷积的作用。引入卷积之后自然可以得到恒等逼近定理，可以取一个良好性质的函数列（其实就是$good \\space kernel$）与一个函数做卷积得到的卷积列的极限在连续点的取值就是原函数在该点的取值，这也是为什么被称作是恒等逼近。 课后我与孙老师交流了三个问题。第一个问题在于一开始对三角函数系的完备化定理的证明中，思路是先对连续函数证明，再对可测函数进行证明。这种证明手法在$Papa \\space Rudin$中屡次出现，于是是否可以使用$C(\\mathbb{T})$在$L^p(\\mathbb{T})$中稠密的性质一句话说明对于$Lebesgue$可积函数也成立呢？对于这个问题，孙老师表示这是一个好问题，并且他也思考过，答案是否定的。因为使用$density \\space argument$的时候是用来逼近要证结论中的函数，但这个问题中，函数出现在条件中，那么用连续函数进行逼近起不到任何效果。我思考了一会也明白了，因为$density \\space argument$往往是对于要证结论中的函数进行逼近会有很神奇的效果，也正因为如此实分析里许多定理的证明也经常使用这个技巧，但如果是条件中的函数，用更特殊的函数进行逼近是起不到效果的。其次，我指出孙老师上课所讲的恒等逼近定理所用的一列函数其实就是所谓的$good \\space kernel$，并且$Stein$书上给出的定义与课上老师给出的定义有着些微的不同，孙老师解释道，他给的定义其实和所谓的$good \\space kernel$的定义是完全一样的，用$Stein$的定义方式可以推出他的定义方式。第三个问题其实是我在复习数学分析C的时候看到一个定理，那就是用鼓包函数与一个函数做卷积可以得到该函数的光滑逼近，我认为那个例子和这里的内容有着密切的联系。然后孙老师指出其实用来逼近$Dirac$测度的函数列就是一种鼓包函数（$bump \\space function$，即具有紧支集的光滑函数），比如说 f(x)=e^{-\\frac{1}{1-x^2}}就是一个鼓包函数，鼓包函数可以视作一个“光滑子”，通过卷积作用在任何函数上都能得到一个光滑函数。此时数学分析C的记忆又开始涌现，依稀记得苗栋很喜欢使用鼓包函数，我也认为我对鼓包函数的理解还不够深刻，因此下次与苗栋交流的时候我也打算请教一下。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"关于学习深度的思考","slug":"life-17","date":"2023-03-01T11:51:06.000Z","updated":"2023-03-22T06:54:21.983Z","comments":true,"path":"2023/03/01/life-17/","link":"","permalink":"https://nju-kevin.github.io/2023/03/01/life-17/","excerpt":"","text":"今天上午把周一的上同调课程作业做完后，眼睛有些干，感觉又得了上学期的干眼症。这次的原因我认为可能还是用眼过度，没有及时休息，加上饮食习惯不够健康，蔬菜水果吃得少，水也喝得少，饮食比较油腻。去校医院配了个眼药水以后滴了几次感觉些微有所缓解。每当这个时候我便尤其地向往身体没什么小毛病能够尽情学习的日子，健康也确实是这样的，拥有它的时候往往不注意，有点小毛小病的时候才意识到还是健康最重要，所以这也启示我们，不管生活上遇到什么困难与挫折，要保持心态良好，身体健康，健康永远是第一位。 下午复习高等代数的时候，孙长旭给我发了一份讲义，是清华大学丘成桐数学英才班的数学分析讲义，我粗略地浏览了一下，发现里面的内容十分丰富，并且的确像传闻的那样，学的深度很深。这份讲义将数分与实分析，泛函分析，Fourier分析完全连接了起来，介绍了$\\sigma$代数，测度的定义，测度的积分，甚至还介绍了泛函分析中算子的谱；Fourier分析部分也介绍了不少应用问题，比如$Dirichlet$问题，热方程问题等。可见，从学习数分开始，清北的学生便已经开始接触大二、大三所学的专业知识了，这也是他们能在丘赛、阿赛等数学竞赛中崭露头角的原因。 文件如下： 这不禁让我思考学习深度的问题。其实学习的深度并不能过于草率地决定，丘班的数学分析的深度也和它的生源质量有很大关系，进入丘班学习的都是高中竞赛的佼佼者，他们的接受能力都远远比普通的学生强，一般的学生连最基本的数分高代（我戏称为“幼儿园版的数分高代”）都学不会，更不可能给数分加深度了。事实上，提高深度的好处就在于能够更早地建立联系，让学生发现数学分析是分析学的基础，它和后面的许多课程都拥有者紧密的联系。更早地学习一些更深层次的理论有助于加深对于数学的理解，这样便可以站在更高的角度上看问题。但同时也有一个基础的问题，学新知识的同时也不能忘记巩固旧知识，只有加强巩固基础，才能让所谓的“深度”具有真正的意义，否则就像是沙子上造楼，沙堆一移动，楼房便东倒西歪了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of De Rham Cohomology","slug":"lesson-3","date":"2023-02-28T05:31:16.000Z","updated":"2023-03-02T11:54:03.565Z","comments":true,"path":"2023/02/28/lesson-3/","link":"","permalink":"https://nju-kevin.github.io/2023/02/28/lesson-3/","excerpt":"","text":"这篇文章是对于课程《从微积分到上同调》的学习记录，将于每次课后更新。《从微积分到上同调》是南京大学数学系石亚龙老师开的课，将从微分形式开始，介绍微分形式的定义，流形上的微分形式以及运算，$De \\space Rham$上同调，向量丛与示性类。 Week 3由于已经有了第一次课的铺垫，这次课首先回顾了外积运算的定义，以及所谓的$\\text{Alt}^p(V)$空间上的$p$重线性函数的运算。然后介绍了外积运算的性质，具有结合律，交换变号率，以及很重要关于如何由$V^*$上的对偶基生成$\\text{Alt}^p(V)$上的基的定理。这个定理对于后面微分形式的定义是极为重要的。然后介绍了外代数的定义以及从$\\text{Alt}^p(W)$到$\\text{Alt}^p(V)$上的拉回（$pull \\space back$）运算. 接下来开始定义欧式空间上的微分形式，欧式空间上的微分形式是$\\mathbb{R}^n$上的开集$U$到$\\text{Alt}^p(\\mathbb{R}^n)$的光滑映射，并且其作用在某一个$\\mathbb{R}^n$上的向量就是对于各个分量求该向量方向上的方向导数。由于之前已经知道了$p$重线性函数空间的一组基，一般的微分形式可以表成 \\omega=\\sum_{I}{\\omega_{I}\\epsilon_{I}}而由简单的计算可以知道 \\epsilon_{I}=dx_{I}于是 \\omega=\\sum_{I}{\\omega_{I}dx_{I}}这样定义的微分形式与数学分析中所讲述的微分形式是一样的，但用外代数的语言描述更具有一般性。同时还介绍了微分形式的外微分： d\\omega(x)(v_1,\\cdots,v_{p+1})=\\sum_{i=1}^{p+1}{(-1)^{i}(D_x\\omega)(v^i)(v_1,\\cdots,v_{i-1},v_{i+1},\\cdots,v_{p+1})}课上的节奏比较快，有些地方当时记下来了但还没来得及仔细思考，上完课九点半就在附近找了个空教室把课堂上记的笔记重新翻看了一遍，之前不太明白的地方瞬间明白了，这不禁让我体会到，课后及时消化的重要性，否则，等时间长了，早就忘记了之前上课老师是怎么讲的了，如果一学期的课都不及时消化，等待考试前便会有许多不会的地方，到那时再去看，很难看懂，并且也来不及了，这就是及时消化的好处。我认为昨天的课程不仅是对我的数学分析和高等代数基础，还是流形的初步知识，都是大有裨益的。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"泛函分析初体验","slug":"life-16","date":"2023-02-27T08:51:47.000Z","updated":"2023-02-27T09:11:45.916Z","comments":true,"path":"2023/02/27/life-16/","link":"","permalink":"https://nju-kevin.github.io/2023/02/27/life-16/","excerpt":"","text":"今天白天没课，因此在图书馆。上午把第一周的泛函分析的作业做了，下午看完了$Stein$的复分析第一章，学习了些关于测度空间上的微积分基本定理的内容。今天给我印象最深的一件事就是泛函分析的确不是那么容易的。还记得之前听课的时候觉得老师上课讲的东西都很$trivial$，因此感觉好像也就那样，结果今天上午一做题就发现，事情远没有我想象的那么简单。 目前泛函分析在介绍基础的点集拓扑（主要是度量空间上的一些性质），做题的过程中就可以发现我虽然说学过点集拓扑，但其实基础并不牢固，这也是我下阶段需要补强的地方。泛函分析就像是上图所示的丛林一般，基本的点集拓扑是大树的根系，而根系与根系之间又是交错、紧密相连的，建立在盘根错节的根系上，树才能长得坚韧不拔，毕竟泛函分析研究线性或者是非线性的算子，而这些算子的作用对象都是空间中的元素，空间与空间之间建立联系，就需要运用更一般的拓扑空间上的映射。而点集拓扑学由于其本身既抽象又具体，既直观又反直观，导致它虽然没有抽象代数那样抽象，但如果凭感觉是完全学不到精髓的，因此我认为在点集拓扑方面还需补强，这是后续分析学的基础，不容小觑。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"抽象代数漫谈","slug":"life-14","date":"2023-02-25T00:24:56.000Z","updated":"2023-02-25T05:56:41.120Z","comments":true,"path":"2023/02/25/life-14/","link":"","permalink":"https://nju-kevin.github.io/2023/02/25/life-14/","excerpt":"","text":"考核周进入尾声，抽象代数和常微分方程一个在考试周最后一天一个在考试周第一天，从这个安排上也能看出数学系的老师们的用心了，即不想让我们有比较多的时间出去玩，这样一方面便于复习，另一方面，也能更好地衔接新学期的课程，毕竟考试周与新学期课程中间并没有缓冲区。 对于近世代数期末考试的重点部分，在这里简要做一下罗列与总结。 Part I 环论基础这一部分主要是介绍环的基本知识，包括环的定义，整环的定义，含幺环的定义，交换环的定义，等等。有一些例子，例如剩余类环，整数环，多项式环，矩阵环等。另外介绍了环的单位（乘法可逆元），单位构成群叫做单位群。比环更强的代数结构是体（$skewfield$）和域（$field$）。如果一个含幺环的非零元都是单位，那么该环为体；如果非零元都是单位且非零元构成$Abel$群（即非零元都可交换），则该环为域。这里提一下，数域是有理数域$\\mathbb{Q}$的有限次扩张。 然后便是环中的一个重要的概念——理想。理想可以与群中的正规子群对应，并且理想中的元素可以用环$R$中的元素的线性组合表示。$R/I$为理想的商环，与群中一样，环中也有环的同态基本定理： \\text{Ker}(\\sigma)\\unlhd R, \\space \\text{Im}(\\sigma) \\leq \\bar{R}, \\space R/{\\text{Ker}(\\sigma)}\\cong \\text{Im}(\\sigma)有这个定理就可以相应地得到同构定理，以及商环的理想等结论。 环之间也有运算，例如环的外直和与环的内直和，外直和是通常的坐标分量定义的方式；内直和的定义则规定了元素表示的唯一性。可以证明，外直和与内直和是等价的。同样的，理想之间可以相乘，即理想的乘积，且若理想$I$与$J$互素，在幺环$R$中有 IJ+JI=I \\cap J从而对交换幺环中的两两互素的理想$A_1,A_2,\\cdots,A_n$，有$\\displaystyle{\\prod_{i=1}^{n-1}A_i}$与$A_n$互素，且 \\prod_{i=1}^{n}A_i=\\bigcap_{i=1}^{n}A_i进而可以导出环中的中国剩余定理： R/(A_1\\cap \\cdots \\cap A_n) \\cong R/A_1 \\oplus \\cdots \\oplus R/A_n对于理想有两个很重要的概念——极大理想和素理想。对于交换幺环极大理想必是素理想，因为素理想等价于商环为整环；极大理想等价于商环为域，而域一定是整环而整环不一定是域，从而可知极大理想一定是素理想（交换幺环中）。全体素理想的交为环的诣零根，对于交换幺环来说，诣零根由全体幂零元构成。 Part II 几类典型的交换环首先是形式幂级数环和多项式环，有一个很重要的性质就是$R$与$R[x_1,\\cdots,x_n]$有着相同的单位群，且若$R$为整环则$R[x_1,\\cdots,x_n]$也为整环。对于多项式，正如高等代数中所述，可以做带余除法，并且任意交换幺环上的对称多项式都可以写成初等对称多项式的多项式。 其次就是$Euclid$整环（$ED$）和主理想整环（$PID$）.$ED$一定是$PID$，这里需要知道如何证明一个具体的环是$ED$.域上的一元多项式环是$ED$，从而为$PID$.在主理想整环上有相伴、不可约元、素元的概念。整环中素元为不可约元，而在$PID$中，不可约元也是素元，因此主理想整环中不可约元和素元等价。主理想整环中有唯一分解定理，其中使用的方法便是很经典的理想升链方法。 对于任意理想升链都满足理想升链条件的环（每个理想都是有限生成的）为$Noether$环，$Noether$环有三条互相等价的结论；并且$Noether$环上的一元多项式环也是$Noether$环（$Hilbert$基定理），从而$n$元多项式环也是$Noether$环（$PID$当然是$Noether$环） Part III 域论域论中的内容有很多，其中需要特别关注的有有限域的性质，域的代数扩张，正规扩张，可分扩张，构造有限域的方法，域扩张的传递性，域扩张的等价条件，域扩张的证明方法，有限域中运用多项式理论的证明方法，以及简单的域的$Galois$理论。这部分内容比较繁杂，因此不再一一罗列。 目前将课本上的证明都过了一遍，接下来打算把冯克勤的课本以及课后习题《近世代数三百题》上面做的题目看一遍，主要是掌握证明的方法。晚上再把课本上的定理以及定理的证明方法过一遍，基本上就算是复习完成了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Complex Analysis","slug":"lesson-2","date":"2023-02-24T01:02:45.000Z","updated":"2023-03-06T06:31:58.087Z","comments":true,"path":"2023/02/24/lesson-2/","link":"","permalink":"https://nju-kevin.github.io/2023/02/24/lesson-2/","excerpt":"","text":"概要这篇文章是对于复分析的学习笔记，不会记录很完整的知识点以及知识结构，但会记录我对于复分析这门课程的各种问题的思考以及一些经典习题的思路与解答。和之前的课程系列的文章一样，这篇文章将会每周更新。 第四周（2023.03.06更新）上周在做$Stein$复分析作业的时候，对于$\\frac{1}{z-a}$沿圆周积分的问题有些模糊，不清楚奇点在圆周包含的区域内与外时积分得到的结果有什么区别，$Stein$上第一章也没有介绍。因此我认为$Stein$的复分析在这方面做的欠妥，当然也有可能是想要放到第二章$Cauchy$定理那里一起讲的缘故，但由于第一章的习题出现了相关的问题，这容易导致学生做题时一头雾水。 上午在看$Papa \\space Rudin$的时候发现复分析部分讲的内容以及顺序的安排更为合理。在介绍完解析函数以及沿曲线的积分之后，直接引入了指标的概念： \\text{Ind}_{\\gamma}(z)=\\frac{1}{2 \\pi i}\\int_{\\gamma}{\\frac{d\\zeta}{\\zeta-z}}可以证明，$\\text{Ind}_{\\gamma}(z)$在$\\Omega=(\\gamma^*)^c$的有界连通分支上是正整数函数，在无界连通分支上为0。有了这个结论，那么 \\int_{\\gamma}{\\frac{1}{z-a}dz}=2\\pi i \\text{Ind}_{\\gamma}(a)因此只要圆周包含$a$，对于圆周内的区域，$\\text{Ind}_{\\gamma}(a)=\\text{Ind}_{\\gamma}(z)$，$\\forall z \\in \\Omega_1$.从而我们可以计算该圆周的圆心关于圆周的指标，这显然是$1$，从而原积分值为$2\\pi i$.如果圆周不包含$a$，即$a \\in \\Omega_2$，那么由于$\\Omega_2$为$\\Omega$的一个无界连通分支，从而指标为零，原来积分也为零。 学到这里，其实我们就会发现，$\\frac{1}{z-a}$这个复变函数沿曲线的积分有着其特殊性。$Cauchy$定理与这个问题有着紧密的联系。这里我们列举一下几个结论： Theorem 10.12 $F \\in H(\\Omega)$ with $F’$ continuous, then for every closed path in $\\Omega$ we have \\int_{\\gamma}{F'(z)dz}=0Theorem 10.13(Cauchy for a Triangle) $\\bigtriangleup$ closed in open set $\\Omega$, $p \\in \\Omega$, $f$ continuous in $\\Omega$, $f \\in H(\\Omega-\\{p\\})$, then \\int_{\\partial{\\bigtriangleup}}{f(z)dz}=0Theorem 10.14(Cauchy in a Convex Set) $\\Omega$ convex open set, $p \\in \\Omega$, $f$ continuous, $f \\in H(\\Omega-\\{p\\})$, then for every closed path $\\gamma$ in $\\Omega$ \\int_{\\gamma}{f(z)dz}=0 以下对这三个定理（以下简称定理1，定理2，定理3）讲的事情进行翻译： 对于一个连续函数$f$，如果能够找到它的原函数$F$，即$F’=f$（特别地$F$全纯）那么该函数在任意闭曲线上的积分为零。 对于开集中的三角形闭曲线，$f$连续且在$\\Omega$中除了一点$p$以外全纯，那么$f$在三角形上的积分为零。 对于凸开集上的连续函数$f$且在$\\Omega$中除了一点$p$以外全纯，那么$f$存在原函数，从而由1知沿任何闭曲线积分都为零。 定理1成立是显然的，有一个很重要的推论： \\int_{\\gamma}{z^n}dz=0, \\space (n \\neq 0)从而对于闭曲线，$z^n$的积分为零。 对于定理2，可以先考虑$p$不在三角形边上的情况，对于三角形进行中点分割，应用闭区间套定理以及定理1的推论；对于$p$为顶点的情况可以对三角形进行划分，应用第一种情形以及$f$在三角形上有界；$p$在边上时，划分为两个三角形利用前两种情况即可。 定理3则是直接构造原函数，很朴素的想法就是$f$的变上限积分，因为集合是凸集，任何两点的连线都完全属于$\\Omega$（这让我想起了《从微积分到上同调》这门课上证明星形区域的一阶上同调为0时所采用的方法是一致的），证明需要用到沿三角形曲线积分为零的性质。定理3可以直接推出凸集上的$Cauchy$积分公式： f(z)\\text{Ind}_{\\gamma}(z)=\\frac{1}{2\\pi i}\\int_{\\gamma}{\\frac{f(\\zeta)}{\\zeta-z}}$Cauchy$定理的逆定理（$Morera’s \\space Theorem$）也是上述定理的直接推论。它论述的是如果开集中的连续函数沿开集中的任意三角形曲线积分为零，那么该函数在开集中全纯。证明也是容易的，可以同样利用变上限积分构造原函数，方法与定理3没有任何区别。定理3由于是凸开集，从而开集中的连续全纯函数沿三角形积分为零，这里可以考虑凸开子集，三角形积分为零为条件（此时不能利用定理2的结论因为$f$ 不一定全纯），从而可以找到原函数$F$，$F$全纯。全纯函数的导函数仍然全纯（因为全纯函数与解析函数没有任何区别，解析函数可逐项求导且得到的导函数仍解析，从而全纯），于是$f$在任意凸开集中全纯，从而在$\\Omega$中全纯。 接下来对于以上所述进行总结。问题的引入是一道$\\frac{1}{z-a}$的作业题，这个积分有可能不为零的原因是，复分析中$\\frac{1}{z}$没有原函数！这与实值函数不一样。连续函数一旦有了原函数，沿闭曲线的积分便为零。我想正是由于这种特殊性，才会引入所谓的指标的概念，进而研究指标的计算和性质。有了指标的概念与性质，让$\\frac{1}{z}$沿闭曲线的积分的可算度大大提高，很多时候也能够简化计算。对于开集上的连续全纯函数（允许在某一点不全纯），沿三角形的积分为零；反之，对于开集上的连续函数，若沿任意三角形积分都为零，那么该函数全纯。对于凸开集上的连续全纯函数（允许在某一点不全纯），存在原函数，从而沿任意闭曲线的积分为零。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"Study of Probability","slug":"lesson-1","date":"2023-02-24T00:09:22.000Z","updated":"2023-03-28T13:32:54.257Z","comments":true,"path":"2023/02/24/lesson-1/","link":"","permalink":"https://nju-kevin.github.io/2023/02/24/lesson-1/","excerpt":"","text":"概要这篇文章（math-8）将记录在《概率论基础》这门课程中我对于一些问题的看法以及对于习题的解题思路，与之前一篇关于$Papa \\space Rudin$的类似，并将每周更新。 第一周第一周课程的内容并不算多，介绍了概率空间的最基本的三个量：样本空间$\\Omega$，概率的定义域$\\sigma-$代数，以及概率测度。同时简单介绍了测度的性质，只要学过$Papa \\space Rudin$第一章，那么学起来便丝毫不费力。需要注意区别的是概率测度和一般的正测度不一样，因为全空间的概率测度必为1. 第一周的作业并不算难，课本第8题简单利用二项式展开的性质即可证明；第33题最好的方法是利用求和式证明，而不是省略号，这样显得不严谨，以下写一下33题的证明过程。 Prove that \\begin{aligned}P(A_1 \\cup \\cdots \\cup A_n)=&\\sum_{i=1}^{n}P(A_i)-\\sum_{1 \\leq i","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"小作业里的大乾坤","slug":"life-13","date":"2023-02-23T13:33:26.000Z","updated":"2023-02-23T13:56:20.841Z","comments":true,"path":"2023/02/23/life-13/","link":"","permalink":"https://nju-kevin.github.io/2023/02/23/life-13/","excerpt":"","text":"今天是考试周的思政日，图书馆，教室，休息区沙发…凡是能看到学习的学生的地方，就一定有背书的同学。背书，说实话，并不是一件令人开心的事，然而好在我的记忆力尚且可以，对于思政课的考试重点内容，背起来仍是不费力，可以说，我在考试前做了充分的准备，毕竟背了三个半天。考试时答题也自然是畅通无阻，心中不禁再一次感叹，考前的认真准备就是为了考试过程的轻松以及考试结果的理想。准备得累一点，考试就会轻松一些，从而成绩也就会更好看一些；如果在准备的时候偷懒，贪图享受，那么考试的时候便会给你眼色看，考试结果更会是一种打击。 之前便强调过，平时的认真听课，认真作业，考前的认真复习，都会考试过程，以及相应的考试结果。我一直相信，平时偷的懒，考试的时候会加倍奉还。与其平时偷懒享乐，不如考试结束以后放松，这样不仅得到了放松，还得到了理想的成绩，何乐而不为？当然这学期是特殊情况，促使我考完后也不能过于放松，还得按照平时的标准要求自己。 晚上在教室把概率论的作业做了，看似只有三道题，然而我却发现这小小的作业之中竟然藏着大乾坤。作业并不算很难，但有些关于组合数的知识点由于太久没用有了遗忘，本想查查资料，但我转念一想，作业可以做的慢点，因为作业的快慢其实影像不了什么，然而作业的独立完成度却能产生很大的影响。作业不独立完成，就失去了一次独立思考的机会，长期以往，独立解决问题的能力便会大大下降，如何能在考场上解决那些没遇到过的问题？因此，遇到不太会的题目，总想着查资料是致命的。事实上，即使是对于$Papa \\space Rudin$上面每一章都有很多道题不会做，我也不会因为不会做而立马翻看答案，而是不断翻阅定理笔记想想自己能够写出点什么，我坚持这样做的原因就是我做的每道题都是一次给我独立思考的机会，如果急于查询答案那么就失去了这次思考的机会，我认为这是万万不可的。哪怕一开始做的慢点，但长期以往解题能力就能切实提高；否则，下次遇到没有答案的题目就只能干瞪眼，是何等的可笑！ 就拿晚上做的概率论作业为例，关于组合数的题目我一开始思考的方向有误，后来考虑多项式的二项式展开以后问题便迎刃而解；再比如证明概率公式，一开始我用的是逐项验证，写出来之后我当然知道它是对的，但求和用省略号写出的证明看上去总有些不让人信服，于是我在做完之后，又尝试了另一种解法，那就是用求和号写出来，用求和变换证明。这样会显得过程较之前复杂很多，但每一项都能够很清楚的算出来，而不是用省略号省略掉了。在这个过程中我也锻炼的求和变换的能力，我认为是大有裨益的。做完这三道题，不知不觉过去了一个小时，然而这一个小时我的收获却远远不止听上去的这三道题这么简单，不禁感叹，小作业里真的有大乾坤，只有认真做才会发现。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Papa Rudin I","slug":"rudin-2","date":"2023-02-22T00:12:00.000Z","updated":"2023-03-02T11:55:41.997Z","comments":true,"path":"2023/02/22/rudin-2/","link":"","permalink":"https://nju-kevin.github.io/2023/02/22/rudin-2/","excerpt":"","text":"第一遍看$Papa \\space Rudin$的时候，急于求成，只看概念和定理不看定理的证明，当然也有当时对于数学的理解不够深入，基础不够牢固的缘故。因此，第一遍学习并没有起到多大的效果，甚至学到测度的微分的时候连$Lebesgue$测度还不熟悉，还不清楚是什么，现在想起来真是可笑至极！ 过了一年后再看，明显感觉理解力不一样了，这一遍我对于定理的理解，证明极为重视，同时也做每章后的练习题加以巩固，不再盲目追求速度，而是多加思考不同的概念，不同的定理之间的联系与区别，发现这个过程中能够加深不少理解。 今天浅谈一下我对于最近学的几个定理的证明的理解。 Theorem 6.16这个定理讲述的是$L^p(\\mu)$与$(L^q(\\mu))^*$之间存在一个一一映射($\\frac{1}{p}+\\frac{1}{q}=1$)，即 \\Phi(f)=\\int_{X}fgd\\mu且 ||\\Phi||=||g||_q其中$\\mu$为$\\sigma-finite$的正测度，$\\Phi$为$L^p(\\mu)$上的有界线性泛函 这里只说一下我认为比较重要的主干部分。证明的核心是利用$Lebesgue-Radon-Nikodym$定理（LRN），而LRN结论的适用范围也很重要，LRN是说，对于$\\sigma-finite$的正测度，如果有一个复测度$\\lambda$与$\\mu$是绝对连续的(absolute continuous)，则可以找到一个$L^1(\\mu)$上的函数使得 \\lambda(E)=\\int_{E}hd\\mu因此首先需要找到一个测度使得与$\\mu$绝对连续，然后运用LRN可以得到一个$L^1(\\mu)$上的函数将该测度联系起来。令 \\lambda(E)=\\Phi(\\chi_E)这个测度满足LRN的条件，同时还将测度与要证的泛函联系起来了，这是一个很值得学习的技巧。 得到这个表示以后，我们便有 \\Phi(f)=\\int_{X}fgd\\mu首先是对$f$为特征函数成立，接着便是对简单可测函数成立，从而对$f \\in L^{\\infty}(\\mu)$成立。这个时候$f \\in L^{\\infty}(\\mu)$，$g \\in L^1(\\mu)$ 我们最终要得到$f \\in L^{p}(\\mu)$，$g \\in L^q(\\mu)$. $p=1$的情况比较好做，$1&lt;p&lt;\\infty$时使用的一个小结论便是 对于任何可测函数$f$都存在一个可测函数$\\alpha$使得$|\\alpha|=1$以及$\\alpha f=|f|$ 然后在证明了 ||g||_q \\leq ||\\Phi||后就可以得到$g \\in L^q(\\mu)$.接下来是另一个很重要的证明技巧，之前得到的等式只是对$f \\in L^{\\infty}(\\mu)$成立，如何进一步到对$f \\in L^{p}(\\mu)$成立是很关键的一步。这里使用的方法是，等式两边分别都是$L^{p}(\\mu)$的连续函数，而两边在$L^{\\infty}(\\mu)$中是相等的，又由于$L^{\\infty}(\\mu)$是$L^{p}(\\mu)$的紧子集，因此由这一点便可以得到两边在$L^{p}(\\mu)$上也相等。 另外证明中还使用了一个如何由一个$\\sigma-finite$的但$\\mu(X)=\\infty$的正测度出发构造一个$\\sigma-finite$的且$\\tilde{\\mu}(X)&lt;\\infty$的正测度： d\\tilde{\\mu}=wd\\mu$w$为Lemma 6.9中的函数. Theorem 6.19这是复测度的$Riesz$表示定理，需要注意的是，$\\Phi$为$C_0(X)$上的有界线性泛函，$\\mu$为regular的复Borel测度，有 \\Phi(f)=\\int_{X}fd\\mu且 ||\\Phi||=|\\mu|(X) 同样的，这里只讲述我认为重要的部分。其实大致思路就是和正测度的$Riesz$表示定理做联系。需要注意的是原本的$Riesz$表示定理的条件是对于正测度$\\mu$以及$C_c(X)$上的正线性泛函.可以看到这三个定理的条件都不一样，Theorem 6.16将正线性泛函推广为有界线性泛函，并且将泛函的作用域由$C_c(X)$推广到了$L^p(\\mu)$上。而复测度的表示定理将作用域由$C_c(X)$推广到了$C_0(X)$上，这一点就启示我们，在证明复表示定理的时候可以利用Theorem 6.16. 首先将$\\Phi$用一个正线性泛函限制，对于这个正线性泛函就有一个正测度$\\lambda$与之对应，并且同时我们还可以发现这样以后$\\Phi$的作用域可以由$C_c(X)$推广到$L^1(\\lambda)$上，于是这时运用Theorem 6.16 的结论，有 \\Phi(f)=\\int_{X}fgd\\lambda但需要注意的是，这里的$f \\in C_c(X)$，因为刚才我们只是把$\\Phi$延拓到$L^1(\\lambda)$上，但$f$并没有延拓。这个时候考虑到$C_c(X)$是$C_0(X)$的紧子集，运用之前那个证明方法便可以让$f \\in C_0(X)$. 需要注意一下，在找限制$\\Phi$的正线性泛函的时候，需要验证几个基本条件，在证明 \\Lambda(f+g)=\\Lambda f+\\Lambda g的时候运用的方法与正线性泛函的$Riesz$表示定理是类似的，可见基本定理证明方法的重要性。","categories":[{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]},{"title":"数学分析学习体验与心得","slug":"life-12","date":"2023-02-21T05:40:09.000Z","updated":"2023-02-22T00:05:17.514Z","comments":true,"path":"2023/02/21/life-12/","link":"","permalink":"https://nju-kevin.github.io/2023/02/21/life-12/","excerpt":"","text":"上午十点，随着试卷提交，三学期的数学分析课程算是画上了一个圆满的句号。突然要告别数学分析这门课，内心却生出一丝不舍。先大致说一下试卷的题目吧： T1 计算$e^{-x}$作奇延拓和偶延拓之后的Fourier系数并求和 \\sum_{k=1}^{\\infty}\\frac{(-1)^k(2k-1)}{1+4k^2}T2 计算一个简单的重积分 T3 三角级数收敛性判断 T4 计算一个广义积分 T5 $Fubini-II$证明（利用exhaustion即可） T6 证明题（利用$Parseval$等式） T7 三重积分的计算（取正交变换后极坐标换元） T8 凸分析（我直接用了局部紧的$Hausdorff$空间的结论，可以解决题目的部分情况） T9 六维欧式范数意义下的$Heisenberg$测不准关系 如今回想，脑中不禁浮现一个个上课时的画面，那些听课的场景不知为何让我感受到很温馨，可能这世上最令人神往的事情，便是在一个阳光明媚的午后，一本笔记本，一支笔，一间教室，听一位老师讲授数学分析了。 这三学期其实也确实做到了善始善终，在这个过程中，我也走过许多弯路，但我认为这三学期对于我的人生来讲，甚至都具有着非凡了意义，可以说，数学分析见证了我的成长，不仅是在数学水平上的成长，更有人生观念方面的成长与进步。第一学期的数学分析不难，一开始都学得很认真，但由于内容不难从而开始掉以轻心，导致高开低走；第二学期更是如此，心思没有放在学习上，数学学习变成了考前突击，也是有周围人影响的原因，数分B其实学的很不扎实（尤其是多元微积分），很多东西连最基本的概念都不明白，更不要说做题目了；大二开始或许也有在数分B上吃了苦头的缘故，上苗栋的课程的时候特别认真，上课笔记都记了好几本，并且不断减少上课摸鱼的时间，加上也有几件好消息（例如CMC考了比较好的成绩），这些都让我重新端正态度进行学习，一个学期之后发现，当我认真地钻进去以后，能够学到不少东西，能够看到问题背后的本质，考试复习的时候，也不需要考前突击，而是通过平时的积累，强化记忆即可。当然，我也注意到实际上我的学习方法还有待完善，很多时候笔记没有及时消化，这我也做过反思。 纵观数学分析的内容，其实真的很丰富。单是主干知识就涉及到了非常多的概念，运算方法和技巧。从庞杂的定理，以及定理的证明中我们都能学到丰富的证明技巧，更不要说定理的应用，推论，推广。可以说，如果能真正学好数学分析，那么对于以后的课程，也都能够融会贯通。而且梅加强的数学分析教材中的内容实际上是“真包含”数学分析的，里面还补充了很多数学分析与实分析、复分析、流形几何、点集拓扑、上同调的衔接知识，因此我认为如果能把梅加强的内容掌握，是可以让自己的水平提高一个档次的，这也是为什么我决定利用这个学期的一些时间把梅加强的数学分析再精读一遍，因为这样便可以得到“加强”的数学分析，而不是“梅加强”的数学分析。 学习数学分析的时光是很快乐的，虽然在学习的过程中遇到阻力和困难是家常便饭，但我最终还是走过来了，数学分析将成为我的有力的工具，帮助我开辟前路的荆棘，我定会将其妥善保存，内化于心。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"温故而知新","slug":"life-11","date":"2023-02-20T11:26:27.000Z","updated":"2023-02-20T12:46:48.129Z","comments":true,"path":"2023/02/20/life-11/","link":"","permalink":"https://nju-kevin.github.io/2023/02/20/life-11/","excerpt":"","text":"今天复习了一天数学分析，上学期由于笔记记得很认真，因此复习的时候发现内容还是很多的，即使苗栋已经通知有三部分（变量代换公式的证明，Fourier变换和特殊函数）不考，然而除开这三部分的内容也非常丰富。在看笔记的时候，偶然发现很多之前所未能完全理解的东西，或者是已经理解了的东西，在这一次看又有新的收获，这同时也体现了苗栋的数分课有着足够的深度和广度，值得反复参考。 在Fourier级数一块，不仅有最原始的定义，点态收敛和一致收敛的条件，苗栋还介绍了一般的$Parseval$恒等式以及其应用，可以说，正是介绍了该等式的应用，才让我意识到许多问题都可以换一个角度，从Fourier级数的角度进行思考。此外，从函数的Fourier系数与其导数的Fourier系数的关系出发，对于Fourier系数的估计能与原函数的可微性建立联系，进而得到一个连续函数实解析的充要条件。在Fourier级数的应用方面，介绍了等分布，以及等分布的等价条件，以及无理数的倍数的小数部分在$(0,1)$上是等分布的重要结论。 含参变量积分部分，苗栋首先系统地介绍了不同条件下，一致收敛，求导可换序，可逐项积分等的条件（由$Dini$定理和一致收敛保持连续性的定理也可以看出一致收敛是比连续性更强的条件）；另外也提及了比较重要的几个积分：$Laplacian$积分，$Fresnel$积分等。 广义重积分部分，从容许集（$rectifiable$）到集合的穷竭（以及欧式空间的开集都有穷竭这个重要结论），还介绍了$\\mathbb{R}^n$上的$Laplacian$算子的球坐标与直角坐标的转化公式（听课的时候认为很震撼！）.这部分主要就在于坐标变换公式，也需要结合高等代数的知识（例如正定对称矩阵可正交对角化），变量替换公式是核心。 这次复习除了加深巩固了基础知识，我还注意到苗栋课上讲过的一个定理： \\exists f \\in C_{2\\pi}，其Fourier级数在某处发散 想起来$Papa Rudin$的第五章$Banach$空间中就讲过类似的问题，而其证明需要用到泛函分析四大定理之一：$Banach-Steinhaus$定理（也称“共鸣定理”，语出秦理真）.苗栋在课上证明的是存在一个函数，在$x$处的部分和发散，巧妙地利用了周期函数空间这个$Hilbert$空间上的范数进行了证明，其过程除了因为数学分析的限制不能应用共鸣定理以外都是相同的，甚至苗栋的证明过程对$Papa Rudin$上还算有所补充，那就是如何对$\\text{sgn}\\{D_N\\}$用连续函数逼近，$Papa Rudin$上没有说明直接跳过，而苗栋使用的方法也很经典，巧妙地运用了数学分析书本上的一处知识，那就是一个连续函数和一个鼓包函数（$bump function$）进行卷积（$convolution$）可以得到该函数的光滑逼近！从而，利用共鸣定理，可以将苗栋所讲的定理进行推广，实质上是，给定任意的$x_i$，都可以找到连续周期函数空间$C(\\mathbb{T})$中的一个稠密的$G_{\\sigma}$集，使得在这个$G_{\\sigma}$中的函数在给定的$\\{x_i\\}$处都发散！ 随着学习的深入，对于过往的知识的理解也会加深，这其实也是我决定利用这学期的一些时间打好数分高代解几等课程基础的原因，也只有多思考，才能发现数学中的许许多多的乐趣。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"数据库概论漫谈","slug":"life-10","date":"2023-02-19T08:24:54.000Z","updated":"2023-02-19T09:07:51.439Z","comments":true,"path":"2023/02/19/life-10/","link":"","permalink":"https://nju-kevin.github.io/2023/02/19/life-10/","excerpt":"","text":"今天白天大多时间都在复习数据库，准备晚上的考试。复习的过程中，发现数据库其实是一门很实用，很应用的学科。而且和C++不同，数据库理论与实验并重，数据库中有很多概念，从数据库的结构，到数据模式，模型，再到具体的一些对象，例如数据库，数据表，事务，规则，约束，游标，函数，索引，视图，触发器，存储过程等等，每一个对象都有着其独特的作用和语法结构。 理论部分比较重要的有：E-R图和关系模型的转化，关系模式的规范化（第一范式为属性不可拆，第二范式为非主属性必须完全依赖与关系中的所有主属性；第三范式为关系模式中不能有传递依赖）。 实验部分的代码与C++有类似之处，但仍有许多不一样的地方，比较重要的有：建库，建表，查询语句（内连接，左外连接，右外连接，交叉连接，除法），对数据库，数据表的修改和删除，建立索引，建立视图，自定义函数（标量函数，表值函数，多语句表值函数，以及SQL中常用函数的用法），建立触发器（Insert，Delete，Instead of，After），建立存储过程（利用游标读取） 大致来看，内容还是有些杂的，并且不同的对象有不同的语法，但对于不同的对象的理解有助于我们记住相应的语法，例如，索引是建立在某张表的某一列上的，于是建立索引的时候就需要 create nonclustered index on student(sid) 而视图是一张虚拟表，于是建立视图时的代码为 create view view_1 as select ... from ... where ... 创建函数的时候，如果函数需要输入参数，需要用变量的形式列出并附上数据类型，例如 create function my_function(@score int) returns char(2)/table/@ftable table(...) as begin ... end 游标也有其格式，声明游标变量时， declare @cur cursor set @cur = cursor for select... open @cur fetch next from @cur (into ...) while @@fetch_status = 0 begin ... fetch next from @cur (into...) end close @cur deallocate @cur 触发器是建立在表上的，在写触发器的定义的时候，注意有两张很重要的表：Deleted表和Inserted表。当执行检查操作不允许时，要执行rollback transaction操作，例如 create trigger tri on student after insert as if ... ... rollback transaction else ... return 具体的操作需要结合题目要求进行完成，写函数的过程其实与C++编程类似，循环的边值问题等常见的“坑”同样也是需要多加注意的地方，由于是纸质书写，所以无法运行，这就需要具备“人工编译运行”的能力，这一点也是与C++类似的地方，但总体而言，代码的思维量不及C++多，但细碎的地方，需要注意的小细节会更多，这么看，数据库实际上还是一门很友好的程序课。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"买书与读书的纠缠","slug":"life-9","date":"2023-02-18T10:37:59.000Z","updated":"2023-02-18T11:09:51.295Z","comments":true,"path":"2023/02/18/life-9/","link":"","permalink":"https://nju-kevin.github.io/2023/02/18/life-9/","excerpt":"","text":"考试周正式开始。关于白天考的两门学科，我认为，ODE的出卷是比较正常的，也考察的尽可能全面了（虽然并没有涉及适定性以及流的相关内容），计算题思考量不算大，但计算量还是很充分的（但是最后一道计算题对三阶矩阵求逆显然是没有时间算的类型）。证明题第一道类比Wronski行列式的公式 W(x)=W(x_0)e^{\\int_{x_0}^{x}tr(A)ds}第二题考察$Green$函数以及利用压缩映像原理证明不动点，难度不算大。以往考完试以后我便会在很长一段时间内，再也不看这门学科，甚至彻底扔掉。但这次我不打算这么做。在考试周结束以后，我打算对ODE的学习进行深入和强化。ODE是分析学中很重要的一个方向，涵盖的内容不仅仅是解方程，更有关于方程背后更一般的理论的探索。经过上个学期的ODE的学习，我现在对于一般的常见方程的求解方法以及关于适定性，边值问题的部分有了了解，进一步，我将对更一般的方程的解法，复微分方程系统，以及包括$Sturm-Liouville$特征值问题在内的丰富内容进行更完整的学习。 大学物理的卷子，可以看出肖明文老师为了避免同学们只做样卷的现象做出了一些努力，即思路仍按照样卷，但是细节部分做出了改动，比如粒子没有给夸克的组成，单位换算的一些常识没有给出等等。在考场上，因为这些改动，我也颇费了一些功夫，最后得出了一个我自认为正确的结果。随着数学学习的深入，我已经能够很明显地感受到数学和物理之间风格的不同了，并且潜移默化中更能接受数学的那一套理论，不过我认为这只是由于对于物理我并没有花太多的时间，导致看到所谓的$Schrodinger$方程等等觉得不够美观。物理的理论框架最终还是需要数学来进行搭建。 说了这么多，其实都是为了引出今天想讨论的一件事情，那就是买书和看书 的纠缠。为什么说是纠缠，因为这或许是很多人在学生时代所会经历过的一种幻觉，那就是由“我买了很多书”自然而然得出“我会看很多书”。考完试看到舍友买了Stein的分析四部曲（分析学经典名著，即Fourier分析，复分析，实分析，泛函分析），且不论这四本书总价高达二百五十元，光是把这四本书啃下来，就足够花时间的了，更不要说能够掌握其中的精髓。当时我对他肃然起敬。等他走后，我无意中看到了他的书架，上面的书大多是崭新的，除了刚买的Stein四部曲以外，还有两本中文的《实变函数与泛函分析》，以及一些其他的参考书。 再说一个例子，我的一个数学系同学，这学期光是报名选修课就报了五门，其中三门还在鼓楼，每周三每周五都要从仙林做地铁去鼓楼上课。如果我只是说到这，你可能会很佩服他的毅力。然而，事实却是，课内的考试来不及复习，一些参考书都只是看了前几章，学的东西是很多，很杂，但基础还没打好，便迫不及待在摇摇晃晃的地基上建立高楼大厦。 我说这两个例子的目的并不是为了批判什么，而是这两个例子让我思考，现在的学生都有一个通病，就是急功近利，好高骛远，耐心不够。为什么这么说，实不相瞒，我之前也有段时间是这样的，基础还没有打好，便急于去学习那些看起来高大上的知识，这给自己，给别人都造成了一种假象，然而最终结果是，地基不稳，高楼大厦都得推倒重来。买书是为了什么，为了更好地看书。现在的时代和以前不一样，以前大多数书本都没有电子版，想要看书只能去买纸质书，而现在不一样，几乎所有的书在网上都能找到电子版，买书的目的不应该是为了充实书架，而是对自己的学习进行一个辅佐和帮助的作用，关键还是在于读书，而不是买书。买了书，不一定能学到书中的精髓，不买书，也未必只能浮于表面。最重要的一点还是，要通过读书，研究书（也就是所谓的做题目），领略到每本书中理论的关键所在，并最终形成自己的理论体系。 共勉。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"网","slug":"life-8","date":"2023-02-17T00:53:49.000Z","updated":"2023-02-17T01:20:30.657Z","comments":true,"path":"2023/02/17/life-8/","link":"","permalink":"https://nju-kevin.github.io/2023/02/17/life-8/","excerpt":"","text":"记得有一篇微小说，题目是生活，内容只有一个字：网。现在发现，何止是生活，世上任何事物都是一张网。譬如这学期的数学课，除了离散数学，其他的都是围绕着测度论展开的。为什么测度论这么重要呢？就是因为一般的Riemann积分的局限性，于是会很明显地发现这学期开始包括以后，研究问题都会建立在测度空间上，不仅是概率论也好还是实分析，Fourier分析，在原来的一维实直线上有一套理论，那么类似的，在Lebesgue可积空间$L^p$空间上，同样也可以研究实变函数，函数的Fourier系数，Fourier级数，Fourier变换等等。 昨天上的分析学专题选讲，孙永忠老师从$L^2$空间引入，介绍了$Hilbert$空间上的内积，并由正交基引入Fourier级数，这就是$Papa Rudin$上第四章所述的内容，这个定义应该是目前为止我见过的最一般的Fourier的定义。有趣的是，课后我询问他Stein的Fourier分析时，他直言，Stein是写给那些大一还没学过微积分的同学看的Fourier分析教程，难怪我在学习的时候发现其中的定义一直都建立在$\\mathbb{R}$上，而没有推广到一般的$Hilbert$空间上。因此在学习$Papa Rudin$的过程中，我认为也很有必要更系统地学习一遍Fourier分析理论，这对打牢数学功底是大有裨益的。 这段时间一直是复习旧知识与学习新知识交替的阶段，合理安排时间，好好把握自己的复习节奏，在对旧知识印象加深的同时又能增进对新知识的理解，长期以往，自然是百利无一害的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"ODE的那些事","slug":"life-7","date":"2023-02-16T12:57:27.000Z","updated":"2023-02-19T08:30:13.227Z","comments":true,"path":"2023/02/16/life-7/","link":"","permalink":"https://nju-kevin.github.io/2023/02/16/life-7/","excerpt":"","text":"谨用这篇文章简要阐述我学习ODE的那些日子。 ODE的老师是数学系的程伟，啤酒肚，头发也有些白，下课喜欢在外面抽烟，上课的节奏没有把控，有些内容讲得也不够透彻令人云里雾里，但我还是坚持记笔记和板书，甚至上课的时候觉得程伟把他的笔记发给我们自学效果都比听课好。 复习的时候才知道，上课哪怕没有在听他讲课自己看书记笔记，都比不去教室强。不知道是为什么，复习的过程中脑海中时常会蹦出一些程伟课上所说过的话，说明即使我已经忘了他讲了什么，但我的脑子没忘记。我想这得益于我有的时候虽然上课不在听，但至少在跟着他的节奏走，在学习ODE这门课，而不是在干与这门课无关的事情，这在我今天看来，或许是十分重要的。考试的时候就能知道，每个人平时的学习情况是怎么样的，之前偷的懒都会在考试的时候加倍奉还。但由于后来我记笔记仅仅停留在了动手的层面而没有入脑，导致消化的时间并不够，这也是为什么复习阶段我花了很多时间看笔记才能明白这门课所讲授的内容的思路，由此可见，记笔记只是第一步，更要多消化，多在课后看看思考思考。今天不知道在哪篇文章上看到的，为什么要持续努力，就是为了让大脑保持持续的思考，从而才能提高思想的深度。 ODE这门课其实学校里教授的并不是很深。上半学期应用部分介绍了一阶线性、非线性的方程的求解方法，理论部分主要讲述了方程解的存在性、唯一性，解的延拓，极大解极小解等；下班学期的应用部分介绍了线性方程组的齐次、非齐次的解法，以及高阶方程齐次、非齐次的解法，以及物理模型（Kepler，简谐振动单摆，悬链线）；理论部分介绍了流的概念，进一步介绍了适定性（关于解和初值的连续依赖性以及关于参数的可微性），二阶方程的边值问题。应该说，下班学期更偏应用一点，但仅仅是了解方程的解法，就能耗费很多的功夫，因为只有知道原理以后才能更好地理解如何解方程，否则只背公式很难对公式的含义有一个合理的理解。 复习到现在我觉得大体都很有把握了，来学校以后的复习阶段，不敢说没有浪费时间，但我有自信说我尽力了，我利用了每一段我可以利用的时间并且也努力地去提高效率。合理地规划，考试尽力而为即可。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Fourier分析漫谈","slug":"life-6","date":"2023-02-15T00:19:28.000Z","updated":"2023-02-15T01:19:32.525Z","comments":true,"path":"2023/02/15/life-6/","link":"","permalink":"https://nju-kevin.github.io/2023/02/15/life-6/","excerpt":"","text":"本来是前几天想谈一谈这个话题的，但是由于之前时间有些紧张，从而一直没能实现。今天正好一整天没课，于是对我目前为止对于基础Fourier分析的理解以及学习内容进行一个概述。 Fourier分析是一门博大精深的学科，其源头还是来源于物理问题，即人们所熟知的热方程，Dirichlet问题，波函数。从这一点上来说，Fourier分析和常微分方程（ODE）有类似之处，二者都不是纯数学，都有物理问题中的应用，也都是运用数学的工具和手段解决问题。当然，作为一门学科，其本质的理论一定也是必要的，因此这两门学科的理论部分仍是分析学的。 首先谈一谈Fourier分析。Stein的Fourier分析从热方程波函数入手，介绍了Fourier分析的来源。初读这本书的时候我并没有很在意这些问题，直接跳过读第二章的理论部分，第二次读这本书的时候（也就是2023年春节）我才意识到事实上Fourier的应用也同样重要。 Fourier的理论分析部分，Fourier分析研究的是单位圆周上的函数，也就是周期为$2\\pi$的函数，从Fourier系数的定义 \\hat{f}(n)=\\frac{1}{2\\pi}\\int_{-\\pi}^{\\pi}f(x)e^{-inx}dx以及相应的Fourier级数 f(x) \\sim \\sum_{n \\in \\mathbb{Z}}\\hat{f}(n)e^{inx}有这个级数从而就需要研究其敛散性。这里就是分析学的内容了，由于是无穷级数，所以就有两种收敛方式：点态收敛（Pointwise Convergence）和一致收敛（Uniform Convergence）。数学分析里我们知道，一个级数点态收敛，收敛到的函数不一定连续，只有一致收敛才能保证连续性。因此又有一个问题，那就是$f$需要满足什么样的条件，Fourier级数点态收敛/一致收敛？这里对于点态收敛，苗栋讲的很清楚，三个条件，任何一条都能推出点态收敛：PDF（Piecewise Differentiable Function分段可微，或者更强的分段光滑），Lipschitz，monotone（单调）；而一致收敛需要的条件更强，不仅$f$有要求，还对$f’$有要求。 这个时候，注意到一个函数的Fourier级数的和函数不一定就等于原来的函数，因此又出现了一个问题，那就是一个函数的Fourier级数什么时候收敛到自身？当$f$的条件并不是很强的时候，级数是$Cesaro$可求和到自身，这里便体现出$Abel$求和与$Cesaro$求和的作用来。同样的，级数里的研究一样，Fourier级数什么时候可以逐项求导，逐项积分（即求导与积分能否与求和换序的问题）也与级数里的研究方法类似。 另外，注意到一个函数的Fourier级数是一个三角级数，那么反过来，是不是所有三角级数都是某个函数的Fourier级数呢？答案很显然是negative的，这时需要三角级数$sinnx$前面的系数是$o\\left(\\frac{1}{n}\\right)$。 Fourier分析中的另一个常用的工具就是卷积（Convolution）。注意到Fourier级数的部分和 S_N=f\\ast D_N其中$D_N$为DIrichlet kernel。卷积实际上是一种平均，将两者的性质进行一个“平均”。核理论在Fourier分析中也十分重要，比较重要的kernel有Dirichlet kernel，Fejer kernel，Poisson kernel，Heat kernel。Poisson kernel是解决Dirichlet问题时用到的kernel，Heat kernel是解决热方程问题时的kernel。Stein介绍了good kernel的概念，就是因为good kernel具有良好的性质，与good kernel做convolution的函数最终都会收敛到其本身。同时，以热方程为例，实直线上的热方程与单位圆周上的热方程的热核有区别，但二者又是通过Poisson Summation Formula联系起来的。 另一个Fourier分析中的重要内容是Fourier变换，且Fourier变换和卷积之间有着很好的桥梁进行联系，同时，Fourier变换还能解决某些偏微分方程，由于其运算的独特的性质。 Fourier分析还有着很多应用，热方程、Dirichlet问题，等分布（Equidistribution）等等。同时还可以考虑有限Abel群上的Fourier分析，即有限Fourier分析等。 在学习红皮书（Papa Rudin）的时候，我发现Fourier系数的符号定义$\\hat{f}(n)$实际上是Hilbert空间里 \\hat{x}(\\alpha)=(x,u_{\\alpha})的特例。这是由于单位圆周上的连续函数空间是Hilbert空间，从而也是Banach空间，这使得对于更一般的空间上的研究的结论可以应用到Fourier分析中。由Hilbert空间中的结论我们可以得到Riesz-Fischer定理：如果数列的绝对值的平方所构成的无穷级数求和有界，那么它才能是一个函数的Fourier系数。再例如，Banach空间中研究Fourier级数的点态收敛，根据Banach-Steinhaus定理，不仅可以得到如果只有连续这个条件，其Fourier级数不一定点态收敛，还能得出，如果在某点不收敛，那么一定有一个紧的$G_{\\sigma}$使得在其中都不点态收敛。 这其实就告诉我们学习一门学科的时候不能仅仅看这一门，而应该多学科相互照应，融会贯通。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"对于学习方法的一些思考","slug":"life-5","date":"2023-02-14T05:33:50.000Z","updated":"2023-02-15T12:51:41.136Z","comments":true,"path":"2023/02/14/life-5/","link":"","permalink":"https://nju-kevin.github.io/2023/02/14/life-5/","excerpt":"","text":"今天早上旁听了泛函分析课程，大三的同学数学分析和高等代数基本上都忘得差不多了，点集拓扑也不是都学过，这不禁让我感慨，一些数学基础课程放在大一学本来就是为了后续课程打基础，而不能考完试了就忘掉。泛函分析算是一种软分析，而实分析就是硬分析。秦理真老师幽默地说：“我的硬分析功底测度为零。”泛函分析研究的是无穷维线性空间上的“矩阵”（叫做算子），按秦老师的说法就是用数学分析研究高等代数，类比于有限维线性空间。因此可以看出，高等代数和数学分析的基本功要足够扎实才行。 后来上概率论，一上来就是$\\sigma$代数和$Borel$集，而这些就是$Lebesgue$积分的定义域，可见实分析是很多课程的基础，普通的$Riemann$积分早已不再够用，而这也是我这学期的主要目标之一，即打牢分析学功底，从数学分析到实分析复分析，Fourier分析，泛函分析，这些都是分析学的基础，也是代数、几何与拓扑、概率等方向的基础。通过一遍又一遍的反复思考，原本对于点集拓扑的一些疑难的不清楚的地方也渐渐都有了眉目。 复习常微分方程的时候，我反复审视我的笔记，并同时试图讲给自己听，发现了当时记笔记的时候的一些疏漏，同时对于长篇大论的证明过程也有了全新的理解和彻底的掌握。此时脑中却不禁回忆起之前程伟老师所说过的话，颇有恍然大悟之感。 复习的过程中，我再一次感受到平时上课认真听讲的重要性。由于我上学期的大部分时间都认真记笔记，复习的时候省去了抄写笔记的时间；由于课上的部分时间听得很认真，所以复习起来的困难并不大；同时这也表明，上课的确有部分时间听课效率不高，这导致我现在复习的过程不能做到行云流水般流畅。因此这也是我这学期想要改进的地方，上课的时候不管内容自己有没有学过都要认真记笔记，把觉得对自己有用的东西记下来，认真听讲并勇于纠错（比如今天概率课上我发现了老师对于Borel集的定义上有着很明显的错误，应该是打印错误）并且很重要的一点是，课后一定要及时消化，而不能留到考试前复习的时候消化，否则看笔记会看的很累且陌生。因此，及时消化笔记是我这学期所应该改进的地方。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"漫谈","slug":"life-4","date":"2023-02-13T02:06:07.000Z","updated":"2023-02-13T14:18:52.683Z","comments":true,"path":"2023/02/13/life-4/","link":"","permalink":"https://nju-kevin.github.io/2023/02/13/life-4/","excerpt":"","text":"又到了一学期一度的学期课程补退选日，一到规定的时间，由于进入网站的人数过多，导致早半个小时便进入网站等候的我被网站卡退了出来。本以为此次抢课会一无所获，所幸在几分钟后还有一节通识课没有满，暂时先选上了一节。另外，我还报了一门大三的数学选修课《分析学专题选讲》，看内容就是讲的Fourier分析，正好我寒假里系统地学习了Stein的Fourier分析，因此正好学习一下加深理解。 这学期学的数学课选了不少，既然选了，既然决定学下去，就好认真地、一丝不苟地学。另外我还准备在周二和周四的早上旁听泛函分析，为了准备即将到来的丘赛。今天在图书馆学习了一些红皮书上Banach空间的内容，由于和Fourier分析的内容有重合之处，让我体会到了Hilbert空间和Banach空间里更普适的Fourier分析，我认为是大有裨益的。另外在下午对数学分析和常微分方程进行了复习，复习在这周是重中之重，并且这几门都是很重要的内容，必须要掌握好了。今天晚上听上同调的课程，也再一次让我体会到了数学分析和高等代数基础的重要性。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"观海难言","slug":"life-3","date":"2023-02-12T12:14:39.000Z","updated":"2023-02-12T13:05:15.817Z","comments":true,"path":"2023/02/12/life-3/","link":"","permalink":"https://nju-kevin.github.io/2023/02/12/life-3/","excerpt":"","text":"（标题出自《史记·孔子世家赞》） 今天的主要任务是复习大学物理和常微分方程，在复习的间隙还调节了一下翻了翻$Papa Rudin$，学了点$Banach$空间的一些基本定理（$Baire$定理等）。复习大学物理的过程注定不会是轻松的，很多公式并不知道如何运用，在做题以及题目之间的对比之中才知道原来这个公式是这个道理，这就叫看出公式背后隐藏的东西，而不是看表象。物理是这样，数学又何曾不是这样？每当我发现些新的东西之后，只有无尽的赞叹，这种可意会不可言传的感受，即观海难言也！ 这学期由于课程少，学分少，加上可能存在的最低学分的限制，因此我选修了一门大三的数学课《从微积分到上同调》，老师是苗栋的好朋友石亚龙老师，我看了一下课程周历，是从微积分中的曲面积分入手，利用上同调的工具解决一些光滑向量丛的计算问题，可以说是一门基础很浅但达到的目的很深刻的一门课，原本学这门课是打算先看看能不能听懂，不过按目前的状况来看退了这门课学分就不够了，因此我打算好好学一学。事实上数学基础课（也就是数学分析高等代数解析几何）是十分重要的，并且认为因为基础所以不屑一顾的想法是十分危险的。我自己深知这三门课的基础还不够牢，因此考完试的第一要务就是打好这三门课的基础。为何说这三门课的内容足够深邃，是因为每次学习其中的内容，我都能发现一些之前没注意到的东西，这一点，那些教了几十年基础课的数学老师应该深有体会。我本人对分析学比较感兴趣，则更应该对之多加研究。 关于期初考试的复习由于我的合理规划，现在正有条不紊地进行并且即将进入尾声，复习考试的过程亦是打牢基础的过程，实际上本科数学所学的数学课都是基础课，现在把基础打打好，以后进行更高层次的学习研究就会轻松很多。 以前经常会有那种想快点往前学的想法，不知为何最近这种好高骛远少多了，更多的是踏踏实实把现在学的、以前学的学学好，把基础打深厚了再建高楼大厦。每个行业都是一片海，观海难言是出于敬畏和景仰，在意识到前方茫茫的情况下仍划一条小船前进是信念和追求。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Problems in Miao's exams","slug":"math-6","date":"2023-02-08T14:45:33.000Z","updated":"2023-02-08T15:46:01.085Z","comments":true,"path":"2023/02/08/math-6/","link":"","permalink":"https://nju-kevin.github.io/2023/02/08/math-6/","excerpt":"","text":"This article discusses some of the problems in Miao’s exams, and the solutions will be completed as soon as possible. Exercise 1 Prove that \\int_{0}^{\\infty}{\\frac{s^{2022}}{e^{\\pi \\sqrt{s}}-1}ds} \\in \\mathbb{Q} Solution. Changing variables gives \\int_{0}^{\\infty}{\\frac{s^{2022}}{e^{\\pi \\sqrt{s}}-1}ds}=2\\int_{0}^{\\infty}{\\frac{t^{4045}}{e^{\\pi t}-1}dt}Consider \\begin{aligned} \\int_{0}^{\\infty}{\\frac{t^{2n+1}}{e^{\\pi t}-1}dt}&=\\int_{0}^{\\infty}{t^{2n+1}\\sum_{k=1}^{\\infty}{e^{-k\\pi t}}dt} \\\\ &=\\sum_{k=1}^{\\infty}{\\int_{0}^{\\infty}{t^{2n+1}e^{-k\\pi t}}dt} \\end{aligned}Also, note that \\int_{0}^{\\infty}{t^{2n+1}e^{-k\\pi t}}dt=\\frac{(2n+1)!}{(k\\pi)^{2n+2}}Hence \\sum_{k=1}^{\\infty}{\\int_{0}^{\\infty}{t^{2n+1}e^{-k\\pi t}}dt}=\\sum_{k=1}^{\\infty}{\\frac{(2n+1)!}{(k\\pi)^{2n+2}}}=\\frac{(2n+1)!}{\\pi^{2n+2}}\\zeta(2n+2)The proof is completed since \\zeta(2n+2)=(-1)^{n}\\frac{2^{2n+2}B_{2n+2}\\pi^{2n+2}}{2(2n+2)!} Exercise 2","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Comments About Problems in Papa Rudin","slug":"rudin-1","date":"2023-02-01T10:18:38.000Z","updated":"2023-03-02T11:54:50.615Z","comments":true,"path":"2023/02/01/rudin-1/","link":"","permalink":"https://nju-kevin.github.io/2023/02/01/rudin-1/","excerpt":"","text":"概要这篇文章将对《Real and Complex Analysis》（亦即所谓的“Papa Rudin”）的课后习题进行思路的阐述，并重点讨论每道题所需用到的知识点以及定理，而不会详细地写出每道题的严格数学证明（这件事早在2019年就有教授做过了，而且证明写得十分详细）。每道题我都将讲述我个人的解题思路以及想到的相关知识，梳理的同时并对这本名著的基本内容进行概述。 Chapter 1 Abstract IntegrationExercises 1 Does there exist an infinite a-algebra which has only countably many members ? 这道题问是否存在拥有可数个元素的无穷$\\sigma$代数，看上去很宽泛，貌似很难具体入手。事实上，$\\sigma$代数是一个很大的集族，它的性质也很好，包含了空集和全集，同时只要一个集合在里面，那么其补集也在；还对可数并封闭。需要注意的是，在书中关于$\\sigma$代数定义的Comments部分，揭示了其关于可数交也封闭，且任何两元素的差集也在$\\sigma$代数中的性质，这往往是容易忽视的一点，但的确很好用。 因此既然这个$\\sigma$代数没有确切的模样，不如从其中一个元素入手。可以找一个非空的属于该$\\sigma$代数的集合$E$，那么$E$和$E^c$中一定有一个是无限集，不妨为$E$，$E$本身也形成了一个子可测空间（只需要让$E$中的$\\sigma$代数是原来的$\\sigma$代数中的集合与$E$的交集即可），然后$E$中又可以取真子集，这样递归地下去，得到一个无穷递降子集列，每个集合都是无限集，且都在$\\sigma$代数中，由于$\\sigma$代数对差集也封闭，这个链集中的相邻集合的差集也在$\\sigma$代数中，这些差集与自然数构成了一一对应，$\\sigma$代数还需对这些差集的任意并封闭，这就与自然数的子集构成了一一对应，而自然数的子集个数是不可数的，从而$\\sigma$代数也不可数。 与自然数建立双射的过程并不困难，加上$\\sigma$代数需要满足的可数并性质便可以让其中元素不可数，因此这道题告诉我们无穷$\\sigma$代数是很“大”的. Exercise 2 Prove an analogue of Theorem 1 .8 for n functions. 这道题对书上的Theorem 1.8进行了简单的推广，但证明方法没有任何区别. Exercise 3 Prove that if f is a real function on a measurable space X such that { x : f(x) &gt; r} is measurable forevery rational r, then f is measurable. 看上去是很常规的概念题，使用集合论应该就可以解决。做的时候发现的确是这样，利用定义，证明$\\mathbb{R}$中开集的原像可测，由题意可以知道左闭右开区间的原像可测，而开区间可以用左开右闭区间进行可数逼近，于是$f$可测. Exercise 4 这是常规的数学分析题，利用上确界下确界的性质即可，但注意区别的是这里最好使用书上给出的结论（Theorem 1.14）而不是数学分析里的，因为或许某些数学分析书里的定义不具有普适性。核心使用的结论是 \\lim_{n \\to \\infty}\\sup f_n=\\inf_{k \\geq 1}\\{\\sup_{i \\geq k} f_i\\} Exercise 5 (a) Suppose f: X→ [- oo, oo] and g: X→ [- oo, oo] are measurable. Prove that the sets{x : f(x) &lt; g(x) }, {x : f(x) = g(x)}are measurable.(b) Prove that the set of points at which a sequence of measurable real-valued fu nctions converges(to a finite limit) is measurable. 第一反应就是作差，得到的新函数根据定义显然是可测的。第二问当该实值可测函数列收敛时，可以取极限上确界得到极限函数，如果要证明使得函数列收敛的$x$值构成的集合（记为$E$）可测，此时应该想到的是可以利用函数列可测（由Theorem 1.14极限函数也可测）的性质将$E$表示为一些可测集的并或者交即可。根据极限的定义，对$n$取并再对$\\epsilon$取交得到的集合即为$E$，从而$E$可测. Exercise 6 Let X be an uncountable set, let 9Jl be the collection of all sets E c: X such that either E or Ec is atmost countable, and define mu(E) = 0 in the first case, mu(E) = 1 in the second. Prove that mu is asigma-algebra in X and that Jl is a measure on mu. Describe the corresponding measurable functions andtheir integrals. 这道题也是定义题，但做的过程中会发现测度的可加性貌似并不满足，从而引向最多可数集的个数最多只能有一个，否则会导出矛盾。其他地方按照定义一一验证即可. Exercise 7 这是对DCT的直接应用. Exercise 8 题中给出的函数$f$即是Fatou‘s Lemma不等号严格成立的一个例子，Fatou’s Lemma值得着重关注，在不少定理的证明中都有出现. Fatou’s LemmaIf $f_n:X \\to [0, \\infty]$ is measurable, then \\int_{X}{\\left(\\lim_{n \\to \\infty}{\\inf{f_n}}\\right)d\\mu} \\leq \\lim_{n \\to \\infty}{\\inf{\\int_{X}{f_nd\\mu}}} Exercise 9 这道题可以运用数学分析里的近似方法，并结合DCT和Fatou’s Lemma（$\\alpha&lt;1$）即可，比较常规. Exercise 10 由$f_n$均有界以及一致收敛的性质可以得到极限函数也有界，从而直接运用DCT即可.（可取$g(x)=M$） Exercise 11 证明两集合相等，即是证明相互包含，于是原定理需要证明$\\mu(A)=0$则转化为了证明 \\mu\\left(\\bigcap_{n=1}^{\\infty}\\bigcup_{k=n}^{\\infty}E_k\\right)=0这里需要运用测度的性质，对于无穷递降集合列，每个集合的测度将趋于该集合列可数交的测度，即书上的Theorem 1.19. Exercise 12 这道题在数学分析中也有对应，是数学分析中积分的推广，利用测度积分的定义以及上确界下确界的性质即可。到这里我们也可以看出数学分析对于实分析复分析的作用，上确界下确界在抽象积分中发挥着巨大的作用. Exercise 13 Show that proposition 1.24(c) is also true when c = oo. 无穷的情况可以用有穷逼近，对于极限为$\\infty f$，可以用$f_n=nf$取极限得到，$f_n$容易知道也是可测的，而且这是一个递增的非负函数列，运用本章中另一个重要定理MCT即可. Chapter 2 Positive Borel MeasureExercise 1 Let {fn} be a sequence of real nonnegative functions on R 1 , and consider the following four statements(a) If/1 and /2 are upper semicontinuous, then /1 + /2 is upper semicontinuous. (b) lf/1 and /2 are lower semicontinuous, then f1 + /2 is lower semicontinuous. (c) If each fn is upper semicontinuous, then Lf fn is upper semicontinuous. (d) If each /,. is lower semicontinuous, then Lf f.. is lower semicontinuous. Show that three of these are true and that one is false. What happens if the word “ nonnegative “is omitted ? Js the truth of the statements affected if R 1 is replaced by a general topological space? 此题主要考察的上半连续和下半连续的定义，前两问将和函数上半连续或者下半连续的满足条件的$x$构成的集合表示成一些开集的并和交即可证明，即 I_{\\alpha}=\\bigcup_{0","categories":[{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]},{"title":"A Normal Integral","slug":"math-4","date":"2023-01-25T04:32:38.000Z","updated":"2023-02-24T00:17:19.160Z","comments":true,"path":"2023/01/25/math-4/","link":"","permalink":"https://nju-kevin.github.io/2023/01/25/math-4/","excerpt":"","text":"This is a classical problem about integral, and the solution of it is very primary, but there’re really many difficulties in calculating. I met this problem when trying to solve all the problems from 100 problems of definite integral, which turned out to be nearly impossible since I was busy at that time. But I think I’ll finish it someday. The formula was input at 2021.12.13. Calculate the indefinite integral: \\int{\\frac{1}{1+x^n}dx}where $n$ is a positive integer. Solution:When $n$ is even, let it be $2n$, \\frac{1}{1+x^{2n}}=\\frac{1}{n}\\sum_{k=1}^{n}{\\frac{1-x\\cos{\\frac{2k-1}{2n}\\pi}}{x^2+1-2x\\cos{\\frac{2k-1}{2n}\\pi}}}That leads to \\begin{aligned} \\int{\\frac{1}{1+x^{2n}}dx}=&-\\frac{1}{2n}\\sum_{k=1}^{n}{ \\cos{\\frac{2k-1}{2n}\\pi}\\ln{\\left| x^2+1-2x\\cos{\\frac{2k-1}{2n}\\pi} \\right| }}\\\\\\\\ &+\\frac{1}{n}\\sum_{k=1}^{n}{ \\sin{\\frac{2k-1}{2n}\\pi}\\arctan{\\frac{x-\\cos{\\frac{2k-1}{2n}\\pi}}{\\sin{\\frac{2k-1}{2n}\\pi}}} }+C \\end{aligned}Similarly, when $n$ is odd, let it be $2n+1$, \\frac{1}{1+x^{2n+1}}=\\frac{1}{2n+1}\\left( \\frac{1}{x+1}+2\\sum_{k=1}^{n}{\\frac{1-x\\cos{\\frac{2k-1}{2n+1}\\pi}}{x^2+1-2x\\cos{\\frac{2k-1}{2n+1}\\pi}}}\\right)which leads to \\int{\\frac{1}{1+x^{2n+1}}dx} \\begin{aligned} &=\\frac{1}{2n+1}\\left( \\ln{\\left|x+1\\right|}-\\sum_{k=1}^{n}{ \\cos{\\frac{2k-1}{2n+1}\\pi}\\ln{\\left| x^2+1-2x\\cos{\\frac{2k-1}{2n+1}\\pi} \\right|}} \\right)\\\\\\\\ &+\\frac{2}{2n+1}\\sum_{k=1}^{n}{ \\sin{\\frac{2k-1}{2n+1}\\pi}\\arctan{\\frac{x-\\cos{\\frac{2k-1}{2n+1}\\pi}}{\\sin{\\frac{2k-1}{2n+1}\\pi}}} }+C \\end{aligned}////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Radon Transform","slug":"math-3","date":"2023-01-25T04:12:09.000Z","updated":"2023-02-24T00:16:35.696Z","comments":true,"path":"2023/01/25/math-3/","link":"","permalink":"https://nju-kevin.github.io/2023/01/25/math-3/","excerpt":"","text":"This is a conclusion in Fourier analysis, it tells the relationship between Radon transform of a function and the function itself. The formula was input at 2022.04.08. If $f \\in \\mathcal{S}(\\mathbb{R}^3)$, then \\triangle(\\mathcal{R}^* \\mathcal{R}(f))=-8\\pi^2f Solution: First we know \\mathcal{R}(f)(t,\\gamma)=\\int_{-\\infty}^{\\infty}{\\hat{f}(s\\gamma)e^{2\\pi its}ds}Therefore \\mathcal{R}^*\\mathcal{R}(f)(x)=\\int_{S^2}{\\int_{-\\infty}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}dsd\\sigma(r)}Hence \\begin{aligned} \\triangle(\\mathcal{R}^* \\mathcal{R}(f))(x) & = \\int_{S^2}{\\int_{-\\infty}^{\\infty}\\hat{f}(s\\gamma)(-4\\pi^2 s^2)e^{2\\pi ix\\gamma s}dsd\\sigma(r)} \\\\\\\\ & = -4\\pi^2\\int_{S^2}{\\int_{-\\infty}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -4\\pi^2\\int_{S^2}{\\int_{-\\infty}^{0}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -4\\pi^2\\int_{S^2}{\\int_{0}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -8\\pi^2\\int_{S^2}{\\int_{0}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -8\\pi^2 f(x) \\end{aligned}////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"A problem about Fourier coefficients","slug":"math-2","date":"2023-01-24T07:56:42.000Z","updated":"2023-02-24T00:15:23.392Z","comments":true,"path":"2023/01/24/math-2/","link":"","permalink":"https://nju-kevin.github.io/2023/01/24/math-2/","excerpt":"","text":"This is actually an simple conlusion, but it really puzzled me a lot when I first encountered this problem. The essence of it is to decide whether there exists a Riemann integrable function on the circle whose k-th Fourier coefficient equal to $\\frac{1}{k}$. Consider the sequence $\\{a_k\\}_{-\\infty}^{\\infty}$, and $a_k=\\frac{1}{k}$ if $k \\geq 1$, $a_k=0$ if $k \\leq 0$.Show that no Riemann integrable function has $k$-th Fourier coefficient equal to $a_k$ for all $k$. Proof. Suppose that there is a Riemann integrable function $f$ s.t. f \\sim \\sum_{n=1}^{+\\infty}{\\frac{e^{in\\theta}}{n}}Consider the Abel sum of the above series: A_r(f)(\\theta)=\\sum_{n=1}^{+\\infty}{\\frac{r^ne^{in\\theta}}{n}}When $r \\to 1^-$, $A_r(f)(0)$ is unbounded since $\\sum_{n=1}^{+\\infty}{\\frac{1}{n}}$ diverges. However, note that A_r(f)(\\theta)=(f \\ast P_r)(\\theta) also, $f$ is bounded, and Poisson kernel is a good kernel, thus the convolution of $f$ and $A_r(f)$ is bounded, i.e. $A_r(f)(0)$ is bounded, which is a contradiction.////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Insteresting Couplets","slug":"life-1","date":"2023-01-24T04:41:53.000Z","updated":"2023-02-04T05:47:47.078Z","comments":true,"path":"2023/01/24/life-1/","link":"","permalink":"https://nju-kevin.github.io/2023/01/24/life-1/","excerpt":"","text":"正值2023年春节，摘录几条数学对联，与君共勉。 一上联：六千年数学，旷世传来，想初等代数，解析几何，集合理论，积分方程，何其博大精深，极目古今悠，莫惊疑数海茫茫，形山隐隐 下联：一万里长江，几人淘尽，仰割圆刘徽，算率冲之，流数牛顿，过桥欧拉，真是超凡入圣，放怀天地阔，须礼赞勋名赫赫，伟业煌煌 二上联：宏著传中外以立言,心灵独得。观洛水河图、四元玉鉴、九章算术、宫格幻方、欧氏原本、n阶矩阵、拓扑映射、复变泛函，何其博大精深！莫惊疑数海茫茫，形山隐隐，应悬梁刺股，更邀客谈经论典，乐门第昌盛，满园春风播春雨！ 下联：先贤彰古今而为治，道脉谁承？想祖率冲之、三角杨辉、八卦伏羲、筛法景润、堆垒罗庚、七桥欧拉、王子高斯、积分黎曼，确系超凡神圣！须礼赞勋卓赫赫，伟业煌煌，知继往开来，恒埋头助澜推舟，看桃李芬芳，炎黄华夏普华章！ 三上联：五百卷图书，散列桌上，宏编巨著，喜洋洋兴趣无穷。看高等代数，泛函分析，线性规划，随机过程，悉心研读，不妨请客探讨。趁年轻智敏，是应该博学勤专，正更长夜永，安排些美酒佳肴。莫辜负欧几里得，希尔伯特，马克劳林，拉格朗日 下联：六千年往事，浮现天际，大江东去，叹滚滚先贤何在？想伏羲画卦，刘徽割园，冲之算率，罗庚定理，伟业丰功，费尽移山力气。任风吹雨打，却依然流光溢彩，与日夜同辉，经万古环球敬仰。须记取九章妙论，四元奇术，五家共井，百鸡齐鸣","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Lebesgue Point","slug":"math-1","date":"2023-01-24T02:35:51.000Z","updated":"2023-02-24T00:14:55.265Z","comments":true,"path":"2023/01/24/math-1/","link":"","permalink":"https://nju-kevin.github.io/2023/01/24/math-1/","excerpt":"","text":"This conlusion is input initially at 2022.04.04. Problem: $f \\in L^1(R^k)$, then almost every $x \\in R^k$ is a Lebesgue point of $f$. Notes: $x$ is a Lebesgue point of $f$ if \\lim_{r \\to 0}{\\frac{1}{m(B_r)}\\int_{B(x,r)}{|f(y)-f(x)|dm(y)}}=0 Solution: Define (T_rf)(x)=\\frac{1}{m(B_r)}\\int_{B(x,r)}{|f-f(x)|dm}Put (Tf)(x)=\\lim_{r\\to 0}\\text{sup}{T_rf}We have to prove that $Tf=0$ a.e.[m]. For any $n \\in \\mathbb{N}_+$,there exists $g \\in L^1(R^k)$ s.t. $||f-g||_1 &lt; \\frac{1}{n}$. Since $g$ is continuous, $Tg=0$. Denote $h=f-g$. Hence Th \\leq Mh+|h|Since T_rf \\leq T_rg+T_rhHence Tf \\leq Mh+|h|$$. Then $$\\{Tf>2y\\} \\subset \\{Mh>y\\} \\cup \\{|h|>y\\}and m(\\{Tf>2y\\}) \\leq \\frac{3^k+1}{yn}Denote the union on the right side $E(y,n)$. Since $E(y,n)$ is independent of $n$, \\{Tf>2y\\} \\subset \\bigcap_{n=1}^{\\infty}{E(y,n)}Therefore $\\{Tf&gt;2y\\}$ is a subset of measure 0. Due to the completeness of the Lebesgue measure, we know $\\{Tf&gt;2y\\}$ is also of measure 0. Hence $Tf=0$ a.e.[m]. ////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Welcome","slug":"Welcome","date":"2023-01-23T03:41:13.000Z","updated":"2023-01-24T02:22:27.070Z","comments":true,"path":"2023/01/23/Welcome/","link":"","permalink":"https://nju-kevin.github.io/2023/01/23/Welcome/","excerpt":"","text":"Hello and welcome! This is Kevin from NJU, and I’m a sophomore from Kuangyaming Honors School. This is my personal blog, in which I’ll share my daily life and thoughts about math since mathematics is my major. My blog may not be very detailed in analyzing math problems and theorems temporarily, since there is still much to learn and time is limited. But I’ll try to introduce my thoughts about them and some inspiring ideas. Moreover, I want to mention that the thoughts will be expressed in English, while articles about my life will be written in Chinese.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2023-01-22T10:27:43.493Z","updated":"2023-01-24T01:25:23.069Z","comments":true,"path":"2023/01/22/hello-world/","link":"","permalink":"https://nju-kevin.github.io/2023/01/22/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"},{"name":"Contest","slug":"Contest","permalink":"https://nju-kevin.github.io/categories/Contest/"},{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"},{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"},{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]}