{"meta":{"title":"Kevin's World","subtitle":"Analysis is beautiful!","description":"","author":"NJU-Kevin","url":"https://nju-kevin.github.io","root":"/"},"pages":[],"posts":[{"title":"神奇的巧合","slug":"life-22","date":"2023-03-09T13:15:08.000Z","updated":"2023-03-09T13:44:39.405Z","comments":true,"path":"2023/03/09/life-22/","link":"","permalink":"https://nju-kevin.github.io/2023/03/09/life-22/","excerpt":"","text":"最近我发觉时常会出现这样的巧合：我私下里学了一个思想，一个定理或者是一个方法，有可能是睡前看的一个定义，也有可能是课间思考的一个问题，亦或者是自习的时候学习的一个定理证明，过后不久的课堂上，或者是作业上，或者是不经意看到的别的教室的屏幕上，就能出现我之前思考的事情。例如，昨天晚上睡前我在看ODE的紧自伴算子，然后早上泛函分析就讲了伴随映射（有区别但是是类似的东西）；我昨天把$Papa \\space Rudin$的乘积测度完结，今天概率论课上又讲了概率乘积测度；下午的分析学选讲上，我对一个学长的证明进行了优化，作业中有一个实解析函数的证明方法，又在晚上概率论作业中用到了。 最近经常会发生这种事情，发生的就恰到好处，不早不迟，一开始我还没怎么注意，后来由于出现的太频繁，让我觉得很是神奇。发生这种事情，一次两次或许还是巧合，但最近一段时间连续地发生，我认为或许是一种必然，但这种必然又是说不清道不明的，毕竟我也不会知道课堂上会讲什么，作业上会用到什么，我每天看的东西也不是固定的，总之我认为这是一个很神奇的巧合，就像我最近也有一种微妙的感觉，是关于学业上的感觉，具体是什么我也说不清楚，但有的时候就是能够体会到，有点像是和数学的神心灵感应，连线的感觉，但目前还很微弱，暂时还不清楚到底是什么。 这听上去有些“玄学”，然而事实上并不是只有我有这种感觉。南京大学数学系教授孙智伟，便是一位“灵感数学家”。孙智伟提出了很多猜想，很多都是不经意之间想到的，同时，据系里的老师说，孙智伟还有一种“超能力”，那就是能够预测，例如预测足球比赛何时进球，最后的比分等等。这种灵感是极为少见的，不过我也有理由认为他是数学科研到一定境界能够与未来连线的感觉。我认为，这其实都是一种概率很小的必然事件。概率很小那是因为常人都不认为这是容易发生的事情，但的的确确小概率事件往往都会集中在少数人身上发生。正因为这些事件暂时无法科学地解释，因此我认为这是形而上的必然事件。 本文浅谈生活中的形而上的必然事件，读者且当做说笑罢。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Papa Rudin II","slug":"rudin-3","date":"2023-03-08T08:08:27.000Z","updated":"2023-03-08T09:58:50.206Z","comments":true,"path":"2023/03/08/rudin-3/","link":"","permalink":"https://nju-kevin.github.io/2023/03/08/rudin-3/","excerpt":"","text":"今天把$Papa \\space Rudin$的实分析部分看完了，这算是我的第二遍看了，第二遍的收获明显要比第一遍大，一则是知识储备更多，基础更牢固了；二则学习的方法更科学，更注重定理的证明，基础的概念以及定理证明中不同定理之间的联系，更注重方法。也正因为如此，我学到了很多有用的证明方法技巧以及思想，这些是粗略地读书所读不出的。 这里我对$Papa \\space Rudin$实分析部分每一章进行总结，主要说一说每一章的重要的定理以及重要的证明思想。 Chapter 1 Abstract Integration这一章是为了测度论做铺垫，介绍了$\\sigma$代数，可测空间，可测函数，$Borel$代数，$Borel$函数，最小$\\sigma$代数，可测函数的$simple \\space functions$列逼近，$MCT$定理，$Fatou$引理，$L^p$空间，$DCT$定理。这一章的定理都是测度论的基本定理，同时也为之后的$Lebesgue$测度进行引入，许多定理都是今后定理的重要证明手段，其重要性不言而喻。主旋律为集合论的知识，通过$\\sigma$代数将测度与函数联系起来，函数依测度的积分的定义，函数用$simple \\space functions$逼近等手段在后面定理的证明中也时常用到。因此，学好这一章可以锻炼集合论应用的熟练度，同时这一章中已经涵盖了不少可测函数命题的证明，还可以加深对于测度，可测函数的性质的理解。 Chapter 2 Positive Borel Measure这一章在整本书中都有着举足轻重的地位。介绍了实分析所需的必要的点集拓扑，尤其是$Uryshon \\space lemma$，局部紧的$Hausdorff$空间的紧子集的单位分解，$Riesz$表示定理（证明十页纸要会背），$regular$测度（蕴含了内侧度与外侧度的概念，但$Rudin$并未提及），正式引入$Lebesgue$测度，$Lusin$定理（复可测函数用紧支集的连续函数从下逼近），$Vitali-Caratheodory$定理（实值可测函数用上半连续和下半连续分别从下和从上逼近）。这一章引入非常重要的$Lebesgue$测度，事实上，学到后面我们会发现，$Lebesgue$测度是相对来说更特殊的更好的测度，一般的测度可以与$Lebesgue$测度进行比较。这一章的构造性更突出，因此我认为主旋律是巧妙的构造，尤其是利用$Urysohn \\space lemma$进行的函数构造，对于很多定理的证明都有很好的效果。另外需要注意区分$Borel$集和$Lebesgue$可测集。最后两个定理对于$L^1(\\mu)$的函数的逼近定理同样十分重要，读者在后面能看到他们的应用。 Chapter 3 $L^p$ Spaces本章介绍了实分析中的重要空间：可积空间，以及可积空间上自然定义的范数。介绍了$Jensen$不等式，$Minkowski$不等式，$Holder$不等式，连续函数空间与可积函数空间的关系（$C_c(X)$在$L^p(X)$中稠密，这让我们在今后的证明中得以如鱼得水地使用$density \\space argument$），$L^p$空间的完备性。这一章使用的证明技巧则很好地体现了分析的特点，主旋律为不等式与函数的逼近，从而第一章中的$MCT$定理，$Fatou$引理，$L^p$空间，$DCT$定理会被广泛地使用，从这一张开始，集合论的语言不再为主导，内容将会更有分析的味道。 Chapter 4 Elementary Hilbert Space Theory通过标题也能够明白地看出，这一章的重点是介绍$Hilbert$空间，既然有内积，那就有垂直，从而可以将空间分为一个闭子空间以及与之垂直的空间，$Hilbert$空间上的线性泛函也可以用内积来表示，进而引入正交集，有$Fourier$分析中类似的部分和，最小逼近，$Parseval$不等式，$Weierstrass$定理（用三角多项式逼近连续函数），$Hausdorff \\space Maximal$定理。由于$Hilbert$空间是一种特殊的$Banach$空间，因此范数的运算必不可少，我认为本章的主旋律是正交。有很多关于正交集的结论，深刻揭示了$Hilbert$空间的内部结构。 Chapter 5 Examples of Banach Space Techniques本章有许多泛函的味道，介绍了有界线性泛函，$Baire$定理（进而完备度量空间不是第一纲集），$Banach-Steinhaus$定理（即泛函分析中的共鸣定理），开映射定理，$Hahn-Banach$定理（即泛函延拓定理），$Fourier$级数的点态收敛性。本章的重点是几个大定理，可以说$Rudin$的实分析把泛函分析的几个大定理都介绍了，每个定理的证明的过程都很长，但能看出其中的思想，常用的有数学分析里的区间套定理，构造偏序集利用$Hausdorff \\space Maximal$定理，主旋律我认为是正统Banach空间的分析手法，学好这一章，对于$Banach$空间以及泛函分析的理解都会深刻许多，对于利用范数的证明也能更加行云流水。 Chapter 6 Complex Measure本章介绍复测度（事实上之前说的都是正测度，这之间还有实测度（亦即符号测度）$Rudin$并未提及），复测度是测度的推广，但又是不完全推广，因为复测度需要收敛，从而不能无界，这里便有了全变差，正变差，负变差，测度的绝对连续，测度的相互奇异（$singular$），$Lebesgue-Radon-Nikodym$定理（非常重要，证明要会背）实际上提供了复测度相对于一个正测度的$Lebesgue$分解，以及得到了一个$Radon-Nikodym$导数，$Hahn$分解定理，复测度对于$C_0(X)$上的有界线性泛函的表示定理（与$Riesz$表示定理比较），正测度对于$L^p(\\mu)$上的有界线性泛函的表示定理。本章$density \\space argument$被广泛地使用，足以证明了它在定理证明中的重要性，这一章后面的表示定理的证明都十分长，但我认为掌握他们是百益无一害的，本章的主旋律为$density \\space argument$（我不知道中文叫什么所以写英文了），这是证明中十分常见且有用的方法，对于解题有着极大的利好。 Chapter 7 Differentiation本章介绍测度的导数，其实和数学分析的思路一样，实分析中也有测度的导数，微积分基本定理，推广到测度空间上会有些许不同。从测度的导数引入，对称导数，测度的最大函数，可测函数的最大函数，弱收敛（$Weak \\space L^1$），$Lebesgue$点，揭示了复测度的对称导数与$Radon-Nikodym$导数的关系，良好收缩到某一点的区间，度量密度，函数绝对连续（$AC$），微积分基本定理，线性算子的导数，变量代换公式。本章的内容极为丰富，介绍了很多概念，使用的证明方法又回归到了测度，从而集合论的证明方法再次发挥巨大的作用，主旋律为经典$Lebesgue$测度方法，有了本章的内容，可测函数的理论得到进一步完善。 Chapter 8 Integration on Product Spaces本章介绍了积测度，函数的分部在分空间上的可测性，$Fubini$定理（重要），积测度的完备化，卷积，函数的分布函数，特定的复合函数利用分布函数的积分公式。这一章在介绍积测度的定义以及性质上花了不少功夫，在证明$Fubini$定理时用到的很经典的证明方法是：要验证满足特殊条件的集合就是原来的大集合，除了证明二者的相互包含关系，还可以先设出来满足的集合，然后证明它与大集合相等；另外对于复值函数可以只看实值部分，实值函数又可以只研究非负函数，因为实值函数可以写成正变差与负变差的差，这也是证明中的一个常用技巧，这样大大简化的命题的复杂性。这一章证明方法可谓是综合运用了前面个章的方法，即有$MCT$，$DCT$的运用，又有集合论，测度论方法的应用，也有弱收敛理论中结合范数的证明（分布函数与弱收敛有着紧密联系）。作为实分析部分的最后一章，我认为这张的主旋律是用已知的方法探索更广的领域，实际上，将测度推广到$\\sigma$代数的$Cartesian$积上就是数学分析中对于多重积分的推广，实分析中的推广更为困难，需要前面打好基础，对于加深实分析的理解有着重要意义。 接下来我将对$Papa \\space Rudin$的章末习题进行练习，同时对于各个章节的定理证明进行复习，以加深硬分析功底。","categories":[{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]},{"title":"重整旗鼓，再度出发","slug":"life-21","date":"2023-03-07T05:19:27.000Z","updated":"2023-03-07T10:11:11.538Z","comments":true,"path":"2023/03/07/life-21/","link":"","permalink":"https://nju-kevin.github.io/2023/03/07/life-21/","excerpt":"","text":"今天为止，保研课的成绩都已揭晓，这次虽然近世代数和大学物理的成绩不是很理想，但仍有亮眼的，数学分析和常微分方程在总体而言算得上顶尖水平。我认为，从这其中可以看出两点：第一、平时的实打实的付出的确能够获得回报。这里需要强调一下必须得是实打实的努力，而不是看上去的表面的那种努力。自己平时努力有没有水分，自己心里最清楚，水分越少，学的越好，最后的结果才能够越优异。其实已经可以看出，这次数学分析和常微分方程两门课程的成绩，即使放到数学系，也是屈指可数的，对于大多数同学都形成了“降维打击”，对于那些不管是酸溜溜的人也好，被伤到吓到以至于自卑的人也好，我想对你们说，这次只是给你们一次心理准备，接下来我会通过一门门的硬核的课，让你们体会到，什么是真正的降维打击！好戏还在后头！第二、通过这两门的考试成绩，虽然不能反映多少信息，但也能看出，我目前的分析功底还是有的（很牢固还谈不上），并且我目前对于分析方面的知识的掌握程度还是很可观的，这也一定程度上说明我目前的学习方法是科学的，合理的，如果能够坚持下去，是可以创造奇迹的。 总体而言，大二上学期的课程的学分绩或许有些微的下滑，然而我看到的是新时代的开始，一个属于我的时代即将到来。接下来的核心课为：概率论基础，复变函数，实变函数，拓扑学，偏微分方程，泛函分析。我将不断提高我的硬实力，并不懈追求每门课的最高给分，既然常微分方程能够接近满分，那么我认为，接下来的课程没有什么能够阻止我拿到高分了。对于许多同学来说，现在可能还是“望其项背”，不久的将来将是“望洋兴叹”。同时，学校里的基础课程学扎实了，竞赛上的突破是迟早的事情。做学问出成绩这件事情，往往是不能急的，很多时候都会在路上遇到许多坎坷和挫折，但认真地坚持下去，之前种下的种子，都会在不经意之间开花结果，一旦绽放，便是异常的璀璨。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"调和分析初探","slug":"life-20","date":"2023-03-05T07:14:58.000Z","updated":"2023-03-05T07:40:59.305Z","comments":true,"path":"2023/03/05/life-20/","link":"","permalink":"https://nju-kevin.github.io/2023/03/05/life-20/","excerpt":"","text":"今天在主要看了点调和分析，一则分析学选讲课程需要，二则我本人对$Fourier$分析、调和分析方向比较感兴趣，而且由于发现寒假学习的$Fourier$分析是“幼儿园版”的$Fourier$分析，对此我也不甘现状，并认为应该多了解一些更现代的分析学（事实上我目前觉得现代的东西还是古典的）。最近发现图书馆里有不少英文版的数学书，其中也找到了不少我只有电子版的书籍，这让我很是欣慰。英文原版的数学书一则价格不菲，二则大多体量庞大，因此一般我不会选择购买纸质书，但是图书馆中的纸质书则给我提供了很大的方便，这些书并不是借阅热门，这也使得我并不需要借走，而可以在来图书馆的时候参阅进行学习。 今天看的$Fourier$分析明显与“幼儿园版”的不同，并且介绍了$L^p$空间与弱$L^p$空间的定义，其上范数的关系是由$Lebesgue$可积函数的分布函数所给出的，弱收敛的定义也与$Rudin$上的相同，只不过$Rudin$上并没有提出分布函数这一个概念。另外还介绍了$L_{loc}^p(\\mathbb{R}^n)$空间，这里面的可积函数的意义是在任意紧子集上可积，这个空间包含的函数更多，因为条件更弱。令我比较震惊的是，两个$L^1$上的函数的卷积竟然是定义在拓扑群上的，卷积给出的定义式则带有群的特征，这种更一般的定义令人称赞。局部紧致的拓扑群上有一个测度，叫做$Haar$测度，计算卷积使用的测度都是使用的拓扑群上的$Haar$测度。 不得不说，调和分析中的确有许许多多令人震惊的结论，而这些结论往往与基础课程实分析，复分析有着紧密的联系。因此分析学就是这样的一门学科，每一门学科都很基础，却每一门学科都始终让你有一种没有穷尽的感觉，即使是最基础的数学分析也是如此啊。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论变换角度看问题","slug":"life-19","date":"2023-03-04T13:47:35.000Z","updated":"2023-03-04T14:06:55.571Z","comments":true,"path":"2023/03/04/life-19/","link":"","permalink":"https://nju-kevin.github.io/2023/03/04/life-19/","excerpt":"","text":"今天主要都在写作业，这听上去似乎有些不可思议，然而事实的确是如此。复分析第一章课后26道题目，老师大概布置了七八道，然而对于英文教材，我向来是不惮付出巨额的努力去学学透的，因此我把26道题全部做了。大体而言，第一章的课后习题并不算难，可以当做练练手的题目，但我必须得承认，许多外国教材写的确实比国内的教材好。从题目的设置就可以看出来，$Stein$的教材习题不算难却每一道都有很高的训练价值，许多题目后给出的提示既能够对解题起到启发作用，也能对于知识结构的掌握进行巩固，我认为这样的课后习题才是真正有价值的习题，以至于我不想错过任何一道题目。做完之后也的确没有让我失望，加深了我对复分析的基础知识的理解。 今天傍晚的时候顾允淇来南大看了看，我请他在九十吃了顿饭。作为南师大的学生，来到南大对南大的一草一木都连连称赞。我不禁思考这样的问题，会不会是由于我每天都在南大校园里，从而没有发现南大的美呢？很多时候，身处其中，反而会被遮蔽，跳出去之后再回看，往往能够看到许多别的东西。平时我觉得很平常的事物，今天经他这么一夸赞，我突然觉得，好像的确是这样。校园里的确有很多美的事物，我之前没有这种感觉，第一可能是我习惯了校园里的风景，出现了审美疲劳，就好像天天住在旅游景区，或许也不会觉得多么有吸引力；第二可能是每天都是匆匆赶路，没有好好地停留下来看过一些事情，今天晚上却让我有了一个机会，慢下来，认真地看看校园里的一草一木，看看那些之前没有注意到的小细节。事实上，学习之余，看看学校里的花花草草，在操场上跑跑步，这种生活是多少人所向往的！美不一定都在校外，校内其实最美。晚上跑完步很累，但在我的筋骨得到活动以后，整个人都愈发充满了活力。 实际上，发现校园里的美就是一种角度的变换。以访客的身份看南大，或许真是美如画的一个学校；而以一个在南大上了很长时间学的学生的视角，可能觉得南大远没有校外的景点有趣。后来做概率论作业的时候，变换角度的思想也在不断得到运用。往往我们计算一个模型的概率的时候，不一定要从正面算，有时先算反面会获得奇效；或者寻找这个模型的等价模型，而等价模型会更容易计算，从而算出原来的模型的概率。学会变换角度，不仅能够让我们对于学习上的一些问题有新的看法，更能让我们走出一些人生的死循环。跳出条条框框，变换看问题的视角，数学上所采用的方法思想，何尝不是人生的哲理呢？","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"论我的学习价值观","slug":"life-18","date":"2023-03-02T23:57:16.000Z","updated":"2023-03-03T00:58:40.623Z","comments":true,"path":"2023/03/03/life-18/","link":"","permalink":"https://nju-kevin.github.io/2023/03/03/life-18/","excerpt":"","text":"昨天晚上和一个女同学聊学习价值观的时候，观念发生了一些碰撞。因此写这篇文章的目的是，对于我现阶段的学习观念进行一个概述，以及我为什么采用目前的这套价值观体系。 事实上，上大学以来，我的学习价值观也发生过变化，有的时候甚至是重大的变化。例如，大一上学期的时候，我还没有完全适应大学的生活，一心学习几乎没有社交；大一下的时候我便把我的重心放在了社交方面，这却导致我的学习变成了一团乱麻。暑假的时候我有认真思考过，到底哪一种是我更想要的，我觉得学习成绩的退步让我在今后的升学中处于劣势状态，因此我决定开始缩减社交在我生活中的占比。大二上开始我渐渐开始寻找学习与社交的某种平衡，这其中也包括了反复试错，如何在不影响学业的前提下进行有意义的社交。到目前阶段，我在数学的学习中找到了兴趣，社交也只是固定几个能谈得来的朋友了，但我觉得也很开心，每天学到很多的知识让我倍感充实。 昨天晚上我和同学交流的主要概括为如下几点（前提的也强调的很清楚，这只是我的建议，不必完全采纳，也不必全盘接受）：第一、学会实时调整自己的学习状态。当自己感到比较累或者疲惫的时候，干点其他有意义的事情，比如写些东西，运动，看看文学小说书等等，目的是为了更好地投入专业课的学习中，适当的休息是必要的；第二、要有明确的目标。不仅要有大目标，还要学会把大目标“切切小”，比如一个学期想干点什么事情，或者这个礼拜想干些什么事情；第三、要学会合理规划自己的时间。时间大家都是一样的，浪费掉的时间再也回不来了，我的建议是把零碎的时间也利用到学习上，打游戏或者看视频这些时间也就过去了，但这个过程中却不能学到什么，别看零碎时间短，利用好的话能学到不少东西的；第四、学会从自己的专业课中找到乐趣。我认为，源于学习的乐趣是最为长久的，这比任何物质的、娱乐的乐趣都要持久，并且能持续给自己充实感。而学习中的乐趣哪里来，首先要能够“钻”进去，只有看懂了才会有乐趣，否则如果看不懂哪里来的乐趣呢？一旦发现自己能看懂，有乐趣，那便是一个良性循环。 以上大概是我昨天对那位女同学所说的，具体我也举了不少例子，费了不少口舌。我的目的也不是为了说服她，只是为她提供一种思路，因为她说感觉什么事情都不想干。我认为有这种感觉首先得承认有考试周的作用。考试周结束以后本来紧绷的弦突然松了，的确会感到无所适从，这是正常现象。但如果松的时间太久，想要紧就紧不起来了，我从这一现象中，其实更看到了这种恶性循环，连锁反应，更何况她也感觉这个学期任务还挺重的，长期以往容易任务越积越多，越多反而越不想做的情况。为了避免让她出现这种情况，我便向她提出了如上四点建议。 本来我也是想让她参考参考，但后来发现很无奈，她不太能接受我的学习方法。具体我问她是为什么，她则表示，自己的兴趣并不全在学习上，自己的专业是化学生物，但对地理的感兴趣程度要大于专业课；同时，她认为每天都要学专业课，过于循规蹈矩，不喜欢这样日复一日无聊的日程，从而想干些别的事情；另外，她还认为，我的这种学习思路压制天性。 说实话，听到她的反馈，实在是比泛函分析还要让我心犯寒。虽然我也没打算让她接受我的学习价值观，但是可能有这样的价值观的人还是太少了。首先，我并没有说让她把全部时间花在学习上，我只是说重点宜放在学习上，因为她也想要研究生考出南大，那难道不努力就能考出南大吗？除非去南大下面一些的学校，比如去一些好一点的985高校，那可能确实不需要多努力。其次，她说兴趣在地理上，那现在其实我都觉得她过的应该挺累的。现在再去转专业不是很现实，而自己学的东西却没有足够的兴趣，她也说对化学有兴趣，但没有地理多，那就好像是，自己是一个修车工，但同时又对造轮船更感兴趣，那作为一个修车工，不多钻研自己的工作，又如何能把自己的本职工作做好呢？其次，她说每天的学习都循规蹈矩，觉得过于刻板，我认为这说白了就是，她想干别的事情了，比如出去玩，出去吃饭，出去看电影等等。这实际上还是她没有真正在学习上找到乐子，觉得每天学化学很辛苦，而她的内心向往自由，向往自然，不想整天看着死板的化学书。我其实也能够理解，但作为我来说，尽管我每天学的都是数学，但学的内容也是不一样的，为什么会觉得循规蹈矩呢？这个时候过自由的生活，不好好努力，以后就会被工作，被生活拘束。最后，她表示我这样的学习方式很压制天性，她一说出来我就立刻明白了，她和我不是一路人，至少在学习方面。每个人确实有每个人的学习方法，但很多时候，都是需要花时间的，我并不觉得我每天早起用功读书是在压制我的天性。又没人来逼我，我自己也没有逼自己，我要是自己逼自己那过不了多久就坚持不下去了。而且我现在这样看上去是需要超凡的毅力，然而我自己心里最清楚，找到学习的乐趣之后，学习是一件很快乐的事情，每天的规律作息养成习惯了就不难坚持了。有的人出去玩出去旅游觉得很开心，我每天学习照样很开心，难不成非得出去玩、打游戏、看视频才能开心？记得高中班主任袁小建的QQ签名就是，“身体和灵魂，总有一个要在路上”读书便是灵魂的旅行，这一点恐怕是很多人都无法体会到的罢。 在她对我的学习方法提出质疑后，我也曾怀疑过，到底是不是我的方法出了问题？但我很快就打消了这种念头。虽然我的周围没有和我类似的学习观念的人，但每天在图书馆，都能看到许多熟悉的面孔，我也都能看到许许多多很努力学习的同学，每天早出晚归，甚至到深夜才回来。那他们又是为了什么呢？考试周在图书馆的有很多都是考试抱佛脚的，考完试还去图书馆的，才是把这件事当做习惯的。考试周以后的图书馆明显少了许多人，但每天还是有很多同学在图书馆读书，自习，交流讨论，我也认识很多数学系的同学，对于数学的热情和专注都是一般人所无法想象的。 追求真理的路途注定是孤独的。有些人可以当生活上的伙伴，甚至可以做自己的知己，但即使是知己也不意味着所有观念都会相合。更何况我还有更崇高的使命等待我去完成。时间将筛选出那些真正能耐得住寂寞，能坐得住冷板凳的人，不管别人是否赞同我的观念，我都将坚守初心，坚守理想，即便孤独，亦能从容不迫，始终如一。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Topics in Analysis","slug":"lesson-4","date":"2023-03-02T11:56:11.000Z","updated":"2023-03-02T12:25:38.251Z","comments":true,"path":"2023/03/02/lesson-4/","link":"","permalink":"https://nju-kevin.github.io/2023/03/02/lesson-4/","excerpt":"","text":"这篇文章为课程《分析专题选讲》的课程笔记，主要记录我在学习这门课程时的想法以及与授课老师孙永忠教授的讨论与交流。与该专题的文章一样，这篇文章将每周更新。 第一周第一周为导论课，主要介绍了$L^2(\\mathbb{T})$空间上的$Lebesgue$可测函数的$Fourier$系数的定义，以及$Hilbert$空间完全正交系以及完全正交基的构造，证明了几个$Fourier$级数的性质，例如在$L^2$范数意义下的最佳逼近定理。这次课让我意识到，在寒假里学的$Stein$的第一部著作只能叫做$Fourier$分析的导论，因为它介绍的还是欧式空间上的$Fourier$分析，而没有研究更一般的$Lebesgue$可测函数空间的$Fourier$分析。 课后我问了一下关于$Stein$第一部里的一些内容，也正是这次提问让我真正意识到我其实并没有完全意义上学会$Fourier$分析，也让我再一次意识到这门学科内容的丰富性。 第三周本周的课程从上周未谈完的正交系的完备化入手，其实就是证明三角函数系的完备性。对该定理进行证明后，引入卷积（$convolution$），并且介绍了卷积的很好的性质，即两个函数做卷积以后，遗传了两个原函数中更好的性质，例如一个光滑函数与一个可积函数做卷积之后得到的函数也是光滑的，这种良好性质的遗传性就体现了卷积的作用。引入卷积之后自然可以得到恒等逼近定理，可以取一个良好性质的函数列（其实就是$good \\space kernel$）与一个函数做卷积得到的卷积列的极限在连续点的取值就是原函数在该点的取值，这也是为什么被称作是恒等逼近。 课后我与孙老师交流了三个问题。第一个问题在于一开始对三角函数系的完备化定理的证明中，思路是先对连续函数证明，再对可测函数进行证明。这种证明手法在$Papa \\space Rudin$中屡次出现，于是是否可以使用$C(\\mathbb{T})$在$L^p(\\mathbb{T})$中稠密的性质一句话说明对于$Lebesgue$可积函数也成立呢？对于这个问题，孙老师表示这是一个好问题，并且他也思考过，答案是否定的。因为使用$density \\space argument$的时候是用来逼近要证结论中的函数，但这个问题中，函数出现在条件中，那么用连续函数进行逼近起不到任何效果。我思考了一会也明白了，因为$density \\space argument$往往是对于要证结论中的函数进行逼近会有很神奇的效果，也正因为如此实分析里许多定理的证明也经常使用这个技巧，但如果是条件中的函数，用更特殊的函数进行逼近是起不到效果的。其次，我指出孙老师上课所讲的恒等逼近定理所用的一列函数其实就是所谓的$good \\space kernel$，并且$Stein$书上给出的定义与课上老师给出的定义有着些微的不同，孙老师解释道，他给的定义其实和所谓的$good \\space kernel$的定义是完全一样的，用$Stein$的定义方式可以推出他的定义方式。第三个问题其实是我在复习数学分析C的时候看到一个定理，那就是用鼓包函数与一个函数做卷积可以得到该函数的光滑逼近，我认为那个例子和这里的内容有着密切的联系。然后孙老师指出其实用来逼近$Dirac$测度的函数列就是一种鼓包函数（$bump \\space function$，即具有紧支集的光滑函数），比如说 f(x)=e^{-\\frac{1}{1-x^2}}就是一个鼓包函数，鼓包函数可以视作一个“光滑子”，通过卷积作用在任何函数上都能得到一个光滑函数。此时数学分析C的记忆又开始涌现，依稀记得苗栋很喜欢使用鼓包函数，我也认为我对鼓包函数的理解还不够深刻，因此下次与苗栋交流的时候我也打算请教一下。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"关于学习深度的思考","slug":"life-17","date":"2023-03-01T11:51:06.000Z","updated":"2023-03-01T12:39:57.255Z","comments":true,"path":"2023/03/01/life-17/","link":"","permalink":"https://nju-kevin.github.io/2023/03/01/life-17/","excerpt":"","text":"今天上午把周一的上同调课程作业做完后，眼睛有些干，感觉又得了上学期的干眼症。这次的原因我认为可能还是用眼过度，没有及时休息，加上饮食习惯不够健康，蔬菜水果吃得少，水也喝得少，饮食比较油腻。去校医院配了个眼药水以后滴了几次感觉些微有所缓解。每当这个时候我便尤其地向往身体没什么小毛病能够尽情学习的日子，健康也确实是这样的，拥有它的时候往往不注意，有点小毛小病的时候才意识到还是健康最重要，所以这也启示我们，不管生活上遇到什么困难与挫折，要保持心态良好，身体健康，健康永远是第一位。 下午复习高等代数的时候，孙长旭给我发了一份讲义，是清华大学丘成桐数学英才班的数学分析讲义，我粗略地浏览了一下，发现里面的内容十分丰富，并且的确像传闻的那样，学的深度很深。这份讲义将数分与实分析，泛函分析，Fourier分析完全连接了起来，介绍了$\\sigma$代数，测度的定义，测度的积分，甚至还介绍了泛函分析中算子的谱；Fourier分析部分也介绍了不少应用问题，比如$Dirichlet$问题，热方程问题等。可见，从学习数分开始，清北的学生便已经开始接触大二、大三所学的专业知识了，这也是他们能在丘赛、阿赛等数学竞赛中崭露头角的原因。 这不禁让我思考学习深度的问题。其实学习的深度并不能过于草率地决定，丘班的数学分析的深度也和它的生源质量有很大关系，进入丘班学习的都是高中竞赛的佼佼者，他们的接受能力都远远比普通的学生强，一般的学生连最基本的数分高代（我戏称为“幼儿园版的数分高代”）都学不会，更不可能给数分加深度了。事实上，提高深度的好处就在于能够更早地建立联系，让学生发现数学分析是分析学的基础，它和后面的许多课程都拥有者紧密的联系。更早地学习一些更深层次的理论有助于加深对于数学的理解，这样便可以站在更高的角度上看问题。但同时也有一个基础的问题，学新知识的同时也不能忘记巩固旧知识，只有加强巩固基础，才能让所谓的“深度”具有真正的意义，否则就像是沙子上造楼，沙堆一移动，楼房便东倒西歪了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of De Rham Cohomology","slug":"lesson-3","date":"2023-02-28T05:31:16.000Z","updated":"2023-03-02T11:54:03.565Z","comments":true,"path":"2023/02/28/lesson-3/","link":"","permalink":"https://nju-kevin.github.io/2023/02/28/lesson-3/","excerpt":"","text":"这篇文章是对于课程《从微积分到上同调》的学习记录，将于每次课后更新。《从微积分到上同调》是南京大学数学系石亚龙老师开的课，将从微分形式开始，介绍微分形式的定义，流形上的微分形式以及运算，$De \\space Rham$上同调，向量丛与示性类。 Week 3由于已经有了第一次课的铺垫，这次课首先回顾了外积运算的定义，以及所谓的$\\text{Alt}^p(V)$空间上的$p$重线性函数的运算。然后介绍了外积运算的性质，具有结合律，交换变号率，以及很重要关于如何由$V^*$上的对偶基生成$\\text{Alt}^p(V)$上的基的定理。这个定理对于后面微分形式的定义是极为重要的。然后介绍了外代数的定义以及从$\\text{Alt}^p(W)$到$\\text{Alt}^p(V)$上的拉回（$pull \\space back$）运算. 接下来开始定义欧式空间上的微分形式，欧式空间上的微分形式是$\\mathbb{R}^n$上的开集$U$到$\\text{Alt}^p(\\mathbb{R}^n)$的光滑映射，并且其作用在某一个$\\mathbb{R}^n$上的向量就是对于各个分量求该向量方向上的方向导数。由于之前已经知道了$p$重线性函数空间的一组基，一般的微分形式可以表成 \\omega=\\sum_{I}{\\omega_{I}\\epsilon_{I}}而由简单的计算可以知道 \\epsilon_{I}=dx_{I}于是 \\omega=\\sum_{I}{\\omega_{I}dx_{I}}这样定义的微分形式与数学分析中所讲述的微分形式是一样的，但用外代数的语言描述更具有一般性。同时还介绍了微分形式的外微分： d\\omega(x)(v_1,\\cdots,v_{p+1})=\\sum_{i=1}^{p+1}{(-1)^{i}(D_x\\omega)(v^i)(v_1,\\cdots,v_{i-1},v_{i+1},\\cdots,v_{p+1})}课上的节奏比较快，有些地方当时记下来了但还没来得及仔细思考，上完课九点半就在附近找了个空教室把课堂上记的笔记重新翻看了一遍，之前不太明白的地方瞬间明白了，这不禁让我体会到，课后及时消化的重要性，否则，等时间长了，早就忘记了之前上课老师是怎么讲的了，如果一学期的课都不及时消化，等待考试前便会有许多不会的地方，到那时再去看，很难看懂，并且也来不及了，这就是及时消化的好处。我认为昨天的课程不仅是对我的数学分析和高等代数基础，还是流形的初步知识，都是大有裨益的。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"泛函分析初体验","slug":"life-16","date":"2023-02-27T08:51:47.000Z","updated":"2023-02-27T09:11:45.916Z","comments":true,"path":"2023/02/27/life-16/","link":"","permalink":"https://nju-kevin.github.io/2023/02/27/life-16/","excerpt":"","text":"今天白天没课，因此在图书馆。上午把第一周的泛函分析的作业做了，下午看完了$Stein$的复分析第一章，学习了些关于测度空间上的微积分基本定理的内容。今天给我印象最深的一件事就是泛函分析的确不是那么容易的。还记得之前听课的时候觉得老师上课讲的东西都很$trivial$，因此感觉好像也就那样，结果今天上午一做题就发现，事情远没有我想象的那么简单。 目前泛函分析在介绍基础的点集拓扑（主要是度量空间上的一些性质），做题的过程中就可以发现我虽然说学过点集拓扑，但其实基础并不牢固，这也是我下阶段需要补强的地方。泛函分析就像是上图所示的丛林一般，基本的点集拓扑是大树的根系，而根系与根系之间又是交错、紧密相连的，建立在盘根错节的根系上，树才能长得坚韧不拔，毕竟泛函分析研究线性或者是非线性的算子，而这些算子的作用对象都是空间中的元素，空间与空间之间建立联系，就需要运用更一般的拓扑空间上的映射。而点集拓扑学由于其本身既抽象又具体，既直观又反直观，导致它虽然没有抽象代数那样抽象，但如果凭感觉是完全学不到精髓的，因此我认为在点集拓扑方面还需补强，这是后续分析学的基础，不容小觑。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"抽象代数漫谈","slug":"life-14","date":"2023-02-25T00:24:56.000Z","updated":"2023-02-25T05:56:41.120Z","comments":true,"path":"2023/02/25/life-14/","link":"","permalink":"https://nju-kevin.github.io/2023/02/25/life-14/","excerpt":"","text":"考核周进入尾声，抽象代数和常微分方程一个在考试周最后一天一个在考试周第一天，从这个安排上也能看出数学系的老师们的用心了，即不想让我们有比较多的时间出去玩，这样一方面便于复习，另一方面，也能更好地衔接新学期的课程，毕竟考试周与新学期课程中间并没有缓冲区。 对于近世代数期末考试的重点部分，在这里简要做一下罗列与总结。 Part I 环论基础这一部分主要是介绍环的基本知识，包括环的定义，整环的定义，含幺环的定义，交换环的定义，等等。有一些例子，例如剩余类环，整数环，多项式环，矩阵环等。另外介绍了环的单位（乘法可逆元），单位构成群叫做单位群。比环更强的代数结构是体（$skewfield$）和域（$field$）。如果一个含幺环的非零元都是单位，那么该环为体；如果非零元都是单位且非零元构成$Abel$群（即非零元都可交换），则该环为域。这里提一下，数域是有理数域$\\mathbb{Q}$的有限次扩张。 然后便是环中的一个重要的概念——理想。理想可以与群中的正规子群对应，并且理想中的元素可以用环$R$中的元素的线性组合表示。$R/I$为理想的商环，与群中一样，环中也有环的同态基本定理： \\text{Ker}(\\sigma)\\unlhd R, \\space \\text{Im}(\\sigma) \\leq \\bar{R}, \\space R/{\\text{Ker}(\\sigma)}\\cong \\text{Im}(\\sigma)有这个定理就可以相应地得到同构定理，以及商环的理想等结论。 环之间也有运算，例如环的外直和与环的内直和，外直和是通常的坐标分量定义的方式；内直和的定义则规定了元素表示的唯一性。可以证明，外直和与内直和是等价的。同样的，理想之间可以相乘，即理想的乘积，且若理想$I$与$J$互素，在幺环$R$中有 IJ+JI=I \\cap J从而对交换幺环中的两两互素的理想$A_1,A_2,\\cdots,A_n$，有$\\displaystyle{\\prod_{i=1}^{n-1}A_i}$与$A_n$互素，且 \\prod_{i=1}^{n}A_i=\\bigcap_{i=1}^{n}A_i进而可以导出环中的中国剩余定理： R/(A_1\\cap \\cdots \\cap A_n) \\cong R/A_1 \\oplus \\cdots \\oplus R/A_n对于理想有两个很重要的概念——极大理想和素理想。对于交换幺环极大理想必是素理想，因为素理想等价于商环为整环；极大理想等价于商环为域，而域一定是整环而整环不一定是域，从而可知极大理想一定是素理想（交换幺环中）。全体素理想的交为环的诣零根，对于交换幺环来说，诣零根由全体幂零元构成。 Part II 几类典型的交换环首先是形式幂级数环和多项式环，有一个很重要的性质就是$R$与$R[x_1,\\cdots,x_n]$有着相同的单位群，且若$R$为整环则$R[x_1,\\cdots,x_n]$也为整环。对于多项式，正如高等代数中所述，可以做带余除法，并且任意交换幺环上的对称多项式都可以写成初等对称多项式的多项式。 其次就是$Euclid$整环（$ED$）和主理想整环（$PID$）.$ED$一定是$PID$，这里需要知道如何证明一个具体的环是$ED$.域上的一元多项式环是$ED$，从而为$PID$.在主理想整环上有相伴、不可约元、素元的概念。整环中素元为不可约元，而在$PID$中，不可约元也是素元，因此主理想整环中不可约元和素元等价。主理想整环中有唯一分解定理，其中使用的方法便是很经典的理想升链方法。 对于任意理想升链都满足理想升链条件的环（每个理想都是有限生成的）为$Noether$环，$Noether$环有三条互相等价的结论；并且$Noether$环上的一元多项式环也是$Noether$环（$Hilbert$基定理），从而$n$元多项式环也是$Noether$环（$PID$当然是$Noether$环） Part III 域论域论中的内容有很多，其中需要特别关注的有有限域的性质，域的代数扩张，正规扩张，可分扩张，构造有限域的方法，域扩张的传递性，域扩张的等价条件，域扩张的证明方法，有限域中运用多项式理论的证明方法，以及简单的域的$Galois$理论。这部分内容比较繁杂，因此不再一一罗列。 目前将课本上的证明都过了一遍，接下来打算把冯克勤的课本以及课后习题《近世代数三百题》上面做的题目看一遍，主要是掌握证明的方法。晚上再把课本上的定理以及定理的证明方法过一遍，基本上就算是复习完成了。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Complex Analysis","slug":"lesson-2","date":"2023-02-24T01:02:45.000Z","updated":"2023-03-06T06:31:58.087Z","comments":true,"path":"2023/02/24/lesson-2/","link":"","permalink":"https://nju-kevin.github.io/2023/02/24/lesson-2/","excerpt":"","text":"概要这篇文章是对于复分析的学习笔记，不会记录很完整的知识点以及知识结构，但会记录我对于复分析这门课程的各种问题的思考以及一些经典习题的思路与解答。和之前的课程系列的文章一样，这篇文章将会每周更新。 第四周（2023.03.06更新）上周在做$Stein$复分析作业的时候，对于$\\frac{1}{z-a}$沿圆周积分的问题有些模糊，不清楚奇点在圆周包含的区域内与外时积分得到的结果有什么区别，$Stein$上第一章也没有介绍。因此我认为$Stein$的复分析在这方面做的欠妥，当然也有可能是想要放到第二章$Cauchy$定理那里一起讲的缘故，但由于第一章的习题出现了相关的问题，这容易导致学生做题时一头雾水。 上午在看$Papa \\space Rudin$的时候发现复分析部分讲的内容以及顺序的安排更为合理。在介绍完解析函数以及沿曲线的积分之后，直接引入了指标的概念： \\text{Ind}_{\\gamma}(z)=\\frac{1}{2 \\pi i}\\int_{\\gamma}{\\frac{d\\zeta}{\\zeta-z}}可以证明，$\\text{Ind}_{\\gamma}(z)$在$\\Omega=(\\gamma^*)^c$的有界连通分支上是正整数函数，在无界连通分支上为0。有了这个结论，那么 \\int_{\\gamma}{\\frac{1}{z-a}dz}=2\\pi i \\text{Ind}_{\\gamma}(a)因此只要圆周包含$a$，对于圆周内的区域，$\\text{Ind}_{\\gamma}(a)=\\text{Ind}_{\\gamma}(z)$，$\\forall z \\in \\Omega_1$.从而我们可以计算该圆周的圆心关于圆周的指标，这显然是$1$，从而原积分值为$2\\pi i$.如果圆周不包含$a$，即$a \\in \\Omega_2$，那么由于$\\Omega_2$为$\\Omega$的一个无界连通分支，从而指标为零，原来积分也为零。 学到这里，其实我们就会发现，$\\frac{1}{z-a}$这个复变函数沿曲线的积分有着其特殊性。$Cauchy$定理与这个问题有着紧密的联系。这里我们列举一下几个结论： Theorem 10.12 $F \\in H(\\Omega)$ with $F’$ continuous, then for every closed path in $\\Omega$ we have \\int_{\\gamma}{F'(z)dz}=0Theorem 10.13(Cauchy for a Triangle) $\\bigtriangleup$ closed in open set $\\Omega$, $p \\in \\Omega$, $f$ continuous in $\\Omega$, $f \\in H(\\Omega-\\{p\\})$, then \\int_{\\partial{\\bigtriangleup}}{f(z)dz}=0Theorem 10.14(Cauchy in a Convex Set) $\\Omega$ convex open set, $p \\in \\Omega$, $f$ continuous, $f \\in H(\\Omega-\\{p\\})$, then for every closed path $\\gamma$ in $\\Omega$ \\int_{\\gamma}{f(z)dz}=0 以下对这三个定理（以下简称定理1，定理2，定理3）讲的事情进行翻译： 对于一个连续函数$f$，如果能够找到它的原函数$F$，即$F’=f$（特别地$F$全纯）那么该函数在任意闭曲线上的积分为零。 对于开集中的三角形闭曲线，$f$连续且在$\\Omega$中除了一点$p$以外全纯，那么$f$在三角形上的积分为零。 对于凸开集上的连续函数$f$且在$\\Omega$中除了一点$p$以外全纯，那么$f$存在原函数，从而由1知沿任何闭曲线积分都为零。 定理1成立是显然的，有一个很重要的推论： \\int_{\\gamma}{z^n}dz=0, \\space (n \\neq 0)从而对于闭曲线，$z^n$的积分为零。 对于定理2，可以先考虑$p$不在三角形边上的情况，对于三角形进行中点分割，应用闭区间套定理以及定理1的推论；对于$p$为顶点的情况可以对三角形进行划分，应用第一种情形以及$f$在三角形上有界；$p$在边上时，划分为两个三角形利用前两种情况即可。 定理3则是直接构造原函数，很朴素的想法就是$f$的变上限积分，因为集合是凸集，任何两点的连线都完全属于$\\Omega$（这让我想起了《从微积分到上同调》这门课上证明星形区域的一阶上同调为0时所采用的方法是一致的），证明需要用到沿三角形曲线积分为零的性质。定理3可以直接推出凸集上的$Cauchy$积分公式： f(z)\\text{Ind}_{\\gamma}(z)=\\frac{1}{2\\pi i}\\int_{\\gamma}{\\frac{f(\\zeta)}{\\zeta-z}}$Cauchy$定理的逆定理（$Morera’s \\space Theorem$）也是上述定理的直接推论。它论述的是如果开集中的连续函数沿开集中的任意三角形曲线积分为零，那么该函数在开集中全纯。证明也是容易的，可以同样利用变上限积分构造原函数，方法与定理3没有任何区别。定理3由于是凸开集，从而开集中的连续全纯函数沿三角形积分为零，这里可以考虑凸开子集，三角形积分为零为条件（此时不能利用定理2的结论因为$f$ 不一定全纯），从而可以找到原函数$F$，$F$全纯。全纯函数的导函数仍然全纯（因为全纯函数与解析函数没有任何区别，解析函数可逐项求导且得到的导函数仍解析，从而全纯），于是$f$在任意凸开集中全纯，从而在$\\Omega$中全纯。 接下来对于以上所述进行总结。问题的引入是一道$\\frac{1}{z-a}$的作业题，这个积分有可能不为零的原因是，复分析中$\\frac{1}{z}$没有原函数！这与实值函数不一样。连续函数一旦有了原函数，沿闭曲线的积分便为零。我想正是由于这种特殊性，才会引入所谓的指标的概念，进而研究指标的计算和性质。有了指标的概念与性质，让$\\frac{1}{z}$沿闭曲线的积分的可算度大大提高，很多时候也能够简化计算。对于开集上的连续全纯函数（允许在某一点不全纯），沿三角形的积分为零；反之，对于开集上的连续函数，若沿任意三角形积分都为零，那么该函数全纯。对于凸开集上的连续全纯函数（允许在某一点不全纯），存在原函数，从而沿任意闭曲线的积分为零。","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"Study of Probability","slug":"lesson-1","date":"2023-02-24T00:09:22.000Z","updated":"2023-03-02T12:38:30.706Z","comments":true,"path":"2023/02/24/lesson-1/","link":"","permalink":"https://nju-kevin.github.io/2023/02/24/lesson-1/","excerpt":"","text":"概要这篇文章（math-8）将记录在《概率论基础》这门课程中我对于一些问题的看法以及对于习题的解题思路，与之前一篇关于$Papa \\space Rudin$的类似，并将每周更新。 第一周第一周课程的内容并不算多，介绍了概率空间的最基本的三个量：样本空间$\\Omega$，概率的定义域$\\sigma-$代数，以及概率测度。同时简单介绍了测度的性质，只要学过$Papa \\space Rudin$第一章，那么学起来便丝毫不费力。需要注意区别的是概率测度和一般的正测度不一样，因为全空间的概率测度必为1. 第一周的作业并不算难，课本第8题简单利用二项式展开的性质即可证明；第33题最好的方法是利用求和式证明，而不是省略号，这样显得不严谨，以下写一下33题的证明过程。 Prove that \\begin{aligned}P(A_1 \\cup \\cdots \\cup A_n)=&\\sum_{i=1}^{n}P(A_i)-\\sum_{1 \\leq i","categories":[{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"}],"tags":[]},{"title":"小作业里的大乾坤","slug":"life-13","date":"2023-02-23T13:33:26.000Z","updated":"2023-02-23T13:56:20.841Z","comments":true,"path":"2023/02/23/life-13/","link":"","permalink":"https://nju-kevin.github.io/2023/02/23/life-13/","excerpt":"","text":"今天是考试周的思政日，图书馆，教室，休息区沙发…凡是能看到学习的学生的地方，就一定有背书的同学。背书，说实话，并不是一件令人开心的事，然而好在我的记忆力尚且可以，对于思政课的考试重点内容，背起来仍是不费力，可以说，我在考试前做了充分的准备，毕竟背了三个半天。考试时答题也自然是畅通无阻，心中不禁再一次感叹，考前的认真准备就是为了考试过程的轻松以及考试结果的理想。准备得累一点，考试就会轻松一些，从而成绩也就会更好看一些；如果在准备的时候偷懒，贪图享受，那么考试的时候便会给你眼色看，考试结果更会是一种打击。 之前便强调过，平时的认真听课，认真作业，考前的认真复习，都会考试过程，以及相应的考试结果。我一直相信，平时偷的懒，考试的时候会加倍奉还。与其平时偷懒享乐，不如考试结束以后放松，这样不仅得到了放松，还得到了理想的成绩，何乐而不为？当然这学期是特殊情况，促使我考完后也不能过于放松，还得按照平时的标准要求自己。 晚上在教室把概率论的作业做了，看似只有三道题，然而我却发现这小小的作业之中竟然藏着大乾坤。作业并不算很难，但有些关于组合数的知识点由于太久没用有了遗忘，本想查查资料，但我转念一想，作业可以做的慢点，因为作业的快慢其实影像不了什么，然而作业的独立完成度却能产生很大的影响。作业不独立完成，就失去了一次独立思考的机会，长期以往，独立解决问题的能力便会大大下降，如何能在考场上解决那些没遇到过的问题？因此，遇到不太会的题目，总想着查资料是致命的。事实上，即使是对于$Papa \\space Rudin$上面每一章都有很多道题不会做，我也不会因为不会做而立马翻看答案，而是不断翻阅定理笔记想想自己能够写出点什么，我坚持这样做的原因就是我做的每道题都是一次给我独立思考的机会，如果急于查询答案那么就失去了这次思考的机会，我认为这是万万不可的。哪怕一开始做的慢点，但长期以往解题能力就能切实提高；否则，下次遇到没有答案的题目就只能干瞪眼，是何等的可笑！ 就拿晚上做的概率论作业为例，关于组合数的题目我一开始思考的方向有误，后来考虑多项式的二项式展开以后问题便迎刃而解；再比如证明概率公式，一开始我用的是逐项验证，写出来之后我当然知道它是对的，但求和用省略号写出的证明看上去总有些不让人信服，于是我在做完之后，又尝试了另一种解法，那就是用求和号写出来，用求和变换证明。这样会显得过程较之前复杂很多，但每一项都能够很清楚的算出来，而不是用省略号省略掉了。在这个过程中我也锻炼的求和变换的能力，我认为是大有裨益的。做完这三道题，不知不觉过去了一个小时，然而这一个小时我的收获却远远不止听上去的这三道题这么简单，不禁感叹，小作业里真的有大乾坤，只有认真做才会发现。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Study of Papa Rudin I","slug":"rudin-2","date":"2023-02-22T00:12:00.000Z","updated":"2023-03-02T11:55:41.997Z","comments":true,"path":"2023/02/22/rudin-2/","link":"","permalink":"https://nju-kevin.github.io/2023/02/22/rudin-2/","excerpt":"","text":"第一遍看$Papa \\space Rudin$的时候，急于求成，只看概念和定理不看定理的证明，当然也有当时对于数学的理解不够深入，基础不够牢固的缘故。因此，第一遍学习并没有起到多大的效果，甚至学到测度的微分的时候连$Lebesgue$测度还不熟悉，还不清楚是什么，现在想起来真是可笑至极！ 过了一年后再看，明显感觉理解力不一样了，这一遍我对于定理的理解，证明极为重视，同时也做每章后的练习题加以巩固，不再盲目追求速度，而是多加思考不同的概念，不同的定理之间的联系与区别，发现这个过程中能够加深不少理解。 今天浅谈一下我对于最近学的几个定理的证明的理解。 Theorem 6.16这个定理讲述的是$L^p(\\mu)$与$(L^q(\\mu))^*$之间存在一个一一映射($\\frac{1}{p}+\\frac{1}{q}=1$)，即 \\Phi(f)=\\int_{X}fgd\\mu且 ||\\Phi||=||g||_q其中$\\mu$为$\\sigma-finite$的正测度，$\\Phi$为$L^p(\\mu)$上的有界线性泛函 这里只说一下我认为比较重要的主干部分。证明的核心是利用$Lebesgue-Radon-Nikodym$定理（LRN），而LRN结论的适用范围也很重要，LRN是说，对于$\\sigma-finite$的正测度，如果有一个复测度$\\lambda$与$\\mu$是绝对连续的(absolute continuous)，则可以找到一个$L^1(\\mu)$上的函数使得 \\lambda(E)=\\int_{E}hd\\mu因此首先需要找到一个测度使得与$\\mu$绝对连续，然后运用LRN可以得到一个$L^1(\\mu)$上的函数将该测度联系起来。令 \\lambda(E)=\\Phi(\\chi_E)这个测度满足LRN的条件，同时还将测度与要证的泛函联系起来了，这是一个很值得学习的技巧。 得到这个表示以后，我们便有 \\Phi(f)=\\int_{X}fgd\\mu首先是对$f$为特征函数成立，接着便是对简单可测函数成立，从而对$f \\in L^{\\infty}(\\mu)$成立。这个时候$f \\in L^{\\infty}(\\mu)$，$g \\in L^1(\\mu)$ 我们最终要得到$f \\in L^{p}(\\mu)$，$g \\in L^q(\\mu)$. $p=1$的情况比较好做，$1&lt;p&lt;\\infty$时使用的一个小结论便是 对于任何可测函数$f$都存在一个可测函数$\\alpha$使得$|\\alpha|=1$以及$\\alpha f=|f|$ 然后在证明了 ||g||_q \\leq ||\\Phi||后就可以得到$g \\in L^q(\\mu)$.接下来是另一个很重要的证明技巧，之前得到的等式只是对$f \\in L^{\\infty}(\\mu)$成立，如何进一步到对$f \\in L^{p}(\\mu)$成立是很关键的一步。这里使用的方法是，等式两边分别都是$L^{p}(\\mu)$的连续函数，而两边在$L^{\\infty}(\\mu)$中是相等的，又由于$L^{\\infty}(\\mu)$是$L^{p}(\\mu)$的紧子集，因此由这一点便可以得到两边在$L^{p}(\\mu)$上也相等。 另外证明中还使用了一个如何由一个$\\sigma-finite$的但$\\mu(X)=\\infty$的正测度出发构造一个$\\sigma-finite$的且$\\tilde{\\mu}(X)&lt;\\infty$的正测度： d\\tilde{\\mu}=wd\\mu$w$为Lemma 6.9中的函数. Theorem 6.19这是复测度的$Riesz$表示定理，需要注意的是，$\\Phi$为$C_0(X)$上的有界线性泛函，$\\mu$为regular的复Borel测度，有 \\Phi(f)=\\int_{X}fd\\mu且 ||\\Phi||=|\\mu|(X) 同样的，这里只讲述我认为重要的部分。其实大致思路就是和正测度的$Riesz$表示定理做联系。需要注意的是原本的$Riesz$表示定理的条件是对于正测度$\\mu$以及$C_c(X)$上的正线性泛函.可以看到这三个定理的条件都不一样，Theorem 6.16将正线性泛函推广为有界线性泛函，并且将泛函的作用域由$C_c(X)$推广到了$L^p(\\mu)$上。而复测度的表示定理将作用域由$C_c(X)$推广到了$C_0(X)$上，这一点就启示我们，在证明复表示定理的时候可以利用Theorem 6.16. 首先将$\\Phi$用一个正线性泛函限制，对于这个正线性泛函就有一个正测度$\\lambda$与之对应，并且同时我们还可以发现这样以后$\\Phi$的作用域可以由$C_c(X)$推广到$L^1(\\lambda)$上，于是这时运用Theorem 6.16 的结论，有 \\Phi(f)=\\int_{X}fgd\\lambda但需要注意的是，这里的$f \\in C_c(X)$，因为刚才我们只是把$\\Phi$延拓到$L^1(\\lambda)$上，但$f$并没有延拓。这个时候考虑到$C_c(X)$是$C_0(X)$的紧子集，运用之前那个证明方法便可以让$f \\in C_0(X)$. 需要注意一下，在找限制$\\Phi$的正线性泛函的时候，需要验证几个基本条件，在证明 \\Lambda(f+g)=\\Lambda f+\\Lambda g的时候运用的方法与正线性泛函的$Riesz$表示定理是类似的，可见基本定理证明方法的重要性。","categories":[{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]},{"title":"数学分析学习体验与心得","slug":"life-12","date":"2023-02-21T05:40:09.000Z","updated":"2023-02-22T00:05:17.514Z","comments":true,"path":"2023/02/21/life-12/","link":"","permalink":"https://nju-kevin.github.io/2023/02/21/life-12/","excerpt":"","text":"上午十点，随着试卷提交，三学期的数学分析课程算是画上了一个圆满的句号。突然要告别数学分析这门课，内心却生出一丝不舍。先大致说一下试卷的题目吧： T1 计算$e^{-x}$作奇延拓和偶延拓之后的Fourier系数并求和 \\sum_{k=1}^{\\infty}\\frac{(-1)^k(2k-1)}{1+4k^2}T2 计算一个简单的重积分 T3 三角级数收敛性判断 T4 计算一个广义积分 T5 $Fubini-II$证明（利用exhaustion即可） T6 证明题（利用$Parseval$等式） T7 三重积分的计算（取正交变换后极坐标换元） T8 凸分析（我直接用了局部紧的$Hausdorff$空间的结论，可以解决题目的部分情况） T9 六维欧式范数意义下的$Heisenberg$测不准关系 如今回想，脑中不禁浮现一个个上课时的画面，那些听课的场景不知为何让我感受到很温馨，可能这世上最令人神往的事情，便是在一个阳光明媚的午后，一本笔记本，一支笔，一间教室，听一位老师讲授数学分析了。 这三学期其实也确实做到了善始善终，在这个过程中，我也走过许多弯路，但我认为这三学期对于我的人生来讲，甚至都具有着非凡了意义，可以说，数学分析见证了我的成长，不仅是在数学水平上的成长，更有人生观念方面的成长与进步。第一学期的数学分析不难，一开始都学得很认真，但由于内容不难从而开始掉以轻心，导致高开低走；第二学期更是如此，心思没有放在学习上，数学学习变成了考前突击，也是有周围人影响的原因，数分B其实学的很不扎实（尤其是多元微积分），很多东西连最基本的概念都不明白，更不要说做题目了；大二开始或许也有在数分B上吃了苦头的缘故，上苗栋的课程的时候特别认真，上课笔记都记了好几本，并且不断减少上课摸鱼的时间，加上也有几件好消息（例如CMC考了比较好的成绩），这些都让我重新端正态度进行学习，一个学期之后发现，当我认真地钻进去以后，能够学到不少东西，能够看到问题背后的本质，考试复习的时候，也不需要考前突击，而是通过平时的积累，强化记忆即可。当然，我也注意到实际上我的学习方法还有待完善，很多时候笔记没有及时消化，这我也做过反思。 纵观数学分析的内容，其实真的很丰富。单是主干知识就涉及到了非常多的概念，运算方法和技巧。从庞杂的定理，以及定理的证明中我们都能学到丰富的证明技巧，更不要说定理的应用，推论，推广。可以说，如果能真正学好数学分析，那么对于以后的课程，也都能够融会贯通。而且梅加强的数学分析教材中的内容实际上是“真包含”数学分析的，里面还补充了很多数学分析与实分析、复分析、流形几何、点集拓扑、上同调的衔接知识，因此我认为如果能把梅加强的内容掌握，是可以让自己的水平提高一个档次的，这也是为什么我决定利用这个学期的一些时间把梅加强的数学分析再精读一遍，因为这样便可以得到“加强”的数学分析，而不是“梅加强”的数学分析。 学习数学分析的时光是很快乐的，虽然在学习的过程中遇到阻力和困难是家常便饭，但我最终还是走过来了，数学分析将成为我的有力的工具，帮助我开辟前路的荆棘，我定会将其妥善保存，内化于心。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"温故而知新","slug":"life-11","date":"2023-02-20T11:26:27.000Z","updated":"2023-02-20T12:46:48.129Z","comments":true,"path":"2023/02/20/life-11/","link":"","permalink":"https://nju-kevin.github.io/2023/02/20/life-11/","excerpt":"","text":"今天复习了一天数学分析，上学期由于笔记记得很认真，因此复习的时候发现内容还是很多的，即使苗栋已经通知有三部分（变量代换公式的证明，Fourier变换和特殊函数）不考，然而除开这三部分的内容也非常丰富。在看笔记的时候，偶然发现很多之前所未能完全理解的东西，或者是已经理解了的东西，在这一次看又有新的收获，这同时也体现了苗栋的数分课有着足够的深度和广度，值得反复参考。 在Fourier级数一块，不仅有最原始的定义，点态收敛和一致收敛的条件，苗栋还介绍了一般的$Parseval$恒等式以及其应用，可以说，正是介绍了该等式的应用，才让我意识到许多问题都可以换一个角度，从Fourier级数的角度进行思考。此外，从函数的Fourier系数与其导数的Fourier系数的关系出发，对于Fourier系数的估计能与原函数的可微性建立联系，进而得到一个连续函数实解析的充要条件。在Fourier级数的应用方面，介绍了等分布，以及等分布的等价条件，以及无理数的倍数的小数部分在$(0,1)$上是等分布的重要结论。 含参变量积分部分，苗栋首先系统地介绍了不同条件下，一致收敛，求导可换序，可逐项积分等的条件（由$Dini$定理和一致收敛保持连续性的定理也可以看出一致收敛是比连续性更强的条件）；另外也提及了比较重要的几个积分：$Laplacian$积分，$Fresnel$积分等。 广义重积分部分，从容许集（$rectifiable$）到集合的穷竭（以及欧式空间的开集都有穷竭这个重要结论），还介绍了$\\mathbb{R}^n$上的$Laplacian$算子的球坐标与直角坐标的转化公式（听课的时候认为很震撼！）.这部分主要就在于坐标变换公式，也需要结合高等代数的知识（例如正定对称矩阵可正交对角化），变量替换公式是核心。 这次复习除了加深巩固了基础知识，我还注意到苗栋课上讲过的一个定理： \\exists f \\in C_{2\\pi}，其Fourier级数在某处发散 想起来$Papa Rudin$的第五章$Banach$空间中就讲过类似的问题，而其证明需要用到泛函分析四大定理之一：$Banach-Steinhaus$定理（也称“共鸣定理”，语出秦理真）.苗栋在课上证明的是存在一个函数，在$x$处的部分和发散，巧妙地利用了周期函数空间这个$Hilbert$空间上的范数进行了证明，其过程除了因为数学分析的限制不能应用共鸣定理以外都是相同的，甚至苗栋的证明过程对$Papa Rudin$上还算有所补充，那就是如何对$\\text{sgn}\\{D_N\\}$用连续函数逼近，$Papa Rudin$上没有说明直接跳过，而苗栋使用的方法也很经典，巧妙地运用了数学分析书本上的一处知识，那就是一个连续函数和一个鼓包函数（$bump function$）进行卷积（$convolution$）可以得到该函数的光滑逼近！从而，利用共鸣定理，可以将苗栋所讲的定理进行推广，实质上是，给定任意的$x_i$，都可以找到连续周期函数空间$C(\\mathbb{T})$中的一个稠密的$G_{\\sigma}$集，使得在这个$G_{\\sigma}$中的函数在给定的$\\{x_i\\}$处都发散！ 随着学习的深入，对于过往的知识的理解也会加深，这其实也是我决定利用这学期的一些时间打好数分高代解几等课程基础的原因，也只有多思考，才能发现数学中的许许多多的乐趣。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"数据库概论漫谈","slug":"life-10","date":"2023-02-19T08:24:54.000Z","updated":"2023-02-19T09:07:51.439Z","comments":true,"path":"2023/02/19/life-10/","link":"","permalink":"https://nju-kevin.github.io/2023/02/19/life-10/","excerpt":"","text":"今天白天大多时间都在复习数据库，准备晚上的考试。复习的过程中，发现数据库其实是一门很实用，很应用的学科。而且和C++不同，数据库理论与实验并重，数据库中有很多概念，从数据库的结构，到数据模式，模型，再到具体的一些对象，例如数据库，数据表，事务，规则，约束，游标，函数，索引，视图，触发器，存储过程等等，每一个对象都有着其独特的作用和语法结构。 理论部分比较重要的有：E-R图和关系模型的转化，关系模式的规范化（第一范式为属性不可拆，第二范式为非主属性必须完全依赖与关系中的所有主属性；第三范式为关系模式中不能有传递依赖）。 实验部分的代码与C++有类似之处，但仍有许多不一样的地方，比较重要的有：建库，建表，查询语句（内连接，左外连接，右外连接，交叉连接，除法），对数据库，数据表的修改和删除，建立索引，建立视图，自定义函数（标量函数，表值函数，多语句表值函数，以及SQL中常用函数的用法），建立触发器（Insert，Delete，Instead of，After），建立存储过程（利用游标读取） 大致来看，内容还是有些杂的，并且不同的对象有不同的语法，但对于不同的对象的理解有助于我们记住相应的语法，例如，索引是建立在某张表的某一列上的，于是建立索引的时候就需要 create nonclustered index on student(sid) 而视图是一张虚拟表，于是建立视图时的代码为 create view view_1 as select ... from ... where ... 创建函数的时候，如果函数需要输入参数，需要用变量的形式列出并附上数据类型，例如 create function my_function(@score int) returns char(2)/table/@ftable table(...) as begin ... end 游标也有其格式，声明游标变量时， declare @cur cursor set @cur = cursor for select... open @cur fetch next from @cur (into ...) while @@fetch_status = 0 begin ... fetch next from @cur (into...) end close @cur deallocate @cur 触发器是建立在表上的，在写触发器的定义的时候，注意有两张很重要的表：Deleted表和Inserted表。当执行检查操作不允许时，要执行rollback transaction操作，例如 create trigger tri on student after insert as if ... ... rollback transaction else ... return 具体的操作需要结合题目要求进行完成，写函数的过程其实与C++编程类似，循环的边值问题等常见的“坑”同样也是需要多加注意的地方，由于是纸质书写，所以无法运行，这就需要具备“人工编译运行”的能力，这一点也是与C++类似的地方，但总体而言，代码的思维量不及C++多，但细碎的地方，需要注意的小细节会更多，这么看，数据库实际上还是一门很友好的程序课。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"买书与读书的纠缠","slug":"life-9","date":"2023-02-18T10:37:59.000Z","updated":"2023-02-18T11:09:51.295Z","comments":true,"path":"2023/02/18/life-9/","link":"","permalink":"https://nju-kevin.github.io/2023/02/18/life-9/","excerpt":"","text":"考试周正式开始。关于白天考的两门学科，我认为，ODE的出卷是比较正常的，也考察的尽可能全面了（虽然并没有涉及适定性以及流的相关内容），计算题思考量不算大，但计算量还是很充分的（但是最后一道计算题对三阶矩阵求逆显然是没有时间算的类型）。证明题第一道类比Wronski行列式的公式 W(x)=W(x_0)e^{\\int_{x_0}^{x}tr(A)ds}第二题考察$Green$函数以及利用压缩映像原理证明不动点，难度不算大。以往考完试以后我便会在很长一段时间内，再也不看这门学科，甚至彻底扔掉。但这次我不打算这么做。在考试周结束以后，我打算对ODE的学习进行深入和强化。ODE是分析学中很重要的一个方向，涵盖的内容不仅仅是解方程，更有关于方程背后更一般的理论的探索。经过上个学期的ODE的学习，我现在对于一般的常见方程的求解方法以及关于适定性，边值问题的部分有了了解，进一步，我将对更一般的方程的解法，复微分方程系统，以及包括$Sturm-Liouville$特征值问题在内的丰富内容进行更完整的学习。 大学物理的卷子，可以看出肖明文老师为了避免同学们只做样卷的现象做出了一些努力，即思路仍按照样卷，但是细节部分做出了改动，比如粒子没有给夸克的组成，单位换算的一些常识没有给出等等。在考场上，因为这些改动，我也颇费了一些功夫，最后得出了一个我自认为正确的结果。随着数学学习的深入，我已经能够很明显地感受到数学和物理之间风格的不同了，并且潜移默化中更能接受数学的那一套理论，不过我认为这只是由于对于物理我并没有花太多的时间，导致看到所谓的$Schrodinger$方程等等觉得不够美观。物理的理论框架最终还是需要数学来进行搭建。 说了这么多，其实都是为了引出今天想讨论的一件事情，那就是买书和看书 的纠缠。为什么说是纠缠，因为这或许是很多人在学生时代所会经历过的一种幻觉，那就是由“我买了很多书”自然而然得出“我会看很多书”。考完试看到舍友买了Stein的分析四部曲（分析学经典名著，即Fourier分析，复分析，实分析，泛函分析），且不论这四本书总价高达二百五十元，光是把这四本书啃下来，就足够花时间的了，更不要说能够掌握其中的精髓。当时我对他肃然起敬。等他走后，我无意中看到了他的书架，上面的书大多是崭新的，除了刚买的Stein四部曲以外，还有两本中文的《实变函数与泛函分析》，以及一些其他的参考书。 再说一个例子，我的一个数学系同学，这学期光是报名选修课就报了五门，其中三门还在鼓楼，每周三每周五都要从仙林做地铁去鼓楼上课。如果我只是说到这，你可能会很佩服他的毅力。然而，事实却是，课内的考试来不及复习，一些参考书都只是看了前几章，学的东西是很多，很杂，但基础还没打好，便迫不及待在摇摇晃晃的地基上建立高楼大厦。 我说这两个例子的目的并不是为了批判什么，而是这两个例子让我思考，现在的学生都有一个通病，就是急功近利，好高骛远，耐心不够。为什么这么说，实不相瞒，我之前也有段时间是这样的，基础还没有打好，便急于去学习那些看起来高大上的知识，这给自己，给别人都造成了一种假象，然而最终结果是，地基不稳，高楼大厦都得推倒重来。买书是为了什么，为了更好地看书。现在的时代和以前不一样，以前大多数书本都没有电子版，想要看书只能去买纸质书，而现在不一样，几乎所有的书在网上都能找到电子版，买书的目的不应该是为了充实书架，而是对自己的学习进行一个辅佐和帮助的作用，关键还是在于读书，而不是买书。买了书，不一定能学到书中的精髓，不买书，也未必只能浮于表面。最重要的一点还是，要通过读书，研究书（也就是所谓的做题目），领略到每本书中理论的关键所在，并最终形成自己的理论体系。 共勉。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"网","slug":"life-8","date":"2023-02-17T00:53:49.000Z","updated":"2023-02-17T01:20:30.657Z","comments":true,"path":"2023/02/17/life-8/","link":"","permalink":"https://nju-kevin.github.io/2023/02/17/life-8/","excerpt":"","text":"记得有一篇微小说，题目是生活，内容只有一个字：网。现在发现，何止是生活，世上任何事物都是一张网。譬如这学期的数学课，除了离散数学，其他的都是围绕着测度论展开的。为什么测度论这么重要呢？就是因为一般的Riemann积分的局限性，于是会很明显地发现这学期开始包括以后，研究问题都会建立在测度空间上，不仅是概率论也好还是实分析，Fourier分析，在原来的一维实直线上有一套理论，那么类似的，在Lebesgue可积空间$L^p$空间上，同样也可以研究实变函数，函数的Fourier系数，Fourier级数，Fourier变换等等。 昨天上的分析学专题选讲，孙永忠老师从$L^2$空间引入，介绍了$Hilbert$空间上的内积，并由正交基引入Fourier级数，这就是$Papa Rudin$上第四章所述的内容，这个定义应该是目前为止我见过的最一般的Fourier的定义。有趣的是，课后我询问他Stein的Fourier分析时，他直言，Stein是写给那些大一还没学过微积分的同学看的Fourier分析教程，难怪我在学习的时候发现其中的定义一直都建立在$\\mathbb{R}$上，而没有推广到一般的$Hilbert$空间上。因此在学习$Papa Rudin$的过程中，我认为也很有必要更系统地学习一遍Fourier分析理论，这对打牢数学功底是大有裨益的。 这段时间一直是复习旧知识与学习新知识交替的阶段，合理安排时间，好好把握自己的复习节奏，在对旧知识印象加深的同时又能增进对新知识的理解，长期以往，自然是百利无一害的。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"ODE的那些事","slug":"life-7","date":"2023-02-16T12:57:27.000Z","updated":"2023-02-19T08:30:13.227Z","comments":true,"path":"2023/02/16/life-7/","link":"","permalink":"https://nju-kevin.github.io/2023/02/16/life-7/","excerpt":"","text":"谨用这篇文章简要阐述我学习ODE的那些日子。 ODE的老师是数学系的程伟，啤酒肚，头发也有些白，下课喜欢在外面抽烟，上课的节奏没有把控，有些内容讲得也不够透彻令人云里雾里，但我还是坚持记笔记和板书，甚至上课的时候觉得程伟把他的笔记发给我们自学效果都比听课好。 复习的时候才知道，上课哪怕没有在听他讲课自己看书记笔记，都比不去教室强。不知道是为什么，复习的过程中脑海中时常会蹦出一些程伟课上所说过的话，说明即使我已经忘了他讲了什么，但我的脑子没忘记。我想这得益于我有的时候虽然上课不在听，但至少在跟着他的节奏走，在学习ODE这门课，而不是在干与这门课无关的事情，这在我今天看来，或许是十分重要的。考试的时候就能知道，每个人平时的学习情况是怎么样的，之前偷的懒都会在考试的时候加倍奉还。但由于后来我记笔记仅仅停留在了动手的层面而没有入脑，导致消化的时间并不够，这也是为什么复习阶段我花了很多时间看笔记才能明白这门课所讲授的内容的思路，由此可见，记笔记只是第一步，更要多消化，多在课后看看思考思考。今天不知道在哪篇文章上看到的，为什么要持续努力，就是为了让大脑保持持续的思考，从而才能提高思想的深度。 ODE这门课其实学校里教授的并不是很深。上半学期应用部分介绍了一阶线性、非线性的方程的求解方法，理论部分主要讲述了方程解的存在性、唯一性，解的延拓，极大解极小解等；下班学期的应用部分介绍了线性方程组的齐次、非齐次的解法，以及高阶方程齐次、非齐次的解法，以及物理模型（Kepler，简谐振动单摆，悬链线）；理论部分介绍了流的概念，进一步介绍了适定性（关于解和初值的连续依赖性以及关于参数的可微性），二阶方程的边值问题。应该说，下班学期更偏应用一点，但仅仅是了解方程的解法，就能耗费很多的功夫，因为只有知道原理以后才能更好地理解如何解方程，否则只背公式很难对公式的含义有一个合理的理解。 复习到现在我觉得大体都很有把握了，来学校以后的复习阶段，不敢说没有浪费时间，但我有自信说我尽力了，我利用了每一段我可以利用的时间并且也努力地去提高效率。合理地规划，考试尽力而为即可。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Fourier分析漫谈","slug":"life-6","date":"2023-02-15T00:19:28.000Z","updated":"2023-02-15T01:19:32.525Z","comments":true,"path":"2023/02/15/life-6/","link":"","permalink":"https://nju-kevin.github.io/2023/02/15/life-6/","excerpt":"","text":"本来是前几天想谈一谈这个话题的，但是由于之前时间有些紧张，从而一直没能实现。今天正好一整天没课，于是对我目前为止对于基础Fourier分析的理解以及学习内容进行一个概述。 Fourier分析是一门博大精深的学科，其源头还是来源于物理问题，即人们所熟知的热方程，Dirichlet问题，波函数。从这一点上来说，Fourier分析和常微分方程（ODE）有类似之处，二者都不是纯数学，都有物理问题中的应用，也都是运用数学的工具和手段解决问题。当然，作为一门学科，其本质的理论一定也是必要的，因此这两门学科的理论部分仍是分析学的。 首先谈一谈Fourier分析。Stein的Fourier分析从热方程波函数入手，介绍了Fourier分析的来源。初读这本书的时候我并没有很在意这些问题，直接跳过读第二章的理论部分，第二次读这本书的时候（也就是2023年春节）我才意识到事实上Fourier的应用也同样重要。 Fourier的理论分析部分，Fourier分析研究的是单位圆周上的函数，也就是周期为$2\\pi$的函数，从Fourier系数的定义 \\hat{f}(n)=\\frac{1}{2\\pi}\\int_{-\\pi}^{\\pi}f(x)e^{-inx}dx以及相应的Fourier级数 f(x) \\sim \\sum_{n \\in \\mathbb{Z}}\\hat{f}(n)e^{inx}有这个级数从而就需要研究其敛散性。这里就是分析学的内容了，由于是无穷级数，所以就有两种收敛方式：点态收敛（Pointwise Convergence）和一致收敛（Uniform Convergence）。数学分析里我们知道，一个级数点态收敛，收敛到的函数不一定连续，只有一致收敛才能保证连续性。因此又有一个问题，那就是$f$需要满足什么样的条件，Fourier级数点态收敛/一致收敛？这里对于点态收敛，苗栋讲的很清楚，三个条件，任何一条都能推出点态收敛：PDF（Piecewise Differentiable Function分段可微，或者更强的分段光滑），Lipschitz，monotone（单调）；而一致收敛需要的条件更强，不仅$f$有要求，还对$f’$有要求。 这个时候，注意到一个函数的Fourier级数的和函数不一定就等于原来的函数，因此又出现了一个问题，那就是一个函数的Fourier级数什么时候收敛到自身？当$f$的条件并不是很强的时候，级数是$Cesaro$可求和到自身，这里便体现出$Abel$求和与$Cesaro$求和的作用来。同样的，级数里的研究一样，Fourier级数什么时候可以逐项求导，逐项积分（即求导与积分能否与求和换序的问题）也与级数里的研究方法类似。 另外，注意到一个函数的Fourier级数是一个三角级数，那么反过来，是不是所有三角级数都是某个函数的Fourier级数呢？答案很显然是negative的，这时需要三角级数$sinnx$前面的系数是$o\\left(\\frac{1}{n}\\right)$。 Fourier分析中的另一个常用的工具就是卷积（Convolution）。注意到Fourier级数的部分和 S_N=f\\ast D_N其中$D_N$为DIrichlet kernel。卷积实际上是一种平均，将两者的性质进行一个“平均”。核理论在Fourier分析中也十分重要，比较重要的kernel有Dirichlet kernel，Fejer kernel，Poisson kernel，Heat kernel。Poisson kernel是解决Dirichlet问题时用到的kernel，Heat kernel是解决热方程问题时的kernel。Stein介绍了good kernel的概念，就是因为good kernel具有良好的性质，与good kernel做convolution的函数最终都会收敛到其本身。同时，以热方程为例，实直线上的热方程与单位圆周上的热方程的热核有区别，但二者又是通过Poisson Summation Formula联系起来的。 另一个Fourier分析中的重要内容是Fourier变换，且Fourier变换和卷积之间有着很好的桥梁进行联系，同时，Fourier变换还能解决某些偏微分方程，由于其运算的独特的性质。 Fourier分析还有着很多应用，热方程、Dirichlet问题，等分布（Equidistribution）等等。同时还可以考虑有限Abel群上的Fourier分析，即有限Fourier分析等。 在学习红皮书（Papa Rudin）的时候，我发现Fourier系数的符号定义$\\hat{f}(n)$实际上是Hilbert空间里 \\hat{x}(\\alpha)=(x,u_{\\alpha})的特例。这是由于单位圆周上的连续函数空间是Hilbert空间，从而也是Banach空间，这使得对于更一般的空间上的研究的结论可以应用到Fourier分析中。由Hilbert空间中的结论我们可以得到Riesz-Fischer定理：如果数列的绝对值的平方所构成的无穷级数求和有界，那么它才能是一个函数的Fourier系数。再例如，Banach空间中研究Fourier级数的点态收敛，根据Banach-Steinhaus定理，不仅可以得到如果只有连续这个条件，其Fourier级数不一定点态收敛，还能得出，如果在某点不收敛，那么一定有一个紧的$G_{\\sigma}$使得在其中都不点态收敛。 这其实就告诉我们学习一门学科的时候不能仅仅看这一门，而应该多学科相互照应，融会贯通。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"对于学习方法的一些思考","slug":"life-5","date":"2023-02-14T05:33:50.000Z","updated":"2023-02-15T12:51:41.136Z","comments":true,"path":"2023/02/14/life-5/","link":"","permalink":"https://nju-kevin.github.io/2023/02/14/life-5/","excerpt":"","text":"今天早上旁听了泛函分析课程，大三的同学数学分析和高等代数基本上都忘得差不多了，点集拓扑也不是都学过，这不禁让我感慨，一些数学基础课程放在大一学本来就是为了后续课程打基础，而不能考完试了就忘掉。泛函分析算是一种软分析，而实分析就是硬分析。秦理真老师幽默地说：“我的硬分析功底测度为零。”泛函分析研究的是无穷维线性空间上的“矩阵”（叫做算子），按秦老师的说法就是用数学分析研究高等代数，类比于有限维线性空间。因此可以看出，高等代数和数学分析的基本功要足够扎实才行。 后来上概率论，一上来就是$\\sigma$代数和$Borel$集，而这些就是$Lebesgue$积分的定义域，可见实分析是很多课程的基础，普通的$Riemann$积分早已不再够用，而这也是我这学期的主要目标之一，即打牢分析学功底，从数学分析到实分析复分析，Fourier分析，泛函分析，这些都是分析学的基础，也是代数、几何与拓扑、概率等方向的基础。通过一遍又一遍的反复思考，原本对于点集拓扑的一些疑难的不清楚的地方也渐渐都有了眉目。 复习常微分方程的时候，我反复审视我的笔记，并同时试图讲给自己听，发现了当时记笔记的时候的一些疏漏，同时对于长篇大论的证明过程也有了全新的理解和彻底的掌握。此时脑中却不禁回忆起之前程伟老师所说过的话，颇有恍然大悟之感。 复习的过程中，我再一次感受到平时上课认真听讲的重要性。由于我上学期的大部分时间都认真记笔记，复习的时候省去了抄写笔记的时间；由于课上的部分时间听得很认真，所以复习起来的困难并不大；同时这也表明，上课的确有部分时间听课效率不高，这导致我现在复习的过程不能做到行云流水般流畅。因此这也是我这学期想要改进的地方，上课的时候不管内容自己有没有学过都要认真记笔记，把觉得对自己有用的东西记下来，认真听讲并勇于纠错（比如今天概率课上我发现了老师对于Borel集的定义上有着很明显的错误，应该是打印错误）并且很重要的一点是，课后一定要及时消化，而不能留到考试前复习的时候消化，否则看笔记会看的很累且陌生。因此，及时消化笔记是我这学期所应该改进的地方。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"漫谈","slug":"life-4","date":"2023-02-13T02:06:07.000Z","updated":"2023-02-13T14:18:52.683Z","comments":true,"path":"2023/02/13/life-4/","link":"","permalink":"https://nju-kevin.github.io/2023/02/13/life-4/","excerpt":"","text":"又到了一学期一度的学期课程补退选日，一到规定的时间，由于进入网站的人数过多，导致早半个小时便进入网站等候的我被网站卡退了出来。本以为此次抢课会一无所获，所幸在几分钟后还有一节通识课没有满，暂时先选上了一节。另外，我还报了一门大三的数学选修课《分析学专题选讲》，看内容就是讲的Fourier分析，正好我寒假里系统地学习了Stein的Fourier分析，因此正好学习一下加深理解。 这学期学的数学课选了不少，既然选了，既然决定学下去，就好认真地、一丝不苟地学。另外我还准备在周二和周四的早上旁听泛函分析，为了准备即将到来的丘赛。今天在图书馆学习了一些红皮书上Banach空间的内容，由于和Fourier分析的内容有重合之处，让我体会到了Hilbert空间和Banach空间里更普适的Fourier分析，我认为是大有裨益的。另外在下午对数学分析和常微分方程进行了复习，复习在这周是重中之重，并且这几门都是很重要的内容，必须要掌握好了。今天晚上听上同调的课程，也再一次让我体会到了数学分析和高等代数基础的重要性。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"观海难言","slug":"life-3","date":"2023-02-12T12:14:39.000Z","updated":"2023-02-12T13:05:15.817Z","comments":true,"path":"2023/02/12/life-3/","link":"","permalink":"https://nju-kevin.github.io/2023/02/12/life-3/","excerpt":"","text":"（标题出自《史记·孔子世家赞》） 今天的主要任务是复习大学物理和常微分方程，在复习的间隙还调节了一下翻了翻$Papa Rudin$，学了点$Banach$空间的一些基本定理（$Baire$定理等）。复习大学物理的过程注定不会是轻松的，很多公式并不知道如何运用，在做题以及题目之间的对比之中才知道原来这个公式是这个道理，这就叫看出公式背后隐藏的东西，而不是看表象。物理是这样，数学又何曾不是这样？每当我发现些新的东西之后，只有无尽的赞叹，这种可意会不可言传的感受，即观海难言也！ 这学期由于课程少，学分少，加上可能存在的最低学分的限制，因此我选修了一门大三的数学课《从微积分到上同调》，老师是苗栋的好朋友石亚龙老师，我看了一下课程周历，是从微积分中的曲面积分入手，利用上同调的工具解决一些光滑向量丛的计算问题，可以说是一门基础很浅但达到的目的很深刻的一门课，原本学这门课是打算先看看能不能听懂，不过按目前的状况来看退了这门课学分就不够了，因此我打算好好学一学。事实上数学基础课（也就是数学分析高等代数解析几何）是十分重要的，并且认为因为基础所以不屑一顾的想法是十分危险的。我自己深知这三门课的基础还不够牢，因此考完试的第一要务就是打好这三门课的基础。为何说这三门课的内容足够深邃，是因为每次学习其中的内容，我都能发现一些之前没注意到的东西，这一点，那些教了几十年基础课的数学老师应该深有体会。我本人对分析学比较感兴趣，则更应该对之多加研究。 关于期初考试的复习由于我的合理规划，现在正有条不紊地进行并且即将进入尾声，复习考试的过程亦是打牢基础的过程，实际上本科数学所学的数学课都是基础课，现在把基础打打好，以后进行更高层次的学习研究就会轻松很多。 以前经常会有那种想快点往前学的想法，不知为何最近这种好高骛远少多了，更多的是踏踏实实把现在学的、以前学的学学好，把基础打深厚了再建高楼大厦。每个行业都是一片海，观海难言是出于敬畏和景仰，在意识到前方茫茫的情况下仍划一条小船前进是信念和追求。","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Problems in Miao's exams","slug":"math-6","date":"2023-02-08T14:45:33.000Z","updated":"2023-02-08T15:46:01.085Z","comments":true,"path":"2023/02/08/math-6/","link":"","permalink":"https://nju-kevin.github.io/2023/02/08/math-6/","excerpt":"","text":"This article discusses some of the problems in Miao’s exams, and the solutions will be completed as soon as possible. Exercise 1 Prove that \\int_{0}^{\\infty}{\\frac{s^{2022}}{e^{\\pi \\sqrt{s}}-1}ds} \\in \\mathbb{Q} Solution. Changing variables gives \\int_{0}^{\\infty}{\\frac{s^{2022}}{e^{\\pi \\sqrt{s}}-1}ds}=2\\int_{0}^{\\infty}{\\frac{t^{4045}}{e^{\\pi t}-1}dt}Consider \\begin{aligned} \\int_{0}^{\\infty}{\\frac{t^{2n+1}}{e^{\\pi t}-1}dt}&=\\int_{0}^{\\infty}{t^{2n+1}\\sum_{k=1}^{\\infty}{e^{-k\\pi t}}dt} \\\\ &=\\sum_{k=1}^{\\infty}{\\int_{0}^{\\infty}{t^{2n+1}e^{-k\\pi t}}dt} \\end{aligned}Also, note that \\int_{0}^{\\infty}{t^{2n+1}e^{-k\\pi t}}dt=\\frac{(2n+1)!}{(k\\pi)^{2n+2}}Hence \\sum_{k=1}^{\\infty}{\\int_{0}^{\\infty}{t^{2n+1}e^{-k\\pi t}}dt}=\\sum_{k=1}^{\\infty}{\\frac{(2n+1)!}{(k\\pi)^{2n+2}}}=\\frac{(2n+1)!}{\\pi^{2n+2}}\\zeta(2n+2)The proof is completed since \\zeta(2n+2)=(-1)^{n}\\frac{2^{2n+2}B_{2n+2}\\pi^{2n+2}}{2(2n+2)!} Exercise 2","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Comments About Problems in Papa Rudin","slug":"rudin-1","date":"2023-02-01T10:18:38.000Z","updated":"2023-03-02T11:54:50.615Z","comments":true,"path":"2023/02/01/rudin-1/","link":"","permalink":"https://nju-kevin.github.io/2023/02/01/rudin-1/","excerpt":"","text":"概要这篇文章将对《Real and Complex Analysis》（亦即所谓的“Papa Rudin”）的课后习题进行思路的阐述，并重点讨论每道题所需用到的知识点以及定理，而不会详细地写出每道题的严格数学证明（这件事早在2019年就有教授做过了，而且证明写得十分详细）。每道题我都将讲述我个人的解题思路以及想到的相关知识，梳理的同时并对这本名著的基本内容进行概述。 Chapter 1 Abstract IntegrationExercises 1 Does there exist an infinite a-algebra which has only countably many members ? 这道题问是否存在拥有可数个元素的无穷$\\sigma$代数，看上去很宽泛，貌似很难具体入手。事实上，$\\sigma$代数是一个很大的集族，它的性质也很好，包含了空集和全集，同时只要一个集合在里面，那么其补集也在；还对可数并封闭。需要注意的是，在书中关于$\\sigma$代数定义的Comments部分，揭示了其关于可数交也封闭，且任何两元素的差集也在$\\sigma$代数中的性质，这往往是容易忽视的一点，但的确很好用。 因此既然这个$\\sigma$代数没有确切的模样，不如从其中一个元素入手。可以找一个非空的属于该$\\sigma$代数的集合$E$，那么$E$和$E^c$中一定有一个是无限集，不妨为$E$，$E$本身也形成了一个子可测空间（只需要让$E$中的$\\sigma$代数是原来的$\\sigma$代数中的集合与$E$的交集即可），然后$E$中又可以取真子集，这样递归地下去，得到一个无穷递降子集列，每个集合都是无限集，且都在$\\sigma$代数中，由于$\\sigma$代数对差集也封闭，这个链集中的相邻集合的差集也在$\\sigma$代数中，这些差集与自然数构成了一一对应，$\\sigma$代数还需对这些差集的任意并封闭，这就与自然数的子集构成了一一对应，而自然数的子集个数是不可数的，从而$\\sigma$代数也不可数。 与自然数建立双射的过程并不困难，加上$\\sigma$代数需要满足的可数并性质便可以让其中元素不可数，因此这道题告诉我们无穷$\\sigma$代数是很“大”的. Exercise 2 Prove an analogue of Theorem 1 .8 for n functions. 这道题对书上的Theorem 1.8进行了简单的推广，但证明方法没有任何区别. Exercise 3 Prove that if f is a real function on a measurable space X such that { x : f(x) &gt; r} is measurable forevery rational r, then f is measurable. 看上去是很常规的概念题，使用集合论应该就可以解决。做的时候发现的确是这样，利用定义，证明$\\mathbb{R}$中开集的原像可测，由题意可以知道左闭右开区间的原像可测，而开区间可以用左开右闭区间进行可数逼近，于是$f$可测. Exercise 4 这是常规的数学分析题，利用上确界下确界的性质即可，但注意区别的是这里最好使用书上给出的结论（Theorem 1.14）而不是数学分析里的，因为或许某些数学分析书里的定义不具有普适性。核心使用的结论是 \\lim_{n \\to \\infty}\\sup f_n=\\inf_{k \\geq 1}\\{\\sup_{i \\geq k} f_i\\} Exercise 5 (a) Suppose f: X→ [- oo, oo] and g: X→ [- oo, oo] are measurable. Prove that the sets{x : f(x) &lt; g(x) }, {x : f(x) = g(x)}are measurable.(b) Prove that the set of points at which a sequence of measurable real-valued fu nctions converges(to a finite limit) is measurable. 第一反应就是作差，得到的新函数根据定义显然是可测的。第二问当该实值可测函数列收敛时，可以取极限上确界得到极限函数，如果要证明使得函数列收敛的$x$值构成的集合（记为$E$）可测，此时应该想到的是可以利用函数列可测（由Theorem 1.14极限函数也可测）的性质将$E$表示为一些可测集的并或者交即可。根据极限的定义，对$n$取并再对$\\epsilon$取交得到的集合即为$E$，从而$E$可测. Exercise 6 Let X be an uncountable set, let 9Jl be the collection of all sets E c: X such that either E or Ec is atmost countable, and define mu(E) = 0 in the first case, mu(E) = 1 in the second. Prove that mu is asigma-algebra in X and that Jl is a measure on mu. Describe the corresponding measurable functions andtheir integrals. 这道题也是定义题，但做的过程中会发现测度的可加性貌似并不满足，从而引向最多可数集的个数最多只能有一个，否则会导出矛盾。其他地方按照定义一一验证即可. Exercise 7 这是对DCT的直接应用. Exercise 8 题中给出的函数$f$即是Fatou‘s Lemma不等号严格成立的一个例子，Fatou’s Lemma值得着重关注，在不少定理的证明中都有出现. Fatou’s LemmaIf $f_n:X \\to [0, \\infty]$ is measurable, then \\int_{X}{\\left(\\lim_{n \\to \\infty}{\\inf{f_n}}\\right)d\\mu} \\leq \\lim_{n \\to \\infty}{\\inf{\\int_{X}{f_nd\\mu}}} Exercise 9 这道题可以运用数学分析里的近似方法，并结合DCT和Fatou’s Lemma（$\\alpha&lt;1$）即可，比较常规. Exercise 10 由$f_n$均有界以及一致收敛的性质可以得到极限函数也有界，从而直接运用DCT即可.（可取$g(x)=M$） Exercise 11 证明两集合相等，即是证明相互包含，于是原定理需要证明$\\mu(A)=0$则转化为了证明 \\mu\\left(\\bigcap_{n=1}^{\\infty}\\bigcup_{k=n}^{\\infty}E_k\\right)=0这里需要运用测度的性质，对于无穷递降集合列，每个集合的测度将趋于该集合列可数交的测度，即书上的Theorem 1.19. Exercise 12 这道题在数学分析中也有对应，是数学分析中积分的推广，利用测度积分的定义以及上确界下确界的性质即可。到这里我们也可以看出数学分析对于实分析复分析的作用，上确界下确界在抽象积分中发挥着巨大的作用. Exercise 13 Show that proposition 1.24(c) is also true when c = oo. 无穷的情况可以用有穷逼近，对于极限为$\\infty f$，可以用$f_n=nf$取极限得到，$f_n$容易知道也是可测的，而且这是一个递增的非负函数列，运用本章中另一个重要定理MCT即可. Chapter 2 Positive Borel MeasureExercise 1 Let {fn} be a sequence of real nonnegative functions on R 1 , and consider the following four statements(a) If/1 and /2 are upper semicontinuous, then /1 + /2 is upper semicontinuous. (b) lf/1 and /2 are lower semicontinuous, then f1 + /2 is lower semicontinuous. (c) If each fn is upper semicontinuous, then Lf fn is upper semicontinuous. (d) If each /,. is lower semicontinuous, then Lf f.. is lower semicontinuous. Show that three of these are true and that one is false. What happens if the word “ nonnegative “is omitted ? Js the truth of the statements affected if R 1 is replaced by a general topological space? 此题主要考察的上半连续和下半连续的定义，前两问将和函数上半连续或者下半连续的满足条件的$x$构成的集合表示成一些开集的并和交即可证明，即 I_{\\alpha}=\\bigcup_{0","categories":[{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"}],"tags":[]},{"title":"A Normal Integral","slug":"math-4","date":"2023-01-25T04:32:38.000Z","updated":"2023-02-24T00:17:19.160Z","comments":true,"path":"2023/01/25/math-4/","link":"","permalink":"https://nju-kevin.github.io/2023/01/25/math-4/","excerpt":"","text":"This is a classical problem about integral, and the solution of it is very primary, but there’re really many difficulties in calculating. I met this problem when trying to solve all the problems from 100 problems of definite integral, which turned out to be nearly impossible since I was busy at that time. But I think I’ll finish it someday. The formula was input at 2021.12.13. Calculate the indefinite integral: \\int{\\frac{1}{1+x^n}dx}where $n$ is a positive integer. Solution:When $n$ is even, let it be $2n$, \\frac{1}{1+x^{2n}}=\\frac{1}{n}\\sum_{k=1}^{n}{\\frac{1-x\\cos{\\frac{2k-1}{2n}\\pi}}{x^2+1-2x\\cos{\\frac{2k-1}{2n}\\pi}}}That leads to \\begin{aligned} \\int{\\frac{1}{1+x^{2n}}dx}=&-\\frac{1}{2n}\\sum_{k=1}^{n}{ \\cos{\\frac{2k-1}{2n}\\pi}\\ln{\\left| x^2+1-2x\\cos{\\frac{2k-1}{2n}\\pi} \\right| }}\\\\\\\\ &+\\frac{1}{n}\\sum_{k=1}^{n}{ \\sin{\\frac{2k-1}{2n}\\pi}\\arctan{\\frac{x-\\cos{\\frac{2k-1}{2n}\\pi}}{\\sin{\\frac{2k-1}{2n}\\pi}}} }+C \\end{aligned}Similarly, when $n$ is odd, let it be $2n+1$, \\frac{1}{1+x^{2n+1}}=\\frac{1}{2n+1}\\left( \\frac{1}{x+1}+2\\sum_{k=1}^{n}{\\frac{1-x\\cos{\\frac{2k-1}{2n+1}\\pi}}{x^2+1-2x\\cos{\\frac{2k-1}{2n+1}\\pi}}}\\right)which leads to \\int{\\frac{1}{1+x^{2n+1}}dx} \\begin{aligned} &=\\frac{1}{2n+1}\\left( \\ln{\\left|x+1\\right|}-\\sum_{k=1}^{n}{ \\cos{\\frac{2k-1}{2n+1}\\pi}\\ln{\\left| x^2+1-2x\\cos{\\frac{2k-1}{2n+1}\\pi} \\right|}} \\right)\\\\\\\\ &+\\frac{2}{2n+1}\\sum_{k=1}^{n}{ \\sin{\\frac{2k-1}{2n+1}\\pi}\\arctan{\\frac{x-\\cos{\\frac{2k-1}{2n+1}\\pi}}{\\sin{\\frac{2k-1}{2n+1}\\pi}}} }+C \\end{aligned}////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Radon Transform","slug":"math-3","date":"2023-01-25T04:12:09.000Z","updated":"2023-02-24T00:16:35.696Z","comments":true,"path":"2023/01/25/math-3/","link":"","permalink":"https://nju-kevin.github.io/2023/01/25/math-3/","excerpt":"","text":"This is a conclusion in Fourier analysis, it tells the relationship between Radon transform of a function and the function itself. The formula was input at 2022.04.08. If $f \\in \\mathcal{S}(\\mathbb{R}^3)$, then \\triangle(\\mathcal{R}^* \\mathcal{R}(f))=-8\\pi^2f Solution: First we know \\mathcal{R}(f)(t,\\gamma)=\\int_{-\\infty}^{\\infty}{\\hat{f}(s\\gamma)e^{2\\pi its}ds}Therefore \\mathcal{R}^*\\mathcal{R}(f)(x)=\\int_{S^2}{\\int_{-\\infty}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}dsd\\sigma(r)}Hence \\begin{aligned} \\triangle(\\mathcal{R}^* \\mathcal{R}(f))(x) & = \\int_{S^2}{\\int_{-\\infty}^{\\infty}\\hat{f}(s\\gamma)(-4\\pi^2 s^2)e^{2\\pi ix\\gamma s}dsd\\sigma(r)} \\\\\\\\ & = -4\\pi^2\\int_{S^2}{\\int_{-\\infty}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -4\\pi^2\\int_{S^2}{\\int_{-\\infty}^{0}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -4\\pi^2\\int_{S^2}{\\int_{0}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -8\\pi^2\\int_{S^2}{\\int_{0}^{\\infty}\\hat{f}(s\\gamma)e^{2\\pi ix\\gamma s}s^2dsd\\sigma(r)} \\\\\\\\ & = -8\\pi^2 f(x) \\end{aligned}////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"A problem about Fourier coefficients","slug":"math-2","date":"2023-01-24T07:56:42.000Z","updated":"2023-02-24T00:15:23.392Z","comments":true,"path":"2023/01/24/math-2/","link":"","permalink":"https://nju-kevin.github.io/2023/01/24/math-2/","excerpt":"","text":"This is actually an simple conlusion, but it really puzzled me a lot when I first encountered this problem. The essence of it is to decide whether there exists a Riemann integrable function on the circle whose k-th Fourier coefficient equal to $\\frac{1}{k}$. Consider the sequence $\\{a_k\\}_{-\\infty}^{\\infty}$, and $a_k=\\frac{1}{k}$ if $k \\geq 1$, $a_k=0$ if $k \\leq 0$.Show that no Riemann integrable function has $k$-th Fourier coefficient equal to $a_k$ for all $k$. Proof. Suppose that there is a Riemann integrable function $f$ s.t. f \\sim \\sum_{n=1}^{+\\infty}{\\frac{e^{in\\theta}}{n}}Consider the Abel sum of the above series: A_r(f)(\\theta)=\\sum_{n=1}^{+\\infty}{\\frac{r^ne^{in\\theta}}{n}}When $r \\to 1^-$, $A_r(f)(0)$ is unbounded since $\\sum_{n=1}^{+\\infty}{\\frac{1}{n}}$ diverges. However, note that A_r(f)(\\theta)=(f \\ast P_r)(\\theta) also, $f$ is bounded, and Poisson kernel is a good kernel, thus the convolution of $f$ and $A_r(f)$ is bounded, i.e. $A_r(f)(0)$ is bounded, which is a contradiction.////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Insteresting Couplets","slug":"life-1","date":"2023-01-24T04:41:53.000Z","updated":"2023-02-04T05:47:47.078Z","comments":true,"path":"2023/01/24/life-1/","link":"","permalink":"https://nju-kevin.github.io/2023/01/24/life-1/","excerpt":"","text":"正值2023年春节，摘录几条数学对联，与君共勉。 一上联：六千年数学，旷世传来，想初等代数，解析几何，集合理论，积分方程，何其博大精深，极目古今悠，莫惊疑数海茫茫，形山隐隐 下联：一万里长江，几人淘尽，仰割圆刘徽，算率冲之，流数牛顿，过桥欧拉，真是超凡入圣，放怀天地阔，须礼赞勋名赫赫，伟业煌煌 二上联：宏著传中外以立言,心灵独得。观洛水河图、四元玉鉴、九章算术、宫格幻方、欧氏原本、n阶矩阵、拓扑映射、复变泛函，何其博大精深！莫惊疑数海茫茫，形山隐隐，应悬梁刺股，更邀客谈经论典，乐门第昌盛，满园春风播春雨！ 下联：先贤彰古今而为治，道脉谁承？想祖率冲之、三角杨辉、八卦伏羲、筛法景润、堆垒罗庚、七桥欧拉、王子高斯、积分黎曼，确系超凡神圣！须礼赞勋卓赫赫，伟业煌煌，知继往开来，恒埋头助澜推舟，看桃李芬芳，炎黄华夏普华章！ 三上联：五百卷图书，散列桌上，宏编巨著，喜洋洋兴趣无穷。看高等代数，泛函分析，线性规划，随机过程，悉心研读，不妨请客探讨。趁年轻智敏，是应该博学勤专，正更长夜永，安排些美酒佳肴。莫辜负欧几里得，希尔伯特，马克劳林，拉格朗日 下联：六千年往事，浮现天际，大江东去，叹滚滚先贤何在？想伏羲画卦，刘徽割园，冲之算率，罗庚定理，伟业丰功，费尽移山力气。任风吹雨打，却依然流光溢彩，与日夜同辉，经万古环球敬仰。须记取九章妙论，四元奇术，五家共井，百鸡齐鸣","categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"}],"tags":[]},{"title":"Lebesgue Point","slug":"math-1","date":"2023-01-24T02:35:51.000Z","updated":"2023-02-24T00:14:55.265Z","comments":true,"path":"2023/01/24/math-1/","link":"","permalink":"https://nju-kevin.github.io/2023/01/24/math-1/","excerpt":"","text":"This conlusion is input initially at 2022.04.04. Problem: $f \\in L^1(R^k)$, then almost every $x \\in R^k$ is a Lebesgue point of $f$. Notes: $x$ is a Lebesgue point of $f$ if \\lim_{r \\to 0}{\\frac{1}{m(B_r)}\\int_{B(x,r)}{|f(y)-f(x)|dm(y)}}=0 Solution: Define (T_rf)(x)=\\frac{1}{m(B_r)}\\int_{B(x,r)}{|f-f(x)|dm}Put (Tf)(x)=\\lim_{r\\to 0}\\text{sup}{T_rf}We have to prove that $Tf=0$ a.e.[m]. For any $n \\in \\mathbb{N}_+$,there exists $g \\in L^1(R^k)$ s.t. $||f-g||_1 &lt; \\frac{1}{n}$. Since $g$ is continuous, $Tg=0$. Denote $h=f-g$. Hence Th \\leq Mh+|h|Since T_rf \\leq T_rg+T_rhHence Tf \\leq Mh+|h|$$. Then $$\\{Tf>2y\\} \\subset \\{Mh>y\\} \\cup \\{|h|>y\\}and m(\\{Tf>2y\\}) \\leq \\frac{3^k+1}{yn}Denote the union on the right side $E(y,n)$. Since $E(y,n)$ is independent of $n$, \\{Tf>2y\\} \\subset \\bigcap_{n=1}^{\\infty}{E(y,n)}Therefore $\\{Tf&gt;2y\\}$ is a subset of measure 0. Due to the completeness of the Lebesgue measure, we know $\\{Tf&gt;2y\\}$ is also of measure 0. Hence $Tf=0$ a.e.[m]. ////","categories":[{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]},{"title":"Welcome","slug":"Welcome","date":"2023-01-23T03:41:13.000Z","updated":"2023-01-24T02:22:27.070Z","comments":true,"path":"2023/01/23/Welcome/","link":"","permalink":"https://nju-kevin.github.io/2023/01/23/Welcome/","excerpt":"","text":"Hello and welcome! This is Kevin from NJU, and I’m a sophomore from Kuangyaming Honors School. This is my personal blog, in which I’ll share my daily life and thoughts about math since mathematics is my major. My blog may not be very detailed in analyzing math problems and theorems temporarily, since there is still much to learn and time is limited. But I’ll try to introduce my thoughts about them and some inspiring ideas. Moreover, I want to mention that the thoughts will be expressed in English, while articles about my life will be written in Chinese.","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2023-01-22T10:27:43.493Z","updated":"2023-01-24T01:25:23.069Z","comments":true,"path":"2023/01/22/hello-world/","link":"","permalink":"https://nju-kevin.github.io/2023/01/22/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"Life","slug":"Life","permalink":"https://nju-kevin.github.io/categories/Life/"},{"name":"Rudin","slug":"Rudin","permalink":"https://nju-kevin.github.io/categories/Rudin/"},{"name":"Lesson","slug":"Lesson","permalink":"https://nju-kevin.github.io/categories/Lesson/"},{"name":"Math","slug":"Math","permalink":"https://nju-kevin.github.io/categories/Math/"}],"tags":[]}